{"pages":[{"title":"About ME","text":"","link":"/about/index.html"},{"title":"tags","text":"","link":"/tags/index.html"},{"title":"categories","text":"","link":"/categories/index.html"}],"posts":[{"title":"Answers By Alice Munro","text":"你认为最完美的快乐是怎样的？ 星期天下午，我们喜欢长途散步，从我家后面开始，沿着铁路线走。我们会走到瓦瓦那什河湾栈桥，然后返回。我们谈论安乐死、遗传控制群体、是否有灵魂、宇宙是否最终是可知的。我们没有达成任何一致的看法。开始我们在秋天散步，接着是冬天。在暴风雪中，低着头争辩，手插在口袋里，细腻刺骨的雪打在我们脸上。争辩累了，我们会把手拿出来，伸开双臂保持平衡，试图在铁轨上走。 《女孩和女人们的生活》 你最希望拥有哪种才华？ 即便困难重重，生病、穷困、丑陋，你依然能珍惜你的灵魂，就像用盘子端着一枚珍宝走过人生。 《爱的进程》 你最恐惧的是什么？ 恨始终是一种罪过。你灵魂里的一滴仇恨，会扩散开来毁掉所有的色彩，就像白牛奶里的一滴黑墨水。 你最喜欢的消遣是什么？ 我的生活早已发生了疯狂的转变，我每天为之悔恨的事情同时也是我的骄傲。我感觉自己已经以全新的面貌重生于世。坐在桌边，双手捧着一杯咖啡或者红汤，直到它几乎没有一丝热气，就这么待上一小时。我漫无目的地读书，读那些早就想读的书里的散句。这些句子总是令我满足，它们是如此优美独特，总是让我陷入一种特别的状态，全然忘却了其他的词句。我恍惚而又警觉，与所有人隔绝却随时觉察着这城市本身——它似乎是个奇怪的地方。 《公开的秘密》 你认为程度最浅的痛苦是什么？ 嗯，这真是奇怪。想象之中，每当你支持什么的时候，总是会声音洪亮，而周围的人被你惊醒，感到羞愧不安。但，在真实生活里，他们却都笑得别有意味。你立刻就会明白，你所做的一切，不过是让自己变成大家下次一起喝咖啡时的笑料。 《快乐影子之舞》 你认为哪种美德是被过高地评估的？ 你真可怕，你知道。你像天使们一样可怕。你以为所有人都朝前走，像你一样勇敢阳光——哦，请别看我，亲爱的。不要看我——或许我不是你希望的样子，可你能感觉到我就在这里呀，对吗？ 《好女人的爱情》 你最喜欢男性身上的什么特质？ 生活的要义，哈里告诉劳莲，就是满怀兴趣地活在这个世界上。睁大你的眼睛，要从你所遇到的每一个人的身上看到各种可能性——看到他的人性。要时刻注意。 《逃离》 你最喜欢女性身上的什么品质？ 她知道在酒吧里苦苦等待一个再也不会出现的男人的那种滋味。等待来信，当众痛哭，也曾被不再爱的人纠缠。不过，她仍然觉得情事萌发的第一个信号如此美妙，仿佛是阳光照在皮肤上的温暖，是门廊里轻轻传来的音乐，或者像她经常说的那样，像是黑白电视广告忽然变成了彩色的。她不觉得这是在浪费时间，也不觉得曾经浪费过时间。 《公开的秘密》 你最厌恶什么？ 当人们告诉你有时候你要去面对，当他们催促你面对摆在你面前的痛苦、猥亵、讨厌的事实时，在这接近背叛的边缘，他们的声音里总是掩饰不住那种冷酷的庆幸意味，以及对伤害你的贪婪渴望。 《女孩和女人们的生活》 你自己的哪个特点让你最觉得痛恨？ 认识我自己，我认识的是我的邪恶。这是我隐秘的慰藉。我了解我最坏的地方。它也许比别人最坏的地方更坏。但我不在乎。用不着什么借口。我获得了平静。我是个恶魔吗？世界是这么说的，它既然这么说了，那么我就同意好了。不过，这世界对我没有任何意义。我就是我自己，也不会有机会成为别人。我说，我疯了，但疯了又是什么意思？精神不正常，精神正常，我只是我而已。那时候我改变不了自己，现在我也改变不了自己。 《幸福过了头》 你的座右铭是什么？ 改变法律。改变人。可我们又不想所有事情——不要从头到尾都是——都听凭外界指使。我们不想我们的本质，我们的一切，都被那样调制出来。 《好女人的爱情》 你最伤痛的事是什么？ 她像是肺里什么地方扎进去了一根致命的针，浅一些呼吸时可以不感到疼。可是每当她需要深深吸进一口气时，她便能觉出那根针依然存在。她用什么来取代他的位置？那个逐渐逼近的未来世界的奇特之处与可怕之处，就在于她不能融入其间。 你最看重朋友的什么特点？ 吸引她的——实际上是迷惑住她的——是在前寒武纪岩石层峦叠嶂的遮蔽后所能寻见的那种极端冷漠、重复、漫不经心以及对和谐的轻蔑。 《逃离》 什么让你感觉到最快乐？ 很少人，非常非常少的人，才拥有宝藏，如果你真的拥有，那你就千万不要松手。你必须别让自己路遇拦劫，从自己身边把它丢失了。 你希望以什么样的方式死去？ 我就是这样心怀秘密，感觉茫然，内心却又充满了力量。 《快乐影子之舞》","link":"/2021/04/09/Answers-By-Alice-Munro/"},{"title":"CI&#x2F;CD","text":"Infrastructure ProblemBackgroundA development team has created a Java web app that is ready for a limited release (with reduced availability and reliability requirements). If the limited release is successful the app will be rolled out for worldwide use. Once fully public, the application needs to be available 24/7 and must provide sub-second response times and continuity through single-server failures. Basic problemYou need to create one environment for local Dev/QA, a better solution should also consider about CI/CD, further more, we’d also like to see your thoughts about how you do the HA, monitor, log etc. after the application is published to world. Assumptions You have free rein to incorporate any software tools and hardware you need to streamline application deployment and infrastructure provisioning &amp; configuration as long as they are Free/Libre/Open Source software (FLOSS). We request that you use Linux. The development team has a continuous integration build that produces two artifacts: 12a .zip file with the image and stylesheet used for the application.a .war file with the dynamic parts of the application. You should deploy the static assets to a web server and the .war file to a separate application server. Any compatible servers are acceptable. The app (companyNews) uses Prevayler for persistence. Prevayler essentially persists data to a file. The dev team chose this to simplify the development effort, rather than having to deal with an RDBMS. Expected output for this problemSimply put, we want you to design and create the local Dev/QA environment. You should use a virtualization/Container solution such as VirtualBox or Docker for these environments. We do not want you to deliver the VMs/Images to us, a detailed step by step instruction/document is not what we expect either. Instead you should provide scripts to enable us to build the environment very easily. The principle is automation as much as possible.","link":"/2021/04/11/CI-CD/"},{"title":"Flown","text":"They Are Not Natural","link":"/2021/04/06/Fabulous/"},{"title":"Hateful April","text":"A Voyage to LilliputGulliver’s TravelsIt would not be proper, for some reasons, to trouble the reader with the particulars of our adventures in those seas; let it suffice to inform him, that in our passage from thence to the East Indies, we were driven by a violent storm to the north-west of Van Diemen’s Land.(fn) Twelve of our crew were dead by immoderate labour and ill food; the rest were in a very weak condition. On the 5th of November, which was the beginning of summer in those parts, the weather being very hazy, the seamen spied a rock within half a cable’s length of the ship; but the wind was so strong, that we were driven directly upon it, and immediately split. Six of the crew, of whom I was one, having let down the boat into the sea, made a shift to get clear of the ship and the rock. We rowed, by my computation, about three leagues, till we were able to work no longer, being already spent with labour while we were in the ship. We therefore trusted ourselves to the mercy of the waves, and in about half an hour the boat was overset by a sudden flurry from the north. What became of my companions in the boat, as well as of those who escaped on the rock, or were left in the vessel, I cannot tell; but conclude they were all lost. For my own part, I swam as fortune directed me, and was pushed forward by wind and tide. I often let my legs drop, and could feel no bottom; but when I was almost gone, and able to struggle no longer, I found myself within my depth; and by this time the storm was much abated. The declivity was so small, that I walked near a mile before I got to the shore, which I conjectured was about eight o’clock in the evening. I then advanced forward near half a mile, but could not discover any sign of houses or inhabitants; at least I was in so weak a condition, that I did not observe them. I was extremely tired, and with that, and the heat of the weather, and about half a pint of brandy that I drank as I left the ship, I found myself much inclined to sleep. I lay down on the grass, which was very short and soft, where I slept sounder than ever I remembered to have done in my life, and, as I reckoned, about nine hours; for when I awaked, it was just day-light. I attempted to rise, but was not able to stir: for, as I happened to lie on my back, I found my arms and legs were strongly fastened on each side to the ground; and my hair, which was long and thick, tied down in the same manner. I likewise felt several slender ligatures across my body, from my arm-pits to my thighs. I could only look upwards; the sun began to grow hot, and the light offended my eyes. I heard a confused noise about me; but in the posture I lay, could see nothing except the sky. In a little time I felt something alive moving on my left leg, which advancing gently forward over my breast, came almost up to my chin; when, bending my eyes downwards as much as I could, I perceived it to be a human creature not six inches high, with a bow and arrow in his hands, and a quiver at his back. In the mean time, I felt at least forty more of the same kind (as I conjectured) following the first. I was in the utmost astonishment, and roared so loud, that they all ran back in a fright; and some of them, as I was afterwards told, were hurt with the falls they got by leaping from my sides upon the ground. However, they soon returned, and one of them, who ventured so far as to get a full sight of my face, lifting up his hands and eyes by way of admiration, cried out in a shrill but distinct voice, Hekinah degul: the others repeated the same words several times, but then I knew not what they meant. I lay all this while, as the reader may believe, in great uneasiness. At length, struggling to get loose, I had the fortune to break the strings, and wrench out the pegs that fastened my left arm to the ground; for, by lifting it up to my face, I discovered the methods they had taken to bind me, and at the same time with a violent pull, which gave me excessive pain, I a little loosened the strings that tied down my hair on the left side, so that I was just able to turn my head about two inches.","link":"/2021/04/01/Hateful-April/"},{"title":"「4 3 2 1 :a novel」","text":"","link":"/2021/04/11/Paul-Austers-4-3-2-1/"},{"title":"The Evening And The Morning","text":"『暗夜与黎明』Where Follett excels is in telling a yarn…you won’t be able to put it down. A Time of Conflict It is 997 CE, the end of the Dark Ages, and England faces attacks from the Welsh in the west and the Vikings in the east. Life is hard, and those with power wield it harshly, bending justice according to their will – often in conflict with the king. With his grip on the country fragile and with no clear rule of law, chaos and bloodshed reign. Three Lives Intertwined Into this uncertain world three people come to the fore: a young boatbuilder, who dreams of a better future when a devastating Viking raid shatters the life that he and the woman he loves hoped for; a Norman noblewoman, who follows her beloved husband across the sea to a new land only to find her life there shockingly different; and a capable monk at Shiring Abbey, who dreams of transforming his humble abbey into a centre of learning admired throughout Europe. The Dawn of A New Age Now, with England at the dawn of the Middle Ages, these three people will each come into dangerous conflict with a ruthless bishop, who will do anything to increase his wealth and power, in an epic tale of ambition and rivalry, death and birth, and love and hate.","link":"/2021/04/08/The-evening-and-the-morning/"},{"title":"Write Like You Are Not Afraid","text":"","link":"/2021/04/09/Write-Like-You-Are-Not-Afraid/"},{"title":"聊聊NFT","text":"What is NFTWhere is it fromDeFi - decentralized financeJust kidding that: ‌Nowadays, technology makes money laundry easier I cannot believe you morons actually buy this shit","link":"/2021/04/12/%E8%81%8A%E8%81%8ANFT/"}],"tags":[{"name":"Alice Munro","slug":"Alice-Munro","link":"/tags/Alice-Munro/"},{"name":"solution","slug":"solution","link":"/tags/solution/"},{"name":"Paul Auster","slug":"Paul-Auster","link":"/tags/Paul-Auster/"},{"name":"novel","slug":"novel","link":"/tags/novel/"},{"name":"Ken Follett","slug":"Ken-Follett","link":"/tags/Ken-Follett/"},{"name":"psyco","slug":"psyco","link":"/tags/psyco/"}],"categories":[{"name":"happy little capsules","slug":"happy-little-capsules","link":"/categories/happy-little-capsules/"},{"name":"Techo","slug":"Techo","link":"/categories/Techo/"},{"name":"F****** Fabulous","slug":"F-Fabulous","link":"/categories/F-Fabulous/"},{"name":"Journals","slug":"Journals","link":"/categories/Journals/"}]}