{"pages":[{"title":"About ME","text":"Techo Psycho Alcohol","link":"/about/index.html"},{"title":"tags","text":"","link":"/tags/index.html"},{"title":"categories","text":"","link":"/categories/index.html"}],"posts":[{"title":"API Gateways","text":"by Priyal Walpita API网关是一种许多API开发者用来封装API端点的典型的模式。但是，更常见的是用API网关来反设计模式。本文聚焦于API网关模式的正确使用。 一个API（应用程序接口）网关是一个位于其他后端（微）服务的接口。API网关可以用来确保安全性、可扩展性和高可用性等系统架构特性。 我们是否能不使用网关来实现我们的服务（例如RESTFull或者SOAP）？当然可以。但是单独的服务需要不少非业务具体功能，例如路由、认证、授权、TLS、日志、追踪等等。更重要的是，如果不使用网关来暴露API端点，客户端将获取后端服务的分布和部署细节。当你使用API端点集成内部前端应用时，这没什么大问题了。对于企业级API网关，它们可能被暴露给未知的需求客户端，这就不是一个好的实践。 反向代理或者负载均衡能被用作网关吗？如果你使用网关只为了抽象一个单点后端或者结束TLS通信，反向代理或者负载均衡就足够了。但是固然，一个合适的API网关能够满足以下的功能： 多类型后端（微服务） 服务发现 断路限制 认证授权 限速 记录追踪 路由 重试逻辑 等等.. 单一网关是好是坏?如果你部署单一网关，即使很容易管理它，你也会发现以下麻烦： 单点故障: 如果API网关不在合理地提供功能，你的整个后端通信就会失效。一个解决方案是，你可以拥有一个可扩展的API网关集群基于一个硬件负载均衡，在这负载均衡会注意到反压。 多样的通信需求会逆转一个单点API网关栈: 依赖于多样的业务功能，API需求在性能、安全和合规等方面上都是不同的。如果你有API网关集群，所有的交通会从中穿过，你不能够负载这些不同的需求。尤其是在你建设一个企业级的API网关的时候这不是一个好主意。 使DevOps功能变得困难: 如果你在后端服务执行路由改变或者协议变化，这也会影响API网关。所以，一旦你部署了一个变化，API网关需要更新来使用单一的API网关集群。 因此，最好的选择是拥有多样的API网关，具体来说，是对实际需求设计载体。 API 网关能增强两个方面 企业API网关 微服务API网关 企业级API网关主要用于应用市场，在市场你期望任何第三方付费后来使用你的API。大部分API集成载体都是这样，以下情形是开发企业级API网关需要注意的地方： 一个分离的企业集成团队可能会实现部署.QA →Staging → UAT → Production 手工过程会被使用. DevOps管道很难在这种场景里被利用 客户端的错误封装（定制错误） 需要监控调用率和HTTP状态。你的账单可能依赖于此 我们需要更关注安全性，数据合规和标准等等 在微服务方面, 对网关的关注点如下： 在生态系统内部使用，API网关只对内部客户端可见 CI/CD管道的高使用率以及部署类型例如Canary, Shadow, Blue-Green等等 API 可能暴露错误和追踪栈的所有细节 非功能性的需求例如延迟和性能将会被考虑在企业水平的限制（标准、合规和安全等等）之上 API网关反模式以下情况被视为API网关反模式： 通过单一服务来路由最多的通信会烧毁网关 没有考虑到API网关依赖的服务可扩展性和韧性因素( 例如：认证，服务发现，路由等等 )，这些服务的失效会直接影响API网关的可用性 避免使用API网关作为ESB来重设路由内部通讯，API网关应该只对服务层在外部来的通信时路由 确保单点故障被减轻和管理 使API网关孤立以及不被监控 以下是我们可以采用的商业版或者开源产品： Kong Gateway Apache APISIX Tyk Goku WSO2 KrakenD Zuul","link":"/2021/06/02/API-Gateways/"},{"title":"About NFTs","text":"What is NFTNFT stands for non-fungible token.(即非同质化代币，一种架构在区块链上的加密货币) In economics, a fungible assert is something with units that can be readily interchanged, like money. NFTs are ‘one-of-a-kind’ asserts in the digital world that can be bought and sold like any other piece of property, but they have to tangible form of their own. The digital tokens can be thought of as certificates of ownership for virtual or physical asserts. With NFTs, Artwork can be ‘tokenized’ to create a digital certificate of ownership that can be bought and sold. PlatformsThe Platforms of NFT transactions are like SuperRare, Nifty Gateway, Foundation, MakersPlace, OpenSea, Rarible etc. As with crypto-currency, a record of who owns what is stored on a shared ledger known as the blockchain. NFTs can also contain smart contrasts that may give the artist, for example, a cut of any future sale of the token. Trending - DeFi (decentralized finance)Just kidding that: ‌Nowadays, technology makes money-laundrying much easier. I cannot believe you morons actually buy this shit. Luxury brands poised to join the NFT party Artworks are like: The Weeknd ‘s new NFT song - The Source Flowers with Smiley Faces by Takashi Murakami McDo NFT Gucci NFT shoes","link":"/2021/04/12/AboutNFTs/"},{"title":"After the storm comes a calm","text":"","link":"/2021/06/14/After-a-storm-comes-a-calm/"},{"title":"Answers By Alice Munro","text":"你认为最完美的快乐是怎样的？ 星期天下午，我们喜欢长途散步，从我家后面开始，沿着铁路线走。我们会走到瓦瓦那什河湾栈桥，然后返回。我们谈论安乐死、遗传控制群体、是否有灵魂、宇宙是否最终是可知的。我们没有达成任何一致的看法。开始我们在秋天散步，接着是冬天。在暴风雪中，低着头争辩，手插在口袋里，细腻刺骨的雪打在我们脸上。争辩累了，我们会把手拿出来，伸开双臂保持平衡，试图在铁轨上走。 《女孩和女人们的生活》 你最希望拥有哪种才华？ 即便困难重重，生病、穷困、丑陋，你依然能珍惜你的灵魂，就像用盘子端着一枚珍宝走过人生。 《爱的进程》 你最恐惧的是什么？ 恨始终是一种罪过。你灵魂里的一滴仇恨，会扩散开来毁掉所有的色彩，就像白牛奶里的一滴黑墨水。 你最喜欢的消遣是什么？ 我的生活早已发生了疯狂的转变，我每天为之悔恨的事情同时也是我的骄傲。我感觉自己已经以全新的面貌重生于世。坐在桌边，双手捧着一杯咖啡或者红汤，直到它几乎没有一丝热气，就这么待上一小时。我漫无目的地读书，读那些早就想读的书里的散句。这些句子总是令我满足，它们是如此优美独特，总是让我陷入一种特别的状态，全然忘却了其他的词句。我恍惚而又警觉，与所有人隔绝却随时觉察着这城市本身——它似乎是个奇怪的地方。 《公开的秘密》 你认为程度最浅的痛苦是什么？ 嗯，这真是奇怪。想象之中，每当你支持什么的时候，总是会声音洪亮，而周围的人被你惊醒，感到羞愧不安。但，在真实生活里，他们却都笑得别有意味。你立刻就会明白，你所做的一切，不过是让自己变成大家下次一起喝咖啡时的笑料。 《快乐影子之舞》 你认为哪种美德是被过高地评估的？ 你真可怕，你知道。你像天使们一样可怕。你以为所有人都朝前走，像你一样勇敢阳光——哦，请别看我，亲爱的。不要看我——或许我不是你希望的样子，可你能感觉到我就在这里呀，对吗？ 《好女人的爱情》 你最喜欢男性身上的什么特质？ 生活的要义，哈里告诉劳莲，就是满怀兴趣地活在这个世界上。睁大你的眼睛，要从你所遇到的每一个人的身上看到各种可能性——看到他的人性。要时刻注意。 《逃离》 你最喜欢女性身上的什么品质？ 她知道在酒吧里苦苦等待一个再也不会出现的男人的那种滋味。等待来信，当众痛哭，也曾被不再爱的人纠缠。不过，她仍然觉得情事萌发的第一个信号如此美妙，仿佛是阳光照在皮肤上的温暖，是门廊里轻轻传来的音乐，或者像她经常说的那样，像是黑白电视广告忽然变成了彩色的。她不觉得这是在浪费时间，也不觉得曾经浪费过时间。 《公开的秘密》 你最厌恶什么？ 当人们告诉你有时候你要去面对，当他们催促你面对摆在你面前的痛苦、猥亵、讨厌的事实时，在这接近背叛的边缘，他们的声音里总是掩饰不住那种冷酷的庆幸意味，以及对伤害你的贪婪渴望。 《女孩和女人们的生活》 你自己的哪个特点让你最觉得痛恨？ 认识我自己，我认识的是我的邪恶。这是我隐秘的慰藉。我了解我最坏的地方。它也许比别人最坏的地方更坏。但我不在乎。用不着什么借口。我获得了平静。我是个恶魔吗？世界是这么说的，它既然这么说了，那么我就同意好了。不过，这世界对我没有任何意义。我就是我自己，也不会有机会成为别人。我说，我疯了，但疯了又是什么意思？精神不正常，精神正常，我只是我而已。那时候我改变不了自己，现在我也改变不了自己。 《幸福过了头》 你的座右铭是什么？ 改变法律。改变人。可我们又不想所有事情——不要从头到尾都是——都听凭外界指使。我们不想我们的本质，我们的一切，都被那样调制出来。 《好女人的爱情》 你最伤痛的事是什么？ 她像是肺里什么地方扎进去了一根致命的针，浅一些呼吸时可以不感到疼。可是每当她需要深深吸进一口气时，她便能觉出那根针依然存在。她用什么来取代他的位置？那个逐渐逼近的未来世界的奇特之处与可怕之处，就在于她不能融入其间。 你最看重朋友的什么特点？ 吸引她的——实际上是迷惑住她的——是在前寒武纪岩石层峦叠嶂的遮蔽后所能寻见的那种极端冷漠、重复、漫不经心以及对和谐的轻蔑。 《逃离》 什么让你感觉到最快乐？ 很少人，非常非常少的人，才拥有宝藏，如果你真的拥有，那你就千万不要松手。你必须别让自己路遇拦劫，从自己身边把它丢失了。 你希望以什么样的方式死去？ 我就是这样心怀秘密，感觉茫然，内心却又充满了力量。 《快乐影子之舞》","link":"/2021/04/09/Answers-By-Alice-Munro/"},{"title":"Apache KAFKA","text":"Basics「Apache Kafka」 is an open-source distributed event streaming platform used by thousands of companies for high-performance data pipelines, streaming analytics, data integration, and mission-critical applications. Producers and ConsumersProducers and consumers are services that listen to or send messages in Kafka. These services are your backend services. TopicsTopics are addresses that producers can send messages to. Other services can listen to these topics. PartitionsA Kafka topic is not really a single queue, but actually composed of many queues called partitions! They help a topic scale. InfrastructureZookeeper manages all of your topics and partitions. It basically maintains a set of Kafka cluster nodes where topics and partitions are stored. These nodes are individual machines (for example, EC2 instances) which make up your Kafka cluster. ConclusionsIn short, Apache Kafka and its APIs make building data-driven apps and managing complex back-end systems simple. Kafka gives you peace of mind knowing your data is always fault-tolerant, replayable, and real-time. Helping you quickly build by providing a single event streaming platform to process, store, and connect your apps and systems with real-time data.","link":"/2021/05/30/Apache-KAFKA/"},{"title":"Business Ladder","text":"Technical Writer IWorks closely with the Product Engineering team to incorporate new releases into our existing documentation.Has an ability to achieve clarity with conciseness and accessibility. Checks for cohesion in tone and style with existing documentation. Acts as a critical advisor for UI copy and names for things, referencing where we might have collisions in existing terms, and attempting to find the best explanation for users. Reads through our existing documentation and updates/corrects for legibility.Understands our writing style guide and adheres to it. Performs PR reviews for their peers with a focus on writing, style, and grammar.Communicates internally and externally in a respectful manner. Technical Writer IIStrong understanding of the product space and capabilities to inform high levels of accuracy in documentation. Helps our Product team establish harmony between written and visual communication in UI Copy. Accurately captures all relevant content and resources, establishing visibility for users. Understands our writing style guide and adds to/refines it. Performs PR reviews for their peers that considers flow and the audience, as well as the goals of the product. Listens to the priorities and concerns of others, and acknowledges differing perspectives. Anticipates others’ reactions. Thinks through and files issues for how to refine the docs site and UI. Reflects on user feedback and either categorizes it as won’t fix, or turns it into something actionable. Actively participates in meetings, and creates cross-team collaboration where necessary to address business goals. Senior Technical WriterAt this point, a person is mastering how effective they can be as an individual contributor. Acutely aware of our audience and defers voice and tone to meet the needs of the user. Considers overall information architecture both in writing and while reviewing. Thinks through what the user needs exactly at the point of learning to reduce cognitive overhead. Understands with depth what our organization and company OKRs are, and performs audits on their content to make sure we are achieving our goals. Has an understanding of the wider ecosystem of tools so that they know what context users may or may not be coming from. Ensures that there’s a clear path for a first-time user and understands how and when to weave in advanced material such as caveats and warnings. Understands with depth when and how users will perceive naming conventions, UI copy, and thinks through potential tradeoffs and benefits for different directions. Helps support the work of their peers both on the team and in the community at large, by engaging pairing sessions, reviewing, and providing mentoring. Gathers customer impressions of products and services and integrates this feedback into decision making. Adjusts well to shifting priorities when necessary. Demonstrates openness to others’ ideas. Adapts their communication style to most effectively communicate with the target audience. Effectively and accurately shares credit for ideas and collaborative efforts. Staff Technical WriterAt this point, the majority of one’s time is spent scaling their own skills to help others. Conducts competitive tear downs and illuminates new patterns and industry standards for information architecture, educating their peers and coworkers.Gives review feedback on PRs with a mind towards the growth of the individual they are reviewing, thinking through not just the content of the review, but how they can explain something to help guide the person in the future. Develops new plans and projects for our documentation, creating one-page proposals on how we might level up to better serve our users and/or business needs. Works on integrations or materials that aid in partnerships within the ecosystem. Attends support pairing prepared with ideas for improving the docs based on the customer feedback that’s been surfaced that week or well-formed questions to drive towards developing such ideas collaboratively. Helps shape support pairing to make it more efficient and effective. Notices recurring friction/confusion that impedes team success/efficiency and creates resources that clarify or solve these issues. Ensures the resources are easy to locate. Principal Technical WriterAt this point, one is helping others be the best that they can be, removing themselves and meeting others where they are. Develops proven systems and approaches to technical writing. Replicates those systems and approaches across the team so that others may learn from and improve on them. Mentors and actively drives the technical skills of the immediate or extended team. Anticipates issues or implications that their ideas would have on others, and pursues mutually beneficial strategies. Anticipates the needs of those around them. Is respectful in terms of async hygiene, exhibiting care that their teammates can get in touch with them or knows their status during working hours. Fills out process docs without having to be asked. Works to refine team processes to ensure everyone can be as productive as possible and build cohesion within the team. Considers team morale one of their initiatives- actively strives to support others, make sure their voices are heard, and illuminate others’ work.","link":"/2021/04/30/Business-Ladder/"},{"title":"CI&#x2F;CD","text":"Infrastructure ProblemBackgroundA development team has created a Java web app that is ready for a limited release (with reduced availability and reliability requirements). If the limited release is successful the app will be rolled out for worldwide use. Once fully public, the application needs to be available 24/7 and must provide sub-second response times and continuity through single-server failures. Basic problemYou need to create one environment for local Dev/QA, a better solution should also consider about CI/CD, further more, we’d also like to see your thoughts about how you do the HA, monitor, log etc. after the application is published to world. Assumptions You have free rein to incorporate any software tools and hardware you need to streamline application deployment and infrastructure provisioning &amp; configuration as long as they are Free/Libre/Open Source software (FLOSS). We request that you use Linux. The development team has a continuous integration build that produces two artifacts: 12a .zip file with the image and stylesheet used for the application.a .war file with the dynamic parts of the application. You should deploy the static assets to a web server and the .war file to a separate application server. Any compatible servers are acceptable. The app (companyNews) uses Prevayler for persistence. Prevayler essentially persists data to a file. The dev team chose this to simplify the development effort, rather than having to deal with an RDBMS. Expected output for this problemSimply put, we want you to design and create the local Dev/QA environment. You should use a virtualization/Container solution such as VirtualBox or Docker for these environments. We do not want you to deliver the VMs/Images to us, a detailed step by step instruction/document is not what we expect either. Instead you should provide scripts to enable us to build the environment very easily. The principle is automation as much as possible.","link":"/2021/04/11/CI-CD/"},{"title":"Can TikTok’s brand flagships lure luxury?","text":"The app is known as TikTok in the West. In China, its name is Douyin — which means, literally, ‘shaking sound’ in Chinese. Owned by China’s Bytedance, they both serve as a platform for young people to play with short-form videos. TikTok在中国被叫做抖音，事实上，抖音的中文意思是抖动的声音。抖音属于字节跳动公司，它和TikTok均作为一个面向年轻人的短视频平台。 Now Douyin wants to muscle in on China’s huge e-commerce sector. And the app could benefit from the support of Chinese regulators, who are keen to encourage more competition in a sector dominated by giants Alibaba and JD.com. 如今，抖音想要在中国电商市场份额中大展拳脚。这个应用也得益于中国监管的支持，监管机构致力于在被阿里巴巴和京东等巨头公司占据主导的部分中鼓励更多的竞争。 This is the article reference link. 「中国的短视频应用对电商有着巨大的野心，奢侈品什么时候会下场收割？」 3月下旬，抖音开设了 “品牌官方旗舰店” 的功能，为大众消费品到高端奢侈品等商家提供更有吸引力的销售机会。抖音让品牌能够通过官方主页为6亿日活用户提供一种无缝衔接和充满信赖感的购物体验。 当抖音这样做的时候，TikTok很有可能照做。在超动态的中国电商市场的创新被慢动作的西方密切关注着，所以抖音先于它的姐妹软件TikTok行动是意料之中的事。 在开设品牌旗舰店之前，抖音用户如果想要在平台即看即买，需要通过链接跳转到例如京东、天猫、淘宝、抖音小程序等第三方平台，或生态系统之外的其他轻量级应用来买卖商品。 无论对于商家还是买方而言，品牌旗舰店的推出都代表着一种升级。Insider Commerce分析师Man-Chung Cheung解释说，品牌必须提交商标才能正式在抖音上开官方店，这可以确保所售产品的真实性和合法性。旗舰店为品牌提供了一个可以直接将产品置于用户体验中心的平台，这代表着一个意义重大的升级。他补充道，抖音希望品牌旗舰店模式可以让自己更有力地与天猫、京东、微信等其他平台竞争，因为所有这些平台都已经从销售奢侈品中取得了不小的势头。 抖音上娱乐性内容的流量销售转化率是非常高的，这也带火了不少奢侈品的营销。现在，抖音希望保留这些流量在内部来帮助品牌实现流量变现。 Digital Luxury Group中国董事兼合伙人Pablo Mauron说，「旗舰店」能够把抖音的流量以一种无缝衔接的方式变现，这也是为什么奢侈品行业十分重视这个机会。抖音是除了天猫生态系统外唯一一个能将流量变现的直播平台，品牌对此十分感兴趣。” 自2016年推出以来，抖音取得了惊人的增长，目前日活用户数量已经超过了6亿，并增加了包括直播在内的许多功能。在去年，这些功能让平台上的商品交易总值达到了1700亿元人民币（264亿美元）。 抖音的成功并不代表其母公司字节跳动能够免受中国政府对大型科技公司的监管。创始人张一鸣本月宣布将在公司公开募股前辞去首席执行官一职，这一举动震惊了不少投资者。分析师推测，采取这个先发制人的举措是为了使政府安心。 奢侈品的机遇Dior早在2018年04月就开设了抖音官方账号。但一位品牌发言人说，由于抖音还在进行一系列优化，开设旗舰店的可行性和有效性不是Dior马上会考虑的问题。他还补充道，在所有东西满足要求，并同时达到消费者的预期之前，我们不会走出这一步。 奢侈品牌踌躇不决的态度是意料之中的，他们此前就已经花费了多年时间来观察和测试抖音的发展情况。 过去三年中，包括Burberry、G和Prada在内许多头部品牌也是在去年疫情后，才创建品牌账号来营销和宣传产品。咨询公司Gartner的专业顾问Asa Mazor-Freedman指出，包括 Tiffany＆Co.、Celine、Gucci和Chloé在内的一些奢侈品品牌目前还是习惯于将产品链接到他们自己的.cn中国官方网站或是天猫旗舰店，而并没有最大化利用抖音自身的电商机会。 相比于奢侈品，时尚和美妆品牌的态度显得更加积极。在推出品牌旗舰店功能的几周之内，至少220家本土和国际品牌就已经在抖音上开设了旗舰店。据Digital Luxury Group统计，Make Up Forever、Maybelline、Sephora、Elizabeth Arden和Avène都在早期便采用了这一模式。香港珠宝品牌周大福则是奢侈品牌中为数不多的参与者。 Mauron指出，这个形势很熟悉，总是本土品牌、大众化品牌以及美妆品牌开先例，而奢侈品牌则谨慎地跟随其后。现在，抖音已经明确其在奢侈品牌沟通战略中的作用，未来几个月有望看到快速发展。他说：“我知道时尚和珠宝品牌事实上正在研究这个渠道，这项工作还在进行中。” 奢侈品的优缺点在抖音开设旗舰店的最大益处是有机会与中国00后的网民们拉近关系。据Insider Intelligence统计，00后人群占据抖音所有用户的一半之多。这一代年轻人已然是中国奢侈品消费增长的重要贡献者–00后是天猫奢侈品时尚和生活方式市场中增长最快的人群。 中国品牌对此再清楚不过了。本土最大的服装公司之一，太平鸟的电商战略业务部总监李伟说：“我们生活在一个数字化时代，时尚品牌未来的成功很大程度上取决于他们怎样与90后和00后这些数码’原住民‘沟通。抖音作为一个吸引着中国年轻网民的平台是难以被忽略的。” 太平鸟称销售业绩 “非常成功”。 通过抖音品牌旗舰店直接处理交易，品牌可以保留在之前的商业模式中流失给第三方平台的消费者数据。中国电商咨询公司Azoya的欧洲董事总经理Elena Gatti说：”（以前）品牌在内容上投资了很多钱，却把消费者流失给了其他平台。最终，他们其实不知道投资和广告将用户转化为消费者的转换率是多少。在抖音上进行这一转化会促成一个封闭的电商内循环，从品牌的角度来看这是非常有意义的。” 但是，Mazor-Freeman也警告说，在竞争异常激烈的奢侈品市场上，没有品牌会轻易取得成功。Gatti指出，投资回报必然需要一段时间，因此品牌应该将其视为一种中长期的投资，并且专注在一些容易引起年轻消费者共鸣的入门级产品。他说：“正因如此，抖音是绝佳选择。” 竞争激烈的角斗场抖音其实在很早的时候已经展露出了在电商领域的野心。2019年，抖音母公司字节跳动便成立了电商部门，将电商业务与其内容平台进行整合。当年08月，抖音还限制了从其直播渠道跳转到第三方平台的链接，并于2021年01月推出了用以与蚂蚁金服的支付宝和腾讯的微信支付竞争的抖音支付。 报道称，抖音即将升级与京东的合作关系，并使用京东的物流和客户服务，这也是抖音为提升平台在品牌和消费者心目中电商信誉所迈出的一步。Gatti认为，这样的合作是’自然而然的‘。他说：“抖音是一家纯互联网内容公司，它不具备任何电商的硬性条件。” 作为回报，京东被授权获得抖音不断扩大的用户群，并挖掘一种与自身模式截然不同的购物方式。他说：“现在上抖音，你想买东西是因为你被内容煽动了。京东可以触及到这群主要由兴趣和灵感驱动而购物的消费者群体。” 中国电商平台早就向奢侈品牌抛出了橄榄枝，但是天猫和京东直到最近几年才被品牌广泛采用（新冠疫情隔离起到了决定性的推动作用）。随着欧美奢侈品牌对中国电商生态系统越来越熟悉，他们可能会以较快的速度采用抖音这一新的渠道。 政府对阿里巴巴和其他科技巨头的反竞争压制也可能会成为字节跳动的优势。Mazor-Freedman说：“监管部门助力抖音进入电商领域，是希望在这个领域存在更多竞争，而不是让阿里巴巴始终处于垄断地位，抖音具备与其竞争的流量和规模。”","link":"/2021/05/31/Can-Douyin%E2%80%99s-brand-flagships-lure-luxury/"},{"title":"Can fashion be climate positive?","text":"Burberry commits to finding out. The brand is committing to climate positivity — a more ambitious goal than carbon neutrality — by 2040. Experts say that will be difficult to achieve.","link":"/2021/06/12/Can-fashion-be-climate-positive/"},{"title":"Carbon Footprint","text":"你会为了保护环境而特意购买衣服上标有 “碳排放分数” 标签的衣服吗？ 我们总以为保护环境是为了拯救地球，然而，事实并非如此。正如地质学家丁仲礼在 2009 年和柴静访谈的视频中所说的那样，“地球用不着人类拯救，真正需要拯救的是人类自己。” 因为迄今地球上有人类存在的历史大约只占 “地球年龄” 的万分之一，将来即便人类消失了，地球也依然存在。 因此，时尚领域所有跟可持续相关的事物，本质上都是在拯救我们人类自己。自 2020 年新冠疫情在全球爆发后，有关碳标签的话题，也屡屡被拎上台面。碳标签是把产品生命周期（包括生产、制作、储存等）所产生的温室气体排放量，用量化的指数体现在产品上的标签。它的主要作用是信息告知，标有不同分数的碳标签代表着每件衣服在生产制造过程中对环境所造成的影响。然而，这个标签到底能给时尚界带来什么呢？ 碳标签是行业发展的必然趋势2019年，环保咨询机构Quantis的报告显示，时尚行业的碳排放量巨大，其中，服饰和鞋履行业的排放在 2016年占全球排放的8％以上，相当于39.9亿公吨二氧化碳。另据Ellen MacArthur基金会称，时尚行业产生的碳排放量超过所有国际航班和海上航运航班的总和，每年温室气体的排放总量高达12亿吨。 而有关碳排放标签的设定，早在2007年就在不少国家间被提及。其中，英国是全球最早对产品推出碳标签制度的国家；日本紧随英国，鼓励各公司自愿推出产品碳标签，在商品包装上详细标注产品生命周期每个阶段的碳足迹（指企业机构、活动、产品或个人通过交通运输、食品生产和消费以及各类生产过程等引起的温室气体排放的集合）。 截止目前，英国、日本、美国、法国、瑞典、韩国、泰国等多个国家都已经推出了各自相应的碳标签制度。在不久的将来，碳标签必将成为国际商品流通的通行证，而在时尚界更是如此。 今年4月，法国国民议会在修改《气候法案》时，也专门通过了在产品上添加碳标签的法案，且首先在服装和纺织品行业试行。法国作为奢侈品大国，拥有着 LVMH、开云两大奢侈品集团，其在服装和纺织品行业添加碳标签的规定，无疑是时尚产业今后走向 “碳标签时代” 的重要标志。 这就如同前几年品牌都不约而同开始关注碳排放数额一样，2019年，Gucci 的母公司开云集团计划在 2025 年将温室气体排放量减少 50%。拥有 Michael Kors、Versace和Jimmy Choo的Capri集团也称将在2025年前实现净零碳排放。从品牌多年前对碳排放的态度来看，碳标签制度在时尚界的盛行，也将不再遥远。 太博咨询科技创始人、东西全球文创集团策略长赖俊竹在接受采访时表示，碳标签制度将成为时尚产业今后的趋势，“不久的将来，可能不同国家都有自己碳标签的标准，就像食品安全里也有很多标准一样，时尚领域也会如此。” 碳标签虽然对于时尚单品主要起到信息告知的作用，但依旧是品牌树立自我形象的加分项。“很多人觉得品牌制定碳标签主要是为了营销，其实这是无法避免的，因为品牌的初衷还是要赚取利益，如果没有利润，何谈可持续呢？所以对于品牌来说，环保和营利是齐头并进的。” 赖俊竹称。 然而，尽管碳标签可以让客户更加信任产品，但不管所购买的产品碳排放分数再小，购买行为仍旧会对环境产生破坏和影响。有些消费者也可能在今年购买完这款单品后，明年就随之遗弃。 根据Allbirds天猫旗舰店官网的网友评论可以看出，虽然整个店铺都在宣传品牌对于可持续做出的贡献，比如称鞋面的取材来自南非农场的桉树纤维，比棉花等材质减少了95%的用水和50%的碳排放；一副鞋带等于一个可回收的塑料瓶；鞋子的包装90%是可回收纸板以及单品碳标签的设置等，但中国网友在购买产品后的留言，90%仍主要关注于品牌本身的质量好坏。其中称赞鞋底轻便有弹性，鞋面透气者居多。因此，即使碳标签可以成为品牌的卖点，但最终谁能创造出经久不衰、让消费者长时间持有且认可的单品，谁的碳标签制度才是真的锦上添花。 谁会为碳标签买单？目前，对时尚奢侈品牌碳标签问题认知较深的主要是具有高度责任感、高购买意愿的高端消费人群。根据奢侈品市场调研公司Altiant的GLAM 数据库显示，在 2021 年，全球49%的富人（Altiant 将其界定为年收入 165 万人民币以上的人群）将可持续的重要性评为四到五分（五分为满分）。这充分表明许多高端消费者对可持续性的关注和拥趸。 其实早在2018年，Altiant便发现英国、美国和中国 70-90% 的高净值人群倾向于关注并信任奢侈品牌所发布的关于可持续性的宣传声明。Altiant营销与合作关系副总裁Meryam Schneider 说：“虽然我们早已发现高端消费者十分重视他们钟爱的奢侈品牌在环保方面的行动，但是这一趋势无疑在新冠疫情期间加速了。” 除了高端消费者会对此喜爱外，赖俊竹认为碳标签也将是中产阶级支持和喜欢的对象。对于中上层的人士来讲，碳标签的概念是和高端人群开启一个对话或是启动一个项目非常重要的敲门砖。“这就如同买奢侈品一样，中产很多时候就是为了打进圈子才去买奢侈品。” 而对于普通消费者而言，虽然他们对于服装行业造成的环境污染问题有所耳闻，却并不会特意甄别并购买带有碳标签的服装，对碳标签的理解和其背后意义的认知尚浅。毕竟在拼多多大行其道的中国，商品价格的变动，性价比才是普通消费者在购买时最关注的问题。 如何吸引消费者关注碳标签？面对中国本土市场对可持续理念认知尚浅的大众，以及不愿被品牌说教的年轻消费者，时尚奢侈品牌该如何让消费者主动愿意为碳标签买单，显得尤为重要。 首先，碳标签标识的位置决定了消费者能否关注到碳标签的存在。 联合利华全球供应链主管Marc Engel在接受《金融时报》采访时表示：“在计算方法和设计外观上，（公司）必须让他们所用的碳标签标准化、清晰化，否则它（碳标签）将因为无法被区分于产品上各类其他标签而失去它的意义。” 专注于环境科学领域的心理学家Geoffrey Beattie在其去年发布的研究报告中指出：“消费者识别不同产品上的碳标签所需时间不同，对于节能灯泡而言，消费者可于５秒内识别到碳标签信息，而牛奶等商品上的碳标签，则很难引起消费者注意。” 因此，Beattie 认为碳标签应该被印于一个醒目的位置，以方便消费者快速识别，来有效引导其消费决策。同时，碳标签在设计时也必须注重可理解性，做到信息简练、外观标准化，以真正做到如同食物营养标签一般的信息告知作用。 另外，碳标签的颜色设计也应是品牌考虑的重点。可持续专家Jerome K. Vanclay 教授早在其2011年的调研中发现，有低碳感受的颜色会在一定程度上影响消费者决策。调研分别用绿色、黄色和黑色碳标签代表低、中、高二氧化碳排放量，贴于37种商品之上。经过观察3个月内碳标签商品的销售量发现，黑色碳标签商品销售量下降了6％，而绿色碳标签商品的销量上升了4％。除此之外，类似Vanclay的调研所采用的碳标签评级系统，同时也能够更有效地帮助消费者对比并筛选低碳和高碳产品。 碳标签作为体现全球变暖信息的媒介，最本质的作用便是将信息告知消费者，作为选择产品的参考依据。消费者的认知并不是一成不变的，随着所接触信息的不断更新，消费者会产生新的心理活动，从而形成新的认知。所以，消费者认知过程是可流动、可塑造的，也正因如此，品牌可以通过碳标签的设计影响并改变消费行为和认知。 除了外观设计上，如何撬动消费者的内心，让他们认为碳标签和自己的生活相关，才是重中之重。就如同大家在买食物时都会关注卡路里，用卡路里的数字来分析自己是否会变胖，再决定是否购买的逻辑相同。在这一点上，蚂蚁森林可谓是一个成功的典范。 2016年8月27日，蚂蚁金服对旗下支付宝平台的4.5亿用户全面上线个人碳账户。只要用户通过步行、地铁出行、在线缴纳水电煤气费、网上缴交通罚单、网络挂号、网络购票等行为，就会减少相应的碳排放量，而这些减少的碳排放量都会变成蚂蚁森林获取的能量，等能量积攒到一定数额后，用户就可以选择在西北地区种树，蚂蚁森林还会提供这棵树的编号，并采用实名制。所以不少用户为了种更多的树，还会饶有趣味的去 “偷” 朋友的能量。 2019年4月，支付宝蚂蚁森林用户数已达5亿，他们共同在荒漠化地区种下1亿棵真树，总面积近140万亩。截至2020年9月26日，蚂蚁森林造林超过2.23亿棵，造林面积超过306万亩，相当于两个新加坡的面积，贡献巨大。这种动动手指就能种树，还可以改善环境的做法，无疑让用户看到自己为环境保护所做出的切实贡献。 在消费者对品牌要求越发挑剔的当下，要想让人们像参与蚂蚁森林一样关注碳标签的存在，除了日常普及环保意识外，开发出让大众参与互动的碳标签机制，才会事半功倍。","link":"/2021/06/19/Carbon/"},{"title":"City Symphonies","text":"Definition City symphonies (城市交响曲) are montage-based films without human leads where the city is a subject. They were aimed to construct cinematic poems that encapsulated the dynamics of the city. 它们以城市为刻画的对象，依照从清晨到黄昏的时间结构，其最重要的特点是蒙太奇——这种剪接的手法与好莱坞或是虚构电影中连续的电影语言完全相反。大部分的城市交响曲都诞生于二十世纪二十年代，《曼哈顿》（Manhatta）是其中的第一部，之后有一部在法国。《柏林城市交响曲》（Berlin: Symphony of a Great City in Germany, 1927）和《持摄影机的人》（Men with a Movie Camera, 1929）或许是其中最著名的两部。 就我所知道的来说，中国当时似乎没有城市交响曲——巴西有一些，墨西哥有一些，还有一些在美国。但是之后我们会看到一部诞生于很多年后的中国城市交响曲。“拍摄城市”是一个很具现代性的象征，这体现了当时人们对于城市的兴趣。当时也出现了各种画作，小说——比如说James Joyce的作品。仅在1920年代的巴黎，就诞生了73部电影。这些作品诞生于都市的便利性和城市发展所带来的巨大兴奋中。它们都拍摄于巴黎的街道，在数年中记录着这座城市。从某种角度来说，在当时，城市是整个现代世界的象征。","link":"/2021/06/09/City-symphonies/"},{"title":"Elastic Search","text":"ELK “ELK”是三个开源项目的首字母缩写，分别是：Elasticsearch、Logstash 和 Kibana。 Elasticsearch 是一个分布式搜索和分析引擎,基于JSON开发而来，具有RESTful风格。 Logstash 是服务器端数据处理管道，能够同时从多个来源采集数据，转换数据，然后将数据发送到“存储库”中。 Kibana 是指可视化工具，可以让用户在 Elasticsearch 中使用图形和图表对数据进行可视化。 ELK Service","link":"/2021/04/14/Elastic-Search/"},{"title":"Flown","text":"They Are Not Natural","link":"/2021/04/06/Fabulous/"},{"title":"Gangster and Prisoner&#39;s Dilemma","text":"","link":"/2021/04/21/Gangster-and-Prisoners-Dilemma/"},{"title":"Georges Bataille","text":"诗是一种简单的迂回：我通过诗逃离话语的世界，这世界对我来说已经成为一个自然的世界。我与诗一起进入某种坟墓，其中可能性的无限性诞生自逻辑世界的死亡 三种奢华的自然「吃、死和性生殖」一个物种被另一个物种所吃掉，这是最简单的奢华形式。被德军所围困的人们，由于实物短缺，要求对生物间接发展的令人烦扰的特性有一种大致的了解。如果人们种植土豆或小麦，那么，土地的可比卡路里产量比同等面积牧场的家畜的产量——牛奶和肉——大得多。最为轻松的生命形式是绿色的微生物（它通过叶绿素来吸收太阳能），但是一般说来，植物生命比动物生命少一些负担。植物很快地占据了可得到的空间。动物则使它成为一个屠杀场地，并以这种方式来扩充其可能性，它们自身进化得更为缓慢。在这方面，凶残野兽最为突出：它对劫掠者的持续劫掠表现了巨大的能量挥霍。威廉·布莱克这样问老虎：“你的眼光之火在何等遥远的海底或天空燃烧？”以这种方式给他留下强烈印象的是残酷压力，是在可能性的极限之处老虎消费生命的巨大力量。在普遍性的欢腾洋溢的生命中，老虎处在炽热化的极点。实际上，这种炽热首先是在遥远的天空深处，在太阳的消费中燃烧。 吃导致了死亡，但是是以一种偶然的形式。在所有可以想象的奢华中，死亡——其形式是注定的和无可阻挡的——无疑是最为昂贵的。动物身体的脆弱性、复杂性展示了它的奢华品质，但是这种脆弱性和奢华在死亡中达到了高峰。如同在空间中树枝和树干将叠层的树叶举起来迎着光线一样，死亡将生殖过程散布在时间之中，它始终将必要的空间腾出来以备新生儿的降临，而我们却错误地咒骂死亡——没有它，我们就无法存活。 实际上，当我们咒骂死亡的时候，我们只是在恐惧我们自己：我们的意志的严酷性使我们颤抖。当我们梦想逃脱奢华的生机勃勃的活动——我们只是其中最强烈的形式——时，我们是在向自己撒谎。或许我们开始只是在向自己撒谎，后来则更多地体验了这种意志的严肃性，并将它推到意识的严酷极端。 在这方面，我们以同样的方式来看待死亡的奢华和性的奢华。首先，它们都是对我们自身的否定，随后，出现了一种突然的逆转，它们被看做为这种活动——即生命是一种显示证明——的深刻真理。 在目前的情况下——不用考虑我们的意识——性生殖，连同吃和死亡，是重要的奢华的迂回之路，它确保了能量的剧烈消费。开始，它着重强调了分割所宣告的这一区分：个体存在者不再生长；同时，经由个体的繁殖，个体将生长转变为非人格性的生命。这是因为，从一开始，性就有别于吝啬的增长：如果——考虑到物种的话——性表现为生长，那么，它主要的不过是个体的奢华。这个特性在性生殖中被进一步地强调了，在此，被生育出来的这些个体很清楚地和生育他们的人、赋予他们生命的人——犹如赋予给他人一样——区分开来。但是，随后就返回到营养时期的生长原则，更高级动物的生殖就加剧了这洋一种断层：这种断层使生殖和为了增加体积和力量的吃这一简单特征区分开来。对这些动物来说，性生殖是一个突然而疯狂的能量资源的浪费时机，在一瞬间就推到了其可能性的极限。这种浪费远远超过了物种生长所需的足够能量，它表现出个体在既定时间内能倾力完成的极致。它导致了对财产——精神上和身体上——的一股脑的毁坏，最终和无意义的奢华死亡的过量联系起来。","link":"/2021/06/08/Georges-Bataille/"},{"title":"Grain in Ear","text":"芒种“Grain in ear” means the grains are mature. It happens around June 5 every year when the Sun reaches the celestial longitude of 75 degrees. During this period, crops like barley and wheat all get mature and are waiting to be harvested. In Chinese, “Grain in Ear” is called Mang Zhong. Mangmeans grains at the same time busy. It forecasts the farmer is getting back to the busy field work. It is the busiest time to seed millet and the deadline for sowing activities. During this period, areas around middle stream and downstream of the Yangtze River enter the rainy season. Sensing the wetness, the mantis comes out, the shrike starts to sing and the mockingbird stops tweet.","link":"/2021/06/06/Grain-in-Ear/"},{"title":"Hateful April","text":"A Voyage to LilliputGulliver’s TravelsIt would not be proper, for some reasons, to trouble the reader with the particulars of our adventures in those seas; let it suffice to inform him, that in our passage from thence to the East Indies, we were driven by a violent storm to the north-west of Van Diemen’s Land.(fn) Twelve of our crew were dead by immoderate labour and ill food; the rest were in a very weak condition. On the 5th of November, which was the beginning of summer in those parts, the weather being very hazy, the seamen spied a rock within half a cable’s length of the ship; but the wind was so strong, that we were driven directly upon it, and immediately split. Six of the crew, of whom I was one, having let down the boat into the sea, made a shift to get clear of the ship and the rock. We rowed, by my computation, about three leagues, till we were able to work no longer, being already spent with labour while we were in the ship. We therefore trusted ourselves to the mercy of the waves, and in about half an hour the boat was overset by a sudden flurry from the north. What became of my companions in the boat, as well as of those who escaped on the rock, or were left in the vessel, I cannot tell; but conclude they were all lost. For my own part, I swam as fortune directed me, and was pushed forward by wind and tide. I often let my legs drop, and could feel no bottom; but when I was almost gone, and able to struggle no longer, I found myself within my depth; and by this time the storm was much abated. The declivity was so small, that I walked near a mile before I got to the shore, which I conjectured was about eight o’clock in the evening. I then advanced forward near half a mile, but could not discover any sign of houses or inhabitants; at least I was in so weak a condition, that I did not observe them. I was extremely tired, and with that, and the heat of the weather, and about half a pint of brandy that I drank as I left the ship, I found myself much inclined to sleep. I lay down on the grass, which was very short and soft, where I slept sounder than ever I remembered to have done in my life, and, as I reckoned, about nine hours; for when I awaked, it was just day-light. I attempted to rise, but was not able to stir: for, as I happened to lie on my back, I found my arms and legs were strongly fastened on each side to the ground; and my hair, which was long and thick, tied down in the same manner. I likewise felt several slender ligatures across my body, from my arm-pits to my thighs. I could only look upwards; the sun began to grow hot, and the light offended my eyes. I heard a confused noise about me; but in the posture I lay, could see nothing except the sky. In a little time I felt something alive moving on my left leg, which advancing gently forward over my breast, came almost up to my chin; when, bending my eyes downwards as much as I could, I perceived it to be a human creature not six inches high, with a bow and arrow in his hands, and a quiver at his back. In the mean time, I felt at least forty more of the same kind (as I conjectured) following the first. I was in the utmost astonishment, and roared so loud, that they all ran back in a fright; and some of them, as I was afterwards told, were hurt with the falls they got by leaping from my sides upon the ground. However, they soon returned, and one of them, who ventured so far as to get a full sight of my face, lifting up his hands and eyes by way of admiration, cried out in a shrill but distinct voice, Hekinah degul: the others repeated the same words several times, but then I knew not what they meant. I lay all this while, as the reader may believe, in great uneasiness. At length, struggling to get loose, I had the fortune to break the strings, and wrench out the pegs that fastened my left arm to the ground; for, by lifting it up to my face, I discovered the methods they had taken to bind me, and at the same time with a violent pull, which gave me excessive pain, I a little loosened the strings that tied down my hair on the left side, so that I was just able to turn my head about two inches.","link":"/2021/04/01/Hateful-April/"},{"title":"How QR codes can unlock product potential?","text":"Brands are leaning into verifying products, which can provide consumers with digital experiences, eco-education and loyalty rewards. Plugging physical products into socialParisian sneaker brand Philippe Model works with OpSec to place QR codes on anti-counterfeit labels, which also lets wearers connect to the brand’s website, mobile app and social media pages via their sneakers. Describing QR codes as a “social gate”, chief operating officer Paolo Bruno says Philippe Model customers will also be able to track and trace their sneakers via RFID blockchain technology, which will log the sneakers’ materials and production processes, verifying product authenticity. Bain &amp; Company estimates that digital has influenced more than 85 per cent of luxury purchases so far in 2021, opening up opportunities for brands to enhance the post-purchase verification process with a content strategy. DeFerrari says that New Balance’s in-store QR content includes styling tips, product reviews and virtual comparisons of online and offline styles side by side. By plugging social media influencers and product ambassadors into post-purchase QR codes, brands can also allow consumers exclusive access to content and online communities once products are purchased and verified. Have influencers be an authentication touchpointNot only can influencers drive customers to purchases, they can meet them in post-purchase content. As part of its September 2020 Consumer Barometer Report that surveyed 2,600 online customers globally, OpSec found that 32 per cent of those surveyed intended to spend more online during the pandemic. However, 49 per cent were concerned about unintentionally buying a fake product via social media or an online platform. Integrating influencers into a brand’s counterfeit strategy means they can educate customers and reassure those who are anxious about shopping on social media platforms. How brands “utilise the power of influencers for the benefit of their consumer and fans is really important”, says Merritt. Transparency around product authenticity and origins is particularly important among Gen Z customers. “In general, they demand more from their brands,” says Merritt. Tonino Lamborghini Spa invites customers to scan a QR code on warranty cards that accompany its watches, leather goods and sunglasses using OpSec Insight, to gain exclusive access to content and promotions, alongside authenticity verification and warranty registration. Eva Costantini, legal counsel in charge of brand protection and anti-counterfeiting at Tonino Lamborghini Spa, believes customers deserve rewards that recognise this engagement. “The direct contact with our consumers is not, and cannot be, one-way: we want to reward them because they help us to be more efficient and competitive.” Costantini sees verification as an opportunity to test and deepen brand engagement. “If a consumer is interested enough to go through to the authentication page, it means that the marketing tools are efficient and the consumer feels affiliated to the brand.” Be an eco-educatorOpportunities for QR storytelling strategies that spotlight blockchain-verified sustainability journeys are also emerging. Alongside New Balance’s successful explorations into blockchain, Jeffrey Garabedian, New Balance’s GM of apparel, is ensuring that eco-education happens via QR. All apparel items featuring a green leaf icon are made from 50 per cent or more environmentally preferred materials, such as recycled or organic. Product hang tags feature a QR code that Garabedian says drives customers back to its Responsible Leadership page. Here customers can dig deep into the backstory of product claims. Priscilla Tsai, CEO of DTC clean beauty brand Cocokind, says providing this kind of transparency is the responsibility of brands. However, she says eco-labelling on the side of packaging has its limits. “It’s a lot of information. You can’t fit everything onto a box. Having a QR code there allows us to further the conversation.” Meet consumers where they areTsai reports that on-pack QR codes are especially relevant for digital-first DTC brands with omnichannel communication strategies, where distribution is anchored online but with significant distribution offline. “We want to make sure people have a consistent experience. So if someone is finding us for the first time at Target, being able to tell them more about our story and the product they are buying helps us to make the online and offline experience more cohesive.” Post-purchase data collection is key. Philippe Model’s end-to-end blockchain is set to migrate to OpSec Insight, where lists of verification registrants can be downloaded and analysed. Bruno says he’ll be using this opportunity to find out what consumers want more of when it comes to sustainability and design. “Customisation is our goal. We’re essentially building a digital atelier.”","link":"/2021/06/12/How-QR-codes-can-unlock-product-potential/"},{"title":"Inside Shanghai’s coolest concept store","text":"Chinese fashion retailer ENG is set to open a second store in Shanghai, a reflection of its success in appealing to Gen Z shoppers. There could be lessons for retailers the world over. 「 Retail 」","link":"/2021/06/18/Inside-Shanghai%E2%80%99s-coolest-concept-store/"},{"title":"Kerry Blues","text":"山 是山的影子 狗 懒得进化 夏天 人的酶很固执 灵魂的酶像荷花 背着手 在亚热带的酒馆 门前吹风 晚了就坐下 看柔和的闪电 背着城市 亚热带季风的河岸 淹没还不醉的桥 不醉的建筑 用静默解酒 明天 阴 摄氏三到十二度 修雨刷片 带伞 在戒酒的意识里 徒然下车 走路到天晴 照旧打开 身体的衣柜 水分子穿越纤维 命运布光的手 为我支起了四十二架风车 源源不断的自然 宇宙来自于平衡 附近的星球来自于回声 沼泽来自于地面的失眠 褶皱来自于海 冰来自于酒 通往岁月楼层的应急灯 通往我写诗的石缝 一定有人离开了会回来 腾空的竹篮装满爱 一定有某种破碎像泥土 某个谷底像手一样摊开 今天的太阳 像瘫痪的卡车 沉重地运走整个下午 白醋 春梦 野柚子 把回忆揣进手掌的血管里 手电的光透过掌背 仿佛看见跌入云端的海豚 所有的转折隐藏在密集的鸟群中 天空与海洋都无法察觉 怀着美梦却可以看见 摸索颠倒的一瞬间 所有的怀念隐藏在相似的日子里 心里的蜘蛛模仿人类张灯结彩 携带乐器的游民也无法表达 这对望的方式 接近古人 接近星空 冬天是十一月 十二月 一月 二月 三月 四月 当我的光曝在你身上 重逢就是一间暗室","link":"/2021/04/22/Kerry-Blues/"},{"title":"Life System Reloading -「BARAKA」","text":"01It Is Like Pushing A Building Off Cliff Ready? Loading… Game started. Saving… Mission failed. Reloading… Death Stranding Reboot again 02You Are Just A Giant Flying Brick 03No Pain No GainYou Want It You Got It","link":"/2021/05/19/Life-Syetem-Loading/"},{"title":"Look what they taught me 「patience」","text":"THE HEART WANNA WHAT IT WANTS THEN IT WILL GET THAT HOPEFULLY","link":"/2021/05/12/Look-what-they-taught-me-patience/"},{"title":"Mayday SALUTE","text":"","link":"/2021/05/01/Mayday-SALUTE/"},{"title":"OFF THE WALL","text":"OFF THE WALL CHASE THE SUNSET SEIZE THE STAR TRAILS","link":"/2021/05/27/OFF-THE-WALL/"},{"title":"「4 3 2 1 :a novel」","text":"","link":"/2021/04/11/Paul-Austers-4-3-2-1/"},{"title":"Sneakerhead","text":"How to stand out in a fiercely competitive sneaker resale market? Farfetch-owned Stadium Goods is partnering with luxury auction house Christie’s to tap some very high-end customers.","link":"/2021/06/03/Sneakerhead/"},{"title":"Stay out of the territory","text":"「Better Call Saul」","link":"/2021/06/19/Stand-out/"},{"title":"The Blockchain Playbook: From LVMH’s Aura To Arianee","text":"by MAGHAN MCDOWELL VogueBusiness 「通过宣布新Aura区块链联盟，LVMH, Prada和历峰集团把区块链放在聚光灯下。我们解读了用法、竞争、以及透明性和品牌控制之间的摩擦。」 2019年09月，LVMH, Prada集团, 历峰集团等企业高管在Louis Vuitton家族坐落于巴黎Asnières-sur-Seine郊外的历史建筑会面，其目的在与科技公司Consensys和微软讨论为奢侈品建立的区块链平台相关细节。关键在于公司怎样开发一个能鉴定奢侈品权威和来源的区块链平台而不是成为竞争者。 参加讨论的卡地亚全球创新总监Timothy Iwata Durie提到 (卡地亚的母公司是历峰集团)，“我们在一起探讨每一点，比如什么是合适的法律实体，什么是管理原则？” 结果是非盈利的Aura区块链联盟，对任何奢侈品牌（支付执照费用和每个产品修理费）开放，提供追踪任何用于唯一数字标识符（基于非同质化代币）产品，所有品牌集体贡献区块链治理和策略。 这个在奢侈品直接仅存的联盟给区块链带来关注，奢侈品面向消费者对透明性的期望和疫情期间对线上产品的转移，尽管它需要适应和起步于时尚(Facebook领导的Libra组织, 也声称在2019年最终品牌重塑的时候最后失去了25%的创始成员)。 Aura 是最新的来到幕前的时尚-区块链实体，加入了其他网络，比如与Ba&amp;sh合作的Arianee, Audemars Piguet和Vacheron Constanti, 与Givenchy和H&amp;M合作的VeChain。 Aura也是一个私有的区块链，这意味着只有在社交网络上的公司才有完整权限和控制数据（品牌和客户的数据只开放给各自品牌）。然而Aura代表着对于科技和奢侈品行业关系的意义深远的发展，它也提出了围绕在非公开的透明性和哪个品牌来推进现存的区块链项目的疑问。 基于时尚行业的Lukso区块链平台的联合创始人Marjorie Hernandez说道，这个正式的联合是为了孕育之前未加思考的’展示工业内智能的变化‘区块链。Lukso是一个去中心化的，未经许可的区块链基础设施，它为物理和数字商品所设计，最近注册了 Karl Lagerfeld’s photographic legacy。他们会在区块链网络中建设桥梁吗？一个财团驱动的区块链意味着这些管理的权威和入场券的障碍。 Aura的计划Aura authenticates products by assigning each a unique digital identity that houses provenance information; additional features can be added over time, and a tech roadmap is in the works, Durie says. The information can be attached to products through various means including QR code or RFID tag, which Prada has begun adding to its products. While “track and trace” capabilities had always been a goal of Aura, the past year’s dramatic increase in digital and remote selling made them more important, says LVMH chief information officer Franck Le Moal. Brands have also started endorsing and participating in rental and resale, which hinges on the authentication of products, as well as experimenting with digital clothes and NFTs (which are unique tokens on the blockchain). There are “advanced conversations” ongoing with other groups and independent brands, says Durie, of Cartier. LVMH-owned Bulgari, Hublot and Louis Vuitton, in addition to Prada and Richemont-owned Cartier, are already using the platform. “Consumer needs have shifted, and the focus on sustainability has accelerated the urgency,” Durie says. “It pushes us to reaffirm our conviction and to be more open-minded and meet the needs of our consumer by having tools to give them transparency.” Aura is not pushing brands to adopt any specific uses, but rather providing members access to a platform that has various capabilities throughout a product’s supply chain, says Le Moal, of LVMH. Most will use it to offer information on the beginning of a product’s sourcing, including raw materials, and factories, and extending to post-sale, including aftercare and secondhand, though it could be used to offer an NFT collection if brand’s decide. While even the organisers of the Aura Consortium are still ironing out details as they arise, they do have a strict point of view on why a private platform is ideal, and what the future might entail. 一个可执行的奢侈品牌区块链？Aura is an open consortium, but it is not open to everyone, and operators can decide to hide or show the events they track within the system, meaning that customers only see what a brand gives them access to. Prospective brands submit an application to the membership sub-committee, which vets them and makes a recommendation to the board. “We are not like a gentleman’s club, and as long as you are a luxury brand, you’re in. However there are codes of conduct and terms of use,” Durie says. One notable example: Durie says that while the technology might enable a brand to create an NFT, the consortium would not encourage members “to engage in speculative behaviour” associated with the hype. “Luxury brands are built for the long term. It’s important to make things possible, but at the same time, we are luxury brands and we make things last — longevity is important to us. It is really anchored in the values of luxury brands.” A notable outlier to the consortium is Gucci-owner Kering. Chief client and digital officer Grégory Boutté told Vogue Business in 2019 that he would be open to partnering with LVMH and Kering has since gone on to test blockchain including using third-party providers to certify Ulysse Nardin watches and offer authenticity checks for Kering’s eyewear. Kering and LVMH both confirmed they are in ongoing talks about Kering joining Aura. A Kering spokesperson said “the group hasn’t identified use-cases that could not be done on existing blockchain solutions and has already launched some initiatives in that field”. Others operate differently: fashion blockchain startups, such as Lukso and Arianee, operate public, decentralised blockchains and open-source protocols, meaning that anyone can join and customers can see every “event” in a product’s life cycle. Le Moal, of LVMH, says that creating a private, bespoke platform in-house, versus using an existing option, was important for controlling the processes and the data without a third party in between. “By us coming together and gaining scale, we have the ability to set standards,” Durie says. “We need to make sure we do not put important client data in the hands of a third party or be exposed to an open-source platform. We exist hundreds of years, not five. It’s important to protect the integrity of our client information.” Meanwhile, Arianee’s public blockchain and open-source solution, means the code is published, and people can contribute and build on it, with brands able to build their own interfaces. The Paris-based firm provides digital passports to luxury goods, and focuses less on supply chain information and more on engaging the customer after a sale, or resale, is made, says CEO and co-founder Pierre Nicolas Hurstel. Breitling, for example, has attached digital IDs to its timepieces and uses them to offer special promotions to owners while allowing the customer’s identity to be anonymous. Arianee also has a nonprofit association, whose 35 members include Richemont; it just raised $9.5 million in part from a French government fund. The open-source protocol allows the public “full transparency”, says Arianee’s Hurstel. Open-sourcing and decentralised infrastructure is the best way to build trust, adds Antonio Carriero, Breitling’s chief digital and technology officer, who is a member of the Arianee Project Association. For now, he views Aura and Arianee to be compatible and complementary, rather than competitive. “Using one, the other or both depends on your priorities as a brand.” Lukso’s Hernandez says that while a private blockchain for tracking and tracing is a good idea, the power of blockchain technology is ultimately in decentralisation, meaning that there is no central authority, casting some doubts on Aura’s closed control. “In order for users and third-party companies to verify the ownership and the true transparency of a product, that product identity needs to live on a decentralised, permissionless public blockchain,” she says. Aura’s Le Moal and Durie say they are open to eventual partnerships. “We cannot say never, but for the time being, we want to develop ourselves,” Le Moal says. “We want to be sure we are focusing on the luxury industry, and not all others focus on luxury.” Durie adds that a private blockchain does not require the large energy consumption that most public blockchain protocols do, and says that as sustainability is a key value of the Consortium, this underpins the choice of a private blockchain. 接踵而来的是什么？随着奢侈品牌考虑它们的区块链策略，不同网络之间的交叉的问题随之而来。理论上来说，一个产品能被添加进多样的链路。这叫做”互用性“，对于技术的成功起到关键的作用，Megnetic公司（这家公司专注于区块链和加密货币初创公司）的投资联合创始人和执行董事Megan Kaspar解释道。 ”时尚零售行业中系统是孤立的和无法交流的，这是一个历史问题。“Eon公司的创始人和总裁Natasha Franck说道，Eon公司最近参股了Gabriela Hearst和Yoox Net-a-Porter来为产品提供全球数字ID。她补充道:“我们创造了不能在经销商或者消费者间通信的产品。互通性是一个更强数字生态系统的基础。任何时候物品能够通信，这就给整个网络附加了更多的价值。” 同时，Aura欢迎其他品牌加入，卡地亚的Durie说道，它也开放给个人品牌，或者在时尚之外的品牌，“我们做得越多，对我们的行业就越好。”","link":"/2021/06/01/The-blockchain-playbook-From-LVMH%E2%80%99s-Aura-to-Arianee/"},{"title":"The Evening And The Morning","text":"『暗夜与黎明』Where Follett excels is in telling a yarn…you won’t be able to put it down. A Time of Conflict It is 997 CE, the end of the Dark Ages, and England faces attacks from the Welsh in the west and the Vikings in the east. Life is hard, and those with power wield it harshly, bending justice according to their will – often in conflict with the king. With his grip on the country fragile and with no clear rule of law, chaos and bloodshed reign. Three Lives Intertwined Into this uncertain world three people come to the fore: a young boatbuilder, who dreams of a better future when a devastating Viking raid shatters the life that he and the woman he loves hoped for; a Norman noblewoman, who follows her beloved husband across the sea to a new land only to find her life there shockingly different; and a capable monk at Shiring Abbey, who dreams of transforming his humble abbey into a centre of learning admired throughout Europe. The Dawn of A New Age Now, with England at the dawn of the Middle Ages, these three people will each come into dangerous conflict with a ruthless bishop, who will do anything to increase his wealth and power, in an epic tale of ambition and rivalry, death and birth, and love and hate.","link":"/2021/04/08/The-evening-and-the-morning/"},{"title":"The social shopping race","text":"It isn’t just Instagram. Major social apps are recognising the power in building shopping into their platforms, and they’re taking several avenues to master it. We weigh on the pros and cons.「VOGUE」 As of this month, Facebook is home to a three-month live-stream shopping series featuring fashion, beauty and lifestyle brands. At Instagram, a team of former magazine editors are creating content to promote brands that can be shopped directly on the platform.","link":"/2021/06/12/The-social-shopping-race/"},{"title":"UX Roadmap","text":"","link":"/2021/04/18/UX-roadtrip/"},{"title":"Write Like You Are Not Afraid","text":"","link":"/2021/04/09/Write-Like-You-Are-Not-Afraid/"},{"title":"「Dig」 Command in Linux","text":"Dig (Domain Information Groper) is a powerful command-line tool for querying DNS name servers. The 「dig」 command, allows you to query information about various DNS records, including host addresses, mail exchanges, and name servers. It is the most commonly used tool among system administrators for troubleshooting DNS problems because of its flexibility and ease of use. 1sudo apt update &amp;&amp; sudo apt install dnsutils Get a Short AnswerTo get a short answer to your query, use the +short option: 1dig linux.org +short Get a Detailed AnswerFor more a detailed answer, turn off all the results using the +noall options and then turn on only the answer section with the +answer option. 1dig linux.org +noall +answer Querying A recordsTo get a list of all the address(es) for a domain name, use the a option: 1dig +nocmd google.com a +noall +answer Querying CNAME recordsTo find the alias domain name use the cname option: 1dig +nocmd mail.google.com cname +noall +answer Reverse DNS LookupTo query the hostname associated with a specific IP address use the -x option. 1dig -x IPAddress +noall +answer Conclusion「dig」 is a command-line tool for querying DNS information and troubleshooting DNS related issues.","link":"/2021/06/02/%E3%80%8CDig%E3%80%8D-command/"},{"title":"世界是一面反观自己的镜子","text":"今天太阳很好，葡萄很好，苏打也很好 坐在阳台上，椅子很好，屁股也很舒服。 死亡什么的，轰然倒塌，爱情什么的，取之不尽，用之不竭 现在看来，这些城市和湖水，刚好可以满足。 今天是认真的，没过多久就回了房间 以前会待到天黑黑 以前总会感到难过","link":"/2021/05/15/%E4%B8%96%E7%95%8C%E6%98%AF%E4%B8%80%E9%9D%A2%E5%8F%8D%E8%A7%82%E7%9A%84%E9%95%9C%E5%AD%90/"},{"title":"人是流动的","text":"人是流动的，这意味人是经常前后矛盾的。 善思的人会极力避免这一点，但这会让他们更加苦恼。 很多时候，倒是羡慕那些什么也没想的人 在超市若干品牌的货物架间做出当天此刻最大的决策，这是多么地幸福。","link":"/2021/06/18/%E4%BA%BA%E6%98%AF%E6%B5%81%E5%8A%A8%E7%9A%84/"},{"title":"关于消解和自洽","text":"记忆中的形象一旦被词语固定住，就会在现实中被抹掉。 「看不见的城市」 对于人生命题来说，自洽是一套解释逻辑，是个体的方法论; 透过不同的解答方式来探索最终答案。 然而最终答案真的存在吗？可能命题本身就是虚无，那么此题也无解。 转念一想，个体真的需要答案吗？或者他们只是需要一种解释方式。不要去预设有那么一个终极奥义，先验不一定真实存在的。 正视命题，用自己的解释方式去消解命题。即使一切都是虚无，都毫无意义，人生的一切随时可能被抹掉，但自己创造的虚无也是一种意义。自我消解本身就是专属于自我的意义，也即自洽。 所以不要去随意对待自己的人生命题，seize and solve it by yourself, and live every moment to the fullest.","link":"/2021/04/13/%E5%85%B3%E4%BA%8E%E6%B6%88%E8%A7%A3%E5%92%8C%E8%87%AA%E6%B4%BD/"},{"title":"「存在主义」咖啡馆","text":"「海德格尔在《存在于时间》中提及，日常存在，而非触不可及的宇宙论或者数学，才是最’本体论’的东西，实际的操劳与操心，比反思更为原始。有用性先于沉思，’当下上手状态’先于’现成在手状态’，’在世存在’和’于他人共在’先于’独自存在’。我们不是在纷繁复杂的世界上空盘旋，从上往下凝视，而是已经在这个世界上，并且参与其中——我们’被抛到’这里，而’被抛性’必是我们的起点」 过去的哲学家一直陷在一种意识的’消化‘模式中：他们认为，感知某物就是将其拉入我们自己的实体之中，像蜘蛛用它自己的唾液包裹住昆虫，将其半分解掉一样。相反，根据意向性，意识到某物，就是爆发出去—— 让自己从潮湿的胃中挣脱出来，从那里飞出来，超越自己，到达不是自己的所在。飞过那里，飞到树上，但是在树的外面，因为它让我感到迷惑、厌恶，我无法让自己沉醉于它，就像它也不能把自己溶解于我一样：外在于它，外在于我自己……而在同一过程中，意识得到了净化，变得像一阵风一样澄明。除了逃离自身的冲动，跑到自身之外的滑离，其中不再有任何东西。如果你能’进入‘一种意识（尽管不可能），那么你就会被一阵旋风卷起，然后被抛回到外面有树和灰尘的地方，因为意识没有’内在‘。它只是它自身的外表，正是这种绝对的逃离，这种对成为物质的拒绝，使它成为一种意识。 想象一下，现在一系列连锁的爆发，让我们挣脱了我们自己，甚至都不留一点时间，让我们在这些爆发之后形成’我们自己‘，而是直接把我们扔出去，扔进世界干燥的尘埃中，扔在粗糙的地面上，扔在事物之间。想象一下，我们以这种方式被抛出，被我们的本性抛弃在了一个冷漠、敌对、抵抗的世界里。如果你这样做的话，就能明白胡塞尔在那句著名的话中表达的发现所具有的深刻含义了「所有的意识都是从属于某物的意识」。 对于萨特来说，如果我们试图把自己关进我们的心灵之内，关进’一间百叶窗紧闭、漂亮温暖的房间里‘，那我们就会停止存在。我们没有舒适的家：到尘土飞扬的马路上，正是我们是什么的定义。","link":"/2021/04/20/%E5%AD%98%E5%9C%A8%E4%B8%BB%E4%B9%89%E5%92%96%E5%95%A1%E9%A6%86/"},{"title":"月球环形山","text":"凌晨时分，索菲娅醒了。特雷莎和艾伦被从睡梦中惊醒，她们叫醒了馥馥，让孩子最后见见还活着的妈妈。索菲娅只能说一点话了。 特雷莎觉得听到她说：”「幸福过了头」“。 大约四点钟，索菲娅去世。尸体解剖将会显示，她的肺已经完全被肺炎摧毁，心脏的毛病可以追溯到几年以前。正如大家所料，她的脑容量巨大。 博恩荷姆的医生在报纸上看到了她的死讯，并没有觉得意外。他偶尔会有预感，这对于从事他这种职业的人是种困扰，而且也不一定可靠。他曾想过，只要躲过哥本哈根，也许就能保住她。他想知道她是不是吃了他给的药，药是不是带给了她些许安慰，正如在他需要的时候，药物曾给予他安慰。 索菲娅·科瓦列夫斯基葬于斯德哥尔摩当时被称为新公墓的地方。依然寒冷的某天下午三点，默哀的人和旁观的人呼出的气流，在严寒的空气中结成了浮云。 魏尔斯特拉斯送来了月桂花圈。 之前，他和他的妹妹们说，他知道他再也不会见到她了。 他之后又活了六年。 她去世前，马克西姆接到了米塔——列夫勒的电报，从博利厄赶来，他抵达的时候，恰好赶上了在她的葬礼上发言。他用的是法语。他提起索菲娅，更像是提起一位他相熟的教授。他代表俄罗斯对瑞典表示感谢，感谢瑞典给了她作为一个数学家谋生的机会。（以一种相称的方式应用她的知识，他说。） 马克西姆没有结婚。过了一段时间，他被允许返回他的祖国，在彼得堡授课。他成立了俄罗斯民主改革党，他的立场是支持君主立宪制。沙皇派认为他太过自由主义，列宁却公然抨击他是个反动派。 馥馥在苏联从医，逝于20世纪50年代。她对数学没有兴趣，她说。 索菲娅的名字给了月球上的一座环形山。","link":"/2021/05/17/%E6%9C%88%E7%90%83%E7%9A%84%E7%8E%AF%E5%BD%A2%E5%B1%B1/"},{"title":"建筑学的治愈论","text":"Irwin Union Bank One of the simplest and most sublime structure to have been built in U.S. 米勒之家 The Miller House and Garden，埃罗·萨里宁 Eero Saarinen，1957. 巴塞洛缪县公共图书馆 Bartholomew County Public Library，贝聿铭 I.M.Pei，1969. 第一基督教教堂 First Christian Church，伊利尔·沙里宁 Eliel Saarinen，1942. 罗伯特·斯图尔特大桥 The Robert N. Stewart Bridge，J·穆勒 J. Muller，1999. https://www.columbus.in.gov/engineering/about/about-the-bridge/ 第一金融银行（原欧文联合银行） First Financial Bank，德博拉·伯克 Deborah Berke，2006. 欧文花园旅馆 The Inn at Irwin Gardens, 亨利·菲利普斯 Henry A. Phillips，1910. https://columbus.in.us/inn-at-irwin-gardens/ 欧文会议中心 Irwin Conference Center，埃罗·沙里宁 Eero Saarinen，1950. Republic Newspaper Building，迈伦•戈德史密斯 Myron Goldsmith，1971.http://www.som.com/china/projects/the_republic__newspaper_plant__offices 哥伦布心理健康卫生局 Columbus Regional Health Mental Health Unit，詹姆斯·波尔舍克 James Stewart Polshek 石灰岩柱退伍军人纪念馆 Limestone Pillars - Veterans Memorial 北区基督教堂 North Christian Church，埃罗·沙里宁 Eero Saarinen，1959. 新布朗斯维尔廊桥 New Brownsville Covered Bridge，史蒂芬·朗 Stephen H. Long，1840. 哥伦布大会堂 Columbus City Hall，爱德华·巴塞特 Edward Charles Bassett，1981. Mill Race公园瞭望塔 Mill Race Park Observation Tower，斯坦利·塞托维茨 Stanley Saitowitz. http://www.saitowitz.com/","link":"/2021/04/26/%E5%BB%BA%E7%AD%91%E5%AD%A6%E7%9A%84%E6%B2%BB%E6%84%88%E8%AE%BA/"},{"title":"立夏","text":"The start of summertime","link":"/2021/05/05/%E7%AB%8B%E5%A4%8F-start-of-summer/"},{"title":"荔枝 伞 椰子壳","text":"在花瓣中间，更充沛的力气 让夜晚绵密，让胳膊长满露珠 免遭遗忘，备受恩宠，水潭的，墙体的 在条纹和彩色的时刻，老叶子和恬静的，曲线可爱、气味可口那样的指甲 竹篮里的芍药、荔枝、伞和椰子壳 海里的文具，海岸上的文具盒，内陆的纸张 也可以证实你的感受，出于迎接以及警卫的目的 为你多存在一会儿 孤独很肥 爱和金属无法修饰这些 一觉醒来 什么都不管","link":"/2021/05/17/%E8%8D%94%E6%9E%9D-%E4%BC%9E-%E6%A4%B0%E5%AD%90%E5%A3%B3/"},{"title":"霓虹推理文学史","text":"","link":"/2021/04/28/%E9%9C%93%E8%99%B9%E6%8E%A8%E7%90%86%E6%96%87%E5%AD%A6%E5%8F%B2/"},{"title":"Adam Smith&#39;s birthday","text":"后来死神和赫尔墨斯在极乐世界互相吹牛 要把地球上最宝贵的东西带到这里比一比 赫尔墨斯从斯密书架上偷了《国富论》 而死神赢了这场比试 ——他带来了斯密本人 By 阿格里科拉 「亚当·斯密死后」 卡尔·波兰尼在其不朽的著作《大转型》（1944年）中研究了19世纪以市场为基础的理念和实践的传播。他认为，传统的互惠和地方再分配模式已经被非人化的市场交换取代，这导致市场经济和民族国家融合成了“市场社会”。自由放任的制度已经控制了市场，并且“一个自我调节的市场要求在制度上将社会划分为经济和政治领域”。其结果是削弱了政治的重要性，释放出无法控制的经济力量，导致1914—1939年接连发生了战争、大萧条和新的战争。 波兰尼强烈的论点使他过分夸大了反对19世纪资本主义的理由，低估了其他因素，包括帝国主义的过度扩张、民族主义、软弱的政治领导、腐朽的政策和纯粹的坏运气等因素的重要性。但他提出的基本问题是正确的。资本主义正在失去其作为财富创造和个人自由的引擎的合法性。增长乏力，生产力停滞不前，未来不明确也不安全。我们生活在一个新的“镀金时代”，在这个时代，出现了极端的财富，大众对财富和名人十分推崇，同时公众对政治和经济制度的稳定性和公平性的担忧却在不断升级。 我们有充分的理由对长远的前景感到乐观，全世界也有更多人比以往任何时候都更长寿、更富有、更健康。公众对资本主义的祛魅从未达到今天的程度。现代企业越来越被证明是一台“外部化的机器”，它善于将成本转嫁给他人，同时提高价格、限制竞争、压低工资，并设置障碍阻止他人进入市场。同时，开放和自由交易的市场看起来既是不可避免的，又是不可能达成的—不可避免是因为没有任何其他可行的选择，能成为一种大规模的有效分配商品和创造财富的手段；不可能达成是因为这样的市场往往会导致不平等的升级，以及粗暴的道德规范和价值观。再考虑到由技术带来的长期经济利益和社会收益的比率在下降，创造安全的、高质量的工作岗位的可能性也在降低，我们面临的困境会更加严重。同时，全球化的好处是分散的、渐进的，它的代价却往往是集中的、尖锐的和意想不到的。于是，社会对市场经济的结果深感愤怒和沮丧，以至于对市场经济的地位和合法性提出了质疑。而且这种愤怒和挫折感是在经济增长和市场繁荣的时期出现的。想想看，在严重的经济衰退中，它们会是什么样子。 更糟糕的是，在1989年柏林墙倒塌后，整个政治领域都对资本主义的地位感到非常自满，尤其是英国和美国。他们认为历史已经终结。从那时起，主流右派就不再觉得有必要以任何严肃的方式为市场经济辩护，更不要说对市场经济的优缺点进行系统的说明，以打击裙带资本主义的蔓延。直到最近，主流左派也没有提出任何严肃的批判，更不用说准备应对或者解决全球化的负面影响了。因此，公众会接纳更激进的观点和运动也就不足为奇，难怪国有化、国家征用和国家控制的计划越来越受到公众的欢迎。但是所有政治理念都是一样，开放市场的理念也必须受到挑战、修正和更新，才能保持其合法性。如果它不被那些相信它的人挑战，就会被那些希望摧毁它的人挑战。 2007—2008年的金融危机不仅消耗了巨大的经济价值，也消耗了经济学的公信力，并将公众对经济学的理解推向了“新自由主义”或“市场原教旨主义”之下的一般性批判。这种混为一谈的做法很方便。这对政策制定者来说很容易理解，它从一个相当复杂的基本现实中创造了一个简单的公共叙事，并且提供了直接的空间以便对银行、金融市场、监管者乃至政治家和资本主义本身提出批评，这些批评往往是合理的。 有这样一个逻辑链条，因为银行业存在有效竞争，所以使放松管制成为可能，并且放松管制可能具有经济和社会价值，这构成了2008年金融危机的关键知识背景。回想起来，那场危机的惊人之处，甚至不在于那之前的10年的银行系统令人发指的贪婪自利，也不在于相关政策、法律和执法方面的具体失误，而是自由市场的语言已经对几乎所有方面达成了思想控制，哪怕现实往往非常不同。我们很难不将这种控制与以下重要事实联系起来：至少在英国，迄今都没有对2008年的危机进行过适当的、全面的、独立的调查，几乎没有人对已发生的事情负责。 这里隐藏着一个严重的知识性错误，它破坏了决策，损害了公共讨论。正如我们看到的那样，不同市场之间往往在关键方面存在差异，其中最明显的是土地、劳动力和资本市场。此外，经济不仅仅是市场的问题，自由放任也不等同于市场经济。世界上许多优秀的经济学家在过去的几十年里，一直在试图思考市场的局限性，例如不完善的信息和理性、交易成本、偏好、联系等等，并试图理解从住房到医疗的不同市场是如何实际运作的。作为一种意识形态，新自由主义已经死了。但我们真正需要进行辩论的是市场是什么和应该是什么，关于“市场失灵”概念的局限性和确保有效竞争的必要性，以及关于规范、文化、国家角色，这些都已经被遗忘了。 经济学需要承认自己的局限性。我们很难不得出这样的结论，如果能少一些学者牵涉其中，多一点责任心和竞争，这个行业会大大受益。经济学对科学地位的要求是混乱的，主要的经济学家甚至无法就经济学是否可以或应该被用来进行预测达成一致，更不用说依靠它来进行正确的预测了。按照弗里德曼的风格，经济学长期以来过分专注于自己的模型，而不是它们应该代表的现实世界的现象。经济学甚至还在努力解决诸如人类的偏好应该如何建模或统计这样的基本理论问题。它鼓励政治家坚持所谓不僭越的技术官僚责任，幻想经济本身就能解决正义、公平和社会福利的问题，所以经济应凌驾于政治之上。朝鲜在经济原则上可以处于帕累托最优状态，在那里，一个人无法在不恶化他人处境的情况下改善自己的处境了，但很少有人会认为这是值得效仿的。 我们应该怎么做呢？如何才能保障和扩大市场利益，并控制其不良影响？如何重拾公众对市场和市场体系的信任？如何保护这个有限制的但仍然无价的遗产？ 我们需要为我们的时代制定一个新的总体叙事。我们需要更好的公众理解框架、更好的解释、更好的共同身份，通过这些框架，我们可以对这些问题达成和解。为了创建这一框架，我们必须回到经济现代性的黎明，回到亚当·斯密本人。这不是一个被党派人士歌颂、被诋毁者谴责的漫画式的、单调的、自由主义者的斯密形象，而是斯密在他所有著作中的详细论证，从伦理学到法理学再到政治经济学的实际思想。即使是经济学家，即使他们读的书足够多，也很少有人读过《国富论》第一卷和第二卷以外的内容。然而，在许多方面，斯密提出的问题正是我们面临的问题，他的著作是一个被忽视的充满洞察力和智慧的宝库。 真实的斯密不是一个从《道德情操论》中的利他主义转向《国富论》中的利己主义的知识分子的叛徒。他不是一个市场原教旨主义者，不是一个经济自由主义者，也不是那种强烈意义上的认可自由放任的经济学家。他不是自私自利的鼓吹者，不是亲富者，也不是厌恶女性的人，他不是“经济人”的创造者，也不是掠夺性资本主义的创始人。他当然也没有宽恕奴隶贸易。但他曾经是，现在是，将来也会永远是，一位具有非凡深度和力量的思想家。他被正确地称为经济学之父，从概念上讲，这是因为他是把市场完全置于经济学思想中心的第一人，从实践上讲，在斯密之后的经济学家很少有人不欠他的知识债，包括马克思和凯恩斯。而且，他的政治经济学的范围远比单纯的经济学广泛，他同样可以公正地被认为是社会学的奠基人之一。他的牛顿式的科学哲学，虽然在后来美国哲学家查尔斯·桑德斯·皮尔斯的著作中得到了伟大的现代化探索，但是其意义仍未得到充分理解。 对许多人来说，斯密的政治经济学将永远占据重要地位：它既可作为经济分析的模型，又对人类行为、市场、贸易、专业化、分工、税收以及补贴、赏金和保护的负面影响等提供了具体见解。也有人会钦佩他的道德平等主义，钦佩他对弱者的感情，钦佩他对尊严和可敬对人的地位和自我意识的重要性的信念，钦佩他在“自然自由体系”中把不平等降到最低的方式，钦佩他对裙带资本主义的毁灭性抨击，钦佩他的人类发展阶段论，钦佩他对商业社会取代封建主义的历史分析，以及他对商业社会极其精妙的探索和捍卫（这种探索比后来波兰尼对“市场社会”的分析要细致得多）。还有一些人会认识到斯密的理论的基础性和重要性，包括关于道德和社会规范的理论以及法理学。 如果只看到斯密思想的一部分，就会忽略其整体的力量和一致性。对斯密来说，“财产的状态必须随着政府的形式而变化”，因为财产和政府都依赖基于社会共识的规范和模式，它们的发展都以人类的道德情感为基础。因此，政治和经济最终不可能相互分离，或者说任何一方都不可能与道德评价分离。不可能有无关价值的经济学，虽然我们可以分离出经济的、政治的、道德的不同角度来讨论人类行为，但这样做只是反映了我们对知识便利性的需要，而不是说他们在本质上是深度割裂的。 新的叙事必须从新的政治经济学开始这项事业将是许多人的工作，超出了本书的范围。但是我们可以从斯密的思想中总结出6条经验，或许可以预见其中的一些主旨。 第一，我们必须把资本主义和商业社会区分开来。对斯密来说，正如我们看到的，商业社会的出现是“每个人……在某种程度上都成为商人”的时刻。它标志着封建主义向我们所知的经济现代化的历史转变：出现了一个社会，而不是一个氏族或部落；人们在法律的约束下自由交易；这个社会至少在原则上包容所有人，并将财富和机会传播给所有人；社会产生的盈余可以用来保护弱势群体；按照人的本能和人性工作；人们不是通过武力、阶级或等级，而是通过相互的道德和社会义务团结在一起。 从这个角度看，商业社会是一种具有非凡价值的成就，我们有责任保护和提升这一成就。它具有巨大的弹性，至少在其民主形式下，它具有独特的能力，能够获得公民的忠诚，并通过促进公民的繁荣和自由来维持其合法性。在斯密令人惊叹的全面而富有启发性的论述中，这种忠诚体现在不同的方面：历史、共同的身份和叙事以及作为其基础的规范、公共机构、竞争和经济利益，所有这些都从根本上源于人类对爱和变得可爱的渴望，以及互通有无、以物易物和互相交易的本能。正如最近发生的事件所显示的那样，商业社会也是脆弱的，在一个相互依存的世界里，它特别容易受到包括金融危机、恐怖主义和自然灾害在内的威胁。但是如果说要用战争、宗教独裁、民族主义来替代贸易和民主，或者说用榨取性经济唯物主义来替代适度商业化的益处，那这些选项都是不可接受的。如果缺乏有效的、运作良好的市场和国际贸易秩序，人类就不可能有体面的未来。如果维护商业社会需要改革资本主义，那么我们就必须改革它。 第二，商业社会需要有韧性、有节制、有战略、有实力的政府。市场依赖于明智的法律和良好的执法，而道德社会需要人们不仅仅有法律上的自由，还能在充分发挥其能力时也享有自由。斯密曾提出要把贸易从过分细致的管制和补贴的有害影响中解放出来，但是人们很容易忘记政府在他的思想中处于核心地位，政府是国家的保护者、司法的裁决者和执行者、条约的签署者、贸易的保证者（虽然英国政府曾支持《航海法案》），政府是公共工程、基础设施和地方学校的建造者，也是市场的监管者。除此以外，我们还可以加上现代政府被授予的职能，如提供风险保险，在不同代际人口之间重新分配收入，稳定宏观经济，还可以在物理空间和网络空间等领域建立新的市场。在这些领域，只有政府监管才能明确界定产权，有效分配商业风险和回报。随着市场、商业、社会需求和国际关系的复杂性的增加，对政府的要求也变得更加复杂，这就带来了严重的政治挑战。但是，“私营部门挣钱，公共部门花钱”的想法忽略了一点：两者都需要彼此才能实现有效运作。 第三，成功的商业社会之所以拥有强大的国家，不仅仅是因为它们需要这样的国家，更因为它们有能力支撑强大的国家：它们拥有独立的机构和多元主义，能够抵御国家统治的可能性。最重要的是，它们拥有合法性、认同、文化和信任，因为整个系统，无论市场还是政府，都依赖于信任。合法性之所以重要，首先是因为它反映并促成了社会信任，以及相互义务的模式和对等性，没有这种信任，一个社会就无法团结起来。在实践层面，社会信任使税收成为可能。英国在整个18世纪都有比较高的税收水平，部分原因是尽管政府有很多不完善的地方，但有足够的社会信任和合法性来征税。当2007—2008年的金融危机爆发时，直接的解决方案并不在于国际机构或多边组织，而是在于一个国家征税和支出的权力，这让英国、美国和其他国家迅速地支持和救助了它们破产的银行。这场危机本身是毁灭性的，不仅因为它的经济后果，还因为它对社会资本，即信任的破坏。全球金融业具有破坏信任的独特能力，因为它的规模，货币和信贷的普遍重要性，还因为它也许比任何其他行业更根植于信任，即信托关系。正如斯密所言，金融业需要“防火墙”，以防止其周期性的危机扩大成普遍的灾难性事件，就像2007—2008年那样。 第四，除了具体的缺陷之外，商业社会还有内在的弱点。因为市场互不相同，它们都带有自己的弊病。市场的目的是促进贸易，有效地配置商品、服务和资本，刺激创新，从而为公众的最大利益服务。正如斯密所展示的，在运作良好的市场中，这些不同的利益通常是一致的。但是，他证明了，当市场运作不良时，不同方面的利益可能会出现分化，市场运作不良有多种形式：出现垄断的倾向，监管不力，动物精神的丧失，以及更广泛的，由于寻租、信息和权力的不对称以及所有者和代理管理者之间的利益冲突促成的裙带资本主义。裙带资本主义是一种普遍意义上的弊端，它损害了经济，腐蚀了政治，扩大了不平等，并使市场和商业社会本身变得无效并失去合法性。当公司和市场与公共利益失去联系，当商业回报不受商业价值影响，裙带资本主义就会蓬勃发展。这些事情削弱了市场交换的核心原理：市场交换应该如斯密在他的自然自由体系中所描述的，是“普遍富裕”的源泉，即普遍繁荣，而不是少数人的富裕。 然而，第五个教训是，裙带资本主义远不是现代商业社会面临的唯一挑战。最深层次的威胁是人们价值理念的变化。一方面是公共领域的不断商业化，另一方面是新技术的影响。这些新技术有能力使竞争环境进一步向圈内人倾斜，远离公民和消费者，从而使裙带资本主义更加恶化。社交媒体的传播还引出了公共问责和合法性的深刻问题。这些问题涉及社交媒体对弱势群体及青少年的影响，以及通过社交媒体的传播能力操纵舆论对民主的影响。这就是脸书在2010年美国国会选举期间进行“6 100万人的社会影响力和政治动员实验”的教训，更不用说最近披露的社交媒体的政治力量，这超过了它们榨取租金和排斥竞争对手的能力。 亚当·斯密有力地解释了我们是如何生活在一个通过人与人之间的互动产生价值观的世界里：纵向上，是对富人和权贵的崇拜，以及商业社会对同情，特别是对穷人的同情的潜在抑制；横向上，是与他人做比较的倾向，以及我们“不仅要被爱，而且要显得可爱”的愿望。斯密很好地诊断了今天人们对社会比较的贪婪欲望，以及这种贪婪造成的地位焦虑。这是社交媒体的核心内容，它让年轻人产生越来越多的精神病态，而对这种贪婪的利用又是其产品逻辑和商业模式的核心法则。从斯密的角度来看，关键问题不仅在于公共责任与行使权力的合法性，更重要的是我们对自我的想象。这些问题涉及我们价值观的形成过程，到底是通过分散的社会互动或通过民主制度（选举领导人）形成的，还是被极少数人在暗中操控的，而这些人没有受到真正的问责—到底是否还有人真正在监督他们呢？ 最后一个教训是，随着商业社会的不断发展，也不断出现了新的挑战。今天，商业社会的本质可以说比以往任何时候都变得更快。人工智能、机器人和自动化正在改变世界上的工作。全球化正在将世界各地最有生产力的工人吸引到已经在享受商业社会福利的国家，而剩下的那批人则在遭受贫困的威胁。即使在工业化国家内部，不同地区和社会之间，不同群体之间，在死亡率和健康方面的差距也在急剧扩大。收入的两极分化让非常富有的人从精神上、身体上和财务上自我隔离，转移到（实际的或虚拟的）私人的封闭社区之中，这将明显削弱人们纳税并分担风险的动机，而这种动机是现代福利国家理论的核心。每天都有大量的流动性和风险通过影子银行网络在监管不足的地方进行交易。二战后建立的以规则为基础的贸易体系，随着贸易集团的发展，已经变得越来越无效。亚洲经济经历了相对疲软的200年，这一反常现象已经结束。越来越多的大规模、技术先进的公司显然有能力为了自己的利益去欺压城市、国家甚至是所有人（只需假以时日）。就商业社会本身来说，典型的西方资本主义与民主相结合的形式，正受到国家资本主义模式的威胁。 因此，一种新的斯密式的叙事必须在变革的冲击下和分裂的力量中形成。这些惊人的事态发展要求我们在思想和实践上进行有力的革新。政治、政治审议和政治理解都需要被重新挖掘和激发。现代商业社会所依赖的“同意”正在崩溃，而原本人们是自由地选择了同意，相信它将使自己繁荣。所谓的发达国家对全球化没有答案，因为他们没有超越意识形态和自身利益的界限。我们没有见到历史的终结，思想却反而走向了终结。我们必须更深入、更具体地去反思社会、文化和经济，问问自己我们是什么，我们能成为什么？ 革新必须从知识和思想开始。对经济学家来说，这意味着要提高对经济学本质和局限性的认识，经济学从业者要更加谦逊，并停止夸大科学客观性的主张。特别是理性主义者想把经济学变成一门无关价值的学科的想法是徒劳的，把经济学从政治学、社会学和伦理学中分离出来的工程即使在理论上也不可能成功。经济学的理论化是非常重要的，但有效的应用经济学也是非常重要的，经济学应当利用模型进行洞察、教育和交流，而不是为了显摆。在斯密的时代，规章制度主要是为了保护内部人的利益而存在的，因此自由化往往有利于更广大的人民群众。今天，事情变得更加微妙。无论如何，一旦承认信息不完善、人的理性有限、偏好形成和交易成本等现实，我们自认为的自由市场的大部分好处就失去了核心的经济理论依据。这种承认必须置于一个更广泛的政治经济学概念之中，这个概念能够更好地把握裙带资本主义的现实，弥补单纯“市场失灵”的解释性的不足，并把握住人类生活中的不确定性和动态互动的核心事实，把握其他学科的相关性以及规范、价值观、认同和信任在经济解释之内及其之外的重要性。关于市场的讨论必须被不断强调，但必须根据具体情况和市场自身的条件去做具体考虑。 此外，还必须秉持真正的斯密精神进行社会革新。这意味着那些行使权力的人要有一定程度的谦逊，更广泛地接受成功往往取决于你的起点—你的家庭、文化和能力，以及你的运气。这意味着有权力的人要认识到，几乎所有类型的成就都离不开他人的努力和社会的力量，成就不仅仅是在一个适者生存的狗咬狗的斗争中获得的。这意味着需要斯密式的对人的尊严和能力的关注，关注一个运作良好的社会如何帮助其成员在生活中蓬勃发展。这也涉及一个共同的认知，即每个社会都有一个空间，它在可衡量的或主要由法律管辖的范围之外，那就是由文化价值、当前的实践和习惯、合理的社会期望以及行为规范构成的空间，也就是关于什么“可做”和什么“不可做”的空间。它并不总是良性的，因为在一个社会中，关于什么“可做”和什么“不可做”的认知也可以为压制和歧视提供空间。这种空间在今天受到了威胁，主要是来自商业价值的威胁：花钱升级你的牢房，或者让人替你排队参加公共活动，为什么不呢？但一个好的社会会想方设法捍卫这个规范的空间。没有它，一切就只有基于法律和市场，而这两者远远不够。有了这一规范空间，可以带来更大的社会信任，也有可能巩固制约裙带资本主义的制度和公共标准。 最后，必须进行政治革新。实际上，斯密的思想对左派和右派的极端分子都提出了挑战：放弃极端的愿望，重新建立政治的中间地带，再次参与到改革资本主义，维护和发展商业社会利益的现实的、复杂的、混乱的问题中去。 亚当·斯密本人不属于任何政党，他也不是任何一种意识形态或政治运动的私产。他的许多政治观点仍然晦涩难懂。在18世纪，他将苏格兰启蒙运动对个人进步的信念与辉格党对社会进步的普遍赞同结合起来。但斯密并不是激进派：他没有采纳当时重要的激进政策，如普遍的男性选举权或年度议会，他在民兵、美国殖民地和公共债务等问题上也避免采取激进立场。他拒绝乌托邦思想和来自任何所谓自然状态的解释；他更喜欢本土化而非全球化；他鄙视政治和宗教中的“派系和狂热”，并痛斥那些试图控制他人、压制个性和自由的“体制人”。斯密一再强调“缓慢而渐进”的变革的重要性，以及改革而非革命的重要性；他更多地从实际案例而非基本原则出发进行推理。他对国家的重要性和弱点实事求是。正如他所写的那样，“没有一个政府是十全十美的，但忍受它带来的一些不便，总比反对它要好”。用现代术语来说，他既不是自由主义者，也不是社会主义者，也不是社会民主党人，他很可能是一个温和的保守党同情者。事实上，可以理解为，斯密和伯克，既有不同之处又有相同之处，他们一起勾勒出了一种人道的、温和的保守主义。 重新强调政治和政治经济的重要性，并不是要把我们的事务交给一群苏维埃式的委员。组织经济有许多种有效方法，关键问题是你重视什么，你希望如何达到目的，谁来领导，这些都是政治问题。旧有的确定性已经结束，各派政治家的任务是，承认这些问题的复杂性，并在公开场合尽可能清晰简单地处理、解释和引导这些问题。现代国家不仅有能力破坏市场，在某些情况下也有能力通过谨慎的干预来改善市场的运作。市场本身的作用和影响几乎总是超出严格的经济范围，因此，市场永远不可能成为一种纯粹的商品和服务分配手段，完全在政治上和道德上中立。同时，市场的日益复杂化往往给内部人士提供了更多机会来欺骗外部人士，并且在实践中和原则上对那些试图指导或限制它们的人也提出了艰巨的要求。我们所处的商业社会，不仅要应对下个世纪的惊人挑战，还要应对它目前所依赖的自由主义和个人主义，同时还要保留足够的公共领域，容许体面的相互尊重的辩论，保证人类的互相交易能够蓬勃发展。我们必须迎接这些挑战，否则我们的开放社会将会落入自我消耗中。 斯密有时对政客提出了严厉的批评，他把贸易报复和其他短期的权宜之计归咎于“那种阴险狡猾的动物，俗称政治家或政客，他们的议会总是被一时的事务波动所左右”。但他的“人的科学”也是关于政治家或立法者的科学，“他们的讨论应该受一般原则的支配，而这些原则总是相同的”。这样的立法者将具备公民意识，对公共服务而非私人利益负责，这使他们能够为失败负责，并付出个人代价。他们将重视法律、制度和政策，尊重个人自由，最重要的是执行正义，因为能被恰当定义、管理和执行的正义是商业社会的合法性基石。最后，最重要的不是获得回报或地位，而是那些正义、诚信、互惠、公平的规范本身，是规范内化后形成的道德品格和美德，以及由它们支持的公共机构和公共服务的惯例。对斯密和伯克来说，政治家应该是一个“实践中的哲学家”。 像伯克一样，亚当·斯密本质上是一个哲学家，但他相比伯克更偏重理论。他相信天意的运作，相信和谐，相信秩序。但对他来说，人类社会才是我们道德生活的根本源泉，而不是神的启示、理性的直觉或个人意志。他整体强调的是沟通和共同体，强调自由人之间的共同点。在他的伟大研究事业中，即休谟主义的“人的科学”以及相互认可，是通过同情心起作用，并由公正的旁观者进行调和，而后产生了大大小小的社会和道德规范，这些规范不断地发展和增殖，兴起和衰落，相互取代或存续。通过这种方式，斯密打开了一扇大门，使人们能够对广泛的、辉煌而多样化的人类活动形成一种可能的统一理解。这些规范以自由交换为前提，在商业社会中，这些规范对我们所有人的基本要求是相同的，无论我们身在何处，无论我们是谁，都应当理解他人、有礼、心态开放、体谅、容忍和尊重。在斯密的一生中，他一次又一次地运用这套核心思想，并逐渐将其完善：从早期的论文和修辞学著作，到《道德情操论》和从未发表的、鲜为人知但至关重要的《法理学讲义》，再到《国富论》。也就是说，斯密探索了沟通本身的基础，道德心理学的基础，对科学探究的追求，再到司法行政、市场交换；如果给他更多的时间，他可能还会继续研究艺术创作和政治活动。这一切都蕴含着一种动态的、面向未来的、不断展现的人类的可能性。 这是一项巨大的成就，但他提出的很多恰当的措施至今仍未被采纳。今天，在一个充满不确定性、极端主义和误解的世界里，我们比以往任何时候都更需要亚当·斯密，以及将他的思想贯彻到底的智慧。","link":"/2021/06/05/Adam-Smith/"},{"title":"What Money Cannot Buy: The Moral Limits of Markets","text":"有一些东西是金钱买不到的，但是现如今，这样的东西却不多了。今天，几乎每样东西都在待价而沽。下面便是其中几个例子： 牢房升级：每晚82美元。在加利福尼亚的圣安娜和其他一些城市，非暴力罪犯可以用钱来买到更好的住宿条件：一间与不出钱的罪犯的牢房分离开来、又干净又安静的监狱牢房。 独自驾车时可以使用“多人共用车专用车道”（car pool lane）：高峰时段8美元。明尼阿波利斯和其他城市正在尝试这项举措，独自驾车的司机可花钱在多人共用车专用车道上行驶，来缓解交通阻塞的现象，价格则随着交通状况的不同而改变。 印度妈妈的代孕服务：每位6250美元。西方国家那些寻求代孕的夫妇们越来越多地将代孕之事外包给印度妇女，因为代孕在那里是合法的，而且价格也不足美国现行价格的1/3。 移民到美国的权利：50万美元。投资50万美元并且在高失业领域至少创造10个就业机会的外国人，就有资格获得美国绿卡并拥有永久居住权。 狩猎濒危黑犀牛的权利：每头15万美元。南非开始允许农场主把射杀有限数量犀牛的权利出售给狩猎者，以此激励农场主去饲养和保护各类濒危物种。 医生的手机号码：每年至少1500美元。越来越多的“礼宾”医生为那些愿意支付1500~25000美元年费的病人，提供手机咨询服务和当日预约就诊的机会。 向大气层排放碳的权利：每吨13欧元（约合18美元）。欧盟构建了一个碳排放交易市场，从而使得一些公司可以买卖排放权。 著名大学的录取名额：什么价格？尽管这方面的价格没有公示，但是美国一些顶尖学府的行政人员曾告诉《华尔街日报》，他们的学校录取了一些并不十分优秀的学生，其原因是这些学生的父母很富有，并有可能给学校捐赠一笔可观的钱。 并非每个人都有能力购买上面列出的这些东西，但是现今却有很多可以赚钱的新路子。如果你需要多挣一些钱，那么下面就是一些新的可能性： 出租你的前额（或者你身体的其他部位）用来放置商业广告：777美元。新西兰航空公司雇用了30个人，把他们的头发剃光并印上写着“需要做出改变吗？请来新西兰”广告语的临时刺青。 在制药公司的药品安全实验环节中担当人工试验对象：7500美元。这项报酬可以更高，也可以更低，这取决于用来检测药品效用的试验程序对试验对象的侵害程度以及所引发的痛苦。 为私人军事公司去索马里或阿富汗打仗：每天250美元至每天1000美元不等。这项报酬根据人员的资质、经历和国籍的不同而不同。 在国会山为1位想要参加国会某场听证会的游说者通宵排队：每小时15~20美元。游说者们付钱给“排队公司”，而这些公司又雇用流浪汉和其他人去排队。 如果你是达拉斯一所一般学校的后进生，那么你每读一本书，就可以得到2美元。为了鼓励读书，孩子们每读一本书，这些学校就会奖励给他们一点钱。 如果你是个胖子，那么你在4个月内减掉14磅就可以得到378美元。一些公司和健康保险公司为减肥和其他各种健康活动提供金钱激励措施。 为一位病人或老人购买一张人寿保险单，在其有生之年为其支付年度保险费，然后在他/她去世时可获得死亡收益，其价值可达数百万美元（具体收益取决于保险单中的规定）。这种在陌生人的生命上下赌注的做法，已然成就了一个300亿美元的产业。陌生人死得越快，投资者赚的钱也就越多。 我们生活在一个几乎所有的东西都可以拿来买卖的时代。在过去的30年里，市场和市场价值观渐渐地以一种前所未有的方式主宰了我们的生活。但是需要强调的是，我们深陷此种境地，并不是我们审慎选择的结果，它几乎像是突然降临到我们身上似的。 伴随着“冷战”的结束，市场和市场观念得到了无与伦比的声誉，这是可以理解的。事实证明，在增进富裕和繁荣方面，任何其他组织商品生产和分配的机制都不曾取得过如此的成功。然而，正当世界上越来越多的国家在运作经济方面拥抱市场机制的时候，其他的事情也正在发生。市场价值观在社会生活中渐渐扮演着越来越重要的角色。经济学也正在成为一个帝国领域。今天，买卖的逻辑不再只适用于各种商品，而是越来越主宰着我们的整个生活。现在，到了我们追问自己是否想要过这种生活的时候了。 市场必胜论的时代2008年金融危机爆发前的那些年里，是一个信奉市场和放松监管的疯狂年代，亦即一个市场必胜论的时代（an era of market triumphalism）。这个时代始于20世纪80年代早期，当时罗纳德·里根和玛格丽特·撒切尔表达了他们的坚定信念，即市场而非政府掌管着通往繁荣和自由的钥匙。这种情况在比尔·克林顿和托尼·布莱尔的亲市场自由主义的支持下，一直延续到了20世纪90年代；他们两人虽说调和但却更加巩固了这样一种信念，即市场是实现公共善（public good）的首要途径。 如今，这种信念遭到了质疑，而且市场必胜论的时代也已趋于终结。金融危机不只是引发了人们对市场有效分配风险能力的质疑，而且还促使人们产生了这样一种广泛的认识，即市场已远离道德规范，因而我们需要用某种方式来重建市场与道德规范之间的联系。但是，这究竟意味着什么或者我们应当如何重建市场与道德规范之间的联系这两点，却并非显而易见。 一些人认为，市场必胜论在道德上的核心缺陷乃是贪婪，因为贪婪致使人们进行不负责任的冒险。根据这种观点，解决这个问题的方案便是遏制贪婪，让银行家和华尔街的高管们坚守更大的诚信和责任，并且制定各种合理的规章制度以防范类似的危机再次发生。 这种观点至多是一种片面的分析。贪婪在金融危机中扮演着重要角色，这一点肯定没错，但是另一件更重大的事情却更具危险性。过去30年所展示的最致命的变化并不是贪婪的疯涨，而是市场和市场价值观侵入了它们本不属于的那些生活领域。 与这种境况作抗争，我们不仅需要抨击贪婪，而且还需要重新思考市场在我们的社会中所应当扮演的角色。关于使市场处于其所当之处究竟意味着什么这一点，我们需要用公共辩论的方式予以讨论。为了进行这种辩论，我们需要认真考虑市场的一些道德界限，而且还需要追问是否存在一些金钱不应当购买的东西。 市场和市场导向的观念向传统上由非市场规范所统辖的生活领域的入侵，乃是我们这个时代最重大的发展之一。 让我们想一想下面的各种情形： 营利性的学校、医院和监狱不断增多，以及将战争外包给私人军事承包商。（在伊拉克和阿富汗，私人军事承包商的雇佣军在数量上实际超过了美国军队。） 公共警力远比私人保安公司逊色——尤其在美国和英国，私人保安的数量是警察的两倍之多。 制药公司向富裕国家的消费者强力兜售处方药。（如果你曾看过美国晚间新闻里播出的电视广告，那么你会产生如下的想法便是可以理解的：世界上最大的健康危机不是疟疾、盘尾丝虫病或者失眠，而是大肆流行的勃起功能障碍症。） 商业广告大肆进入公立学校，出售公园和公共空间的“冠名权”，营销为辅助生殖而“专门设计”的卵子和精子，把怀孕事宜外包给发展中国家的代孕妈妈，公司和国家竞相买卖排放权，以及一种近乎于准许买卖选票的贿选财政制度。 这些用市场来配置健康、教育、公共安全、国家安保、犯罪审判、环境保护、娱乐、生育以及其他社会物品的做法，在30年前大多都是闻所未闻的。然而在今天，我们却多半视其为理所当然。 一切都待价而沽这里有两个原因：一个关乎不平等，另一个关乎腐败。让我们先来看看不平等。在一个一切都可以买卖的社会里，一般收入者的生活会变得更加艰难。金钱能买到的东西越多，富足（或贫困）与否也就越发重要。 如果富足的唯一优势就是有能力购买游艇、跑车和欢度梦幻假期，那么收入和财富的不平等也就并非很重要了。但是，随着金钱最终可以买到的东西越来越多（政治影响力、良好的医疗保健、在一个安全的邻里环境中而非犯罪猖獗的地区安家、进入精英学校而非三流学校读书），收入和财富分配的重要性也就越发凸显出来。在所有好的东西都可以买卖的地方，有钱与否在世界各地都是至关重要的。 这也就解释了为什么贫困家庭和中产阶级家庭的生活在过去几十年中异常艰难的原因。不仅贫富差距拉大了，而且一切事物的商品化通过使金钱变得越发重要，而使得不平等的矛盾也变得更加尖锐了。 我们不应当把一切事务都作价待沽的第二个原因，则比较难阐述清楚。它所关注的不是不平等和公平的问题，而是市场所具有的那种侵蚀倾向。对生活中的各种好东西进行明码标价，将会腐蚀它们。那是因为市场不仅在分配商品，而且还在表达和传播人们针对所交易的商品的某些态度。如果孩子好好读书就给他们零钱，有可能使他们读更多的书，但同时也教会了他们把读书视作一份挣钱的零活而非一种内在满足的源泉。将大学新生名额拍卖给出价最高的投标者，有可能会增加学校的财务收入，但同时也损害了该大学的诚信及其颁发的学位的价值。雇用外国雇佣军去为我们打仗，有可能会使本国公民少死一些人，但却侵蚀了公民的意义。 经济学家常常假设，市场是中性的，亦即市场不会影响其所交易的商品。但是，事实并非如此，因为市场留下了它们的印记。有时候，市场价值观还会把一些值得人们关切的非市场价值观排挤出去。 当然，人们在哪些价值观值得关切，以及为什么这些价值观值得关切的问题上存在分歧。所以，为了决定金钱应当以及不应当买什么，我们就必须首先决定，什么样的价值观应当主导社会生活和公民生活的各个领域。如何认真地思考这个问题，便是本书的主旨所在。 在这里，我想提前概述一下我想给出的答案：当我们决定某些物品可以买卖的时候，我们也就决定了（至少是隐晦地决定了），把这些物品视作商品（即谋利和使用的工具）是适当的。但并非所有的物品都适用于进行这样的评价。最明显的例子就是人。奴隶制之所以骇人听闻，是因为它将人视作可以在拍卖会上买卖的商品。这种做法无法以适当的方式对人作出评价——因为人应当得到尊严和尊重，而不能被视作创收的工具和使用的对象。 我们也可以用类似的方式来看待其他珍贵的物品和做法。我们不允许在市场上买卖儿童。即使购买者没有虐待其所购买的儿童，一个贩卖儿童的市场也会表达和传播一种错误的评价儿童的方式。儿童被视作消费品是不正当的，他们应当被视作值得关爱的人。或者，让我们再来考虑一下公民的权利和义务。如果你应召去履行陪审团的义务，那么你就不能雇用一个代理人去履行你的义务。同样，我们也不允许公民出售自己的选票，即使其他人有可能迫不及待地想购买它们。我们为什么不允许这样做呢？因为我们认为，公民义务不应当被视作私人财产，相反，它应当被视作公共责任。外包公民义务，就是在糟践它们，即在用一种错误的方式评价它们。 上述事例阐明了一个更为宽泛的论点：如果生活中的一些物品被转化为商品的话，那么它们就会被腐蚀或贬低。所以，为了决定市场所属之地以及市场应当与什么领域保持一定距离，我们就必须首先决定如何评价相关的物品——健康、教育、家庭生活、自然、艺术、公民义务等。这些都是道德问题和政治问题，而不只是经济问题。为了解决这些问题，我们必须对这些物品的道德意义以及评价它们的适当方式逐一展开辩论。 这是一种我们在市场必胜论的时代未曾开展过的辩论。由于我们没有深切地意识到要开展这种辩论，也就是由于我们从未决定要开展这种辩论，所以我们从“拥有一种市场经济”（having a market economy）最终滑入了“一个市场社会”（being a market society）。 这里的区别在于：市场经济是组织生产活动的一种工具——一种有价值且高效的工具。市场社会是一种生活方式，其间，市场价值观渗透到了人类活动的各个方面。市场社会是一个社会关系按照市场规律加以改变的社会。 当代政治学严重缺失的就是关于市场角色和范围的辩论。我们想要市场经济吗？或者说，我们想要一个市场社会吗？市场应当在公共生活和私人关系中扮演怎样的角色呢？我们如何能够决定哪些物品应当可以买卖，以及哪些物品应当受非市场观念的支配？“金钱律令”（money’s writ）不应当在哪些领域有效？ 这些都是本书所试图回答的问题。由于它们涉及有关良善社会和良善生活的各种相互冲突的理想，所以我无法承诺给出终极性的答案。但是我至少希望，我的这一努力可以推动人们对这些问题展开公共讨论，并为人们认真思考这些问题提供一个哲学框架。 重新思考市场的角色即便你赞同我们需要抓住这些有关“市场之道德”的大问题，你仍可能会怀疑我们的公共话语是否能够胜任这项任务。这个担忧合情合理。任何重新思考市场角色和范围的尝试，都应当首先承认下面两个令人深感棘手的障碍。 一个是市场观念所具有的经久不衰的力量和威望，即便是在80年来市场失败最惨痛的后果面前亦复如此。另一个是我们公共话语中的怨怼和空泛。这两种情况并不是完全不相关的。 第一个障碍很令人困惑。当时，2008年金融危机被普遍认为是对此前不加批判地拥抱市场的做法（这种做法跨越政治范围盛行了30年）所作的一个道德裁定。曾经无所不能的华尔街金融财团的几近崩盘以及对大量紧急援助的需求（以纳税人的利益为代价），看似毫无疑问地引发了人们对市场的重新思考。艾伦·格林斯潘作为美联储的主席，曾长期扮演市场必胜论信念的高级传教士；即便像他这样的人后来也以“一种令人震惊的怀疑态度”承认说，他对市场自我纠错力量的信心被证明是错误的。《经济学人》杂志是一份积极推广市场信念的英国杂志，它当时一期的封面上是一本正在溶解成泡沫的经济学教科书，标题则是“经济学到底出了什么问题”。 市场必胜论的时代最终走向了毁灭。其后想必是一个道德清算的时代，亦即一个重新追问市场信念的时代。然而，事实却证明，社会并没有朝那个方向发展。 金融市场的惨烈失败并没有从整体上动摇人们对市场的信心。其实，相对于银行来说，这场金融危机所破坏的更多的是政府的声誉。2011年，多项调查表明，在美国所面临的诸多经济问题上，美国公众所谴责的更多的是联邦政府而非华尔街的各大金融机构——其比率要高于2∶1。 这场金融危机将美国和全球经济都抛进了继1929年大萧条之后最糟糕的经济衰退之中，并且让成千上万的人丢掉了工作。然而即便这样，它也没有使人们从根本上对市场问题进行反思。相反，它在美国所导致的最显著的政治后果却是茶党运动的兴起，然而茶党运动对政府的敌意以及对自由市场的狂热，甚至都会使当年的罗纳德·里根深感汗颜。2011年秋天，“占领华尔街运动”使得抗议者们在美国各大城市和世界各大城市频频集会。这些抗议者们把他们的矛头直指大银行和大公司的权力以及日益加剧的收入和财富不平等现象。尽管茶党与占领华尔街的激进主义分子在意识形态导向上存在差异，但是他们都是在对政府采取紧急援助措施方面表达一种民粹式的愤慨。 除了这类抗议声音外，关于市场角色和范围的严肃辩论在我们的政治生活中仍严重缺席。民主党人和共和党人，如其长期以来所做的那样，仍在对税收、政府支出和预算赤字等问题争论不休，只是现在的争论更多了一点党派色彩、更少了一些鼓舞或说服力而已。由于政治体制没有能力代理公共善，或者说，没有能力解决最为重要的问题，所以公民对这种政治体制越来越感到灰心，同时对政治的理想也日渐幻灭。 公共话语的这般窘况乃是开展关于市场道德局限之辩论的第二大障碍。在一个政治争辩主要由有线电视上的吵架比赛、广播讨论节目里党派性极强的谩骂和国会中意识形态性的扔食品大战所组成的时代里，很难想象人们会把一种关于这类颇具争议的道德问题的理性公共辩论视作评价生育、儿童、教育、健康、环境、公民资格以及其他物品的正确途径。但是我相信，这样的辩论是可能的，而且还会促使我们的公共生活焕发生机。 一些人认为我们所怨怼的政治生活中有着太多的道德信念：太多的人太过深切、太过固执地信奉着他们自己的信念，而且还想把这些信念强加给所有其他人。我认为，这种看法误读了我们的窘境。我们政治的问题并不是有太多的道德争辩，而恰恰是争辩得太少。我们的政治之所以过于激烈，实在是因为它在很大程度上是空洞的，亦即缺少了道德和精神的内涵，而且也未能关注人们所关切的那些重大问题。 当代政治的道德缺失有很多原因。其中之一就是试图将“良善生活”的观念从我们的公共话语中排挤出去。为了避免派系纷争，我们往往坚持认为，当公民进入公共场所的时候，他们应当将他们的道德信念和精神信念抛在脑后。尽管这种观点的意图是好的，但是不想把良善生活的争论纳入政治的做法却为市场必胜论和坚持信奉市场逻辑的做法扫清了道路。 当然，市场逻辑也以其自身的方式把道德辩论从公共生活中排挤出去。市场的部分吸引力就在于它们并不对其所满足的偏好进行道德判断。市场并不追问一些评价物品的方式是否比其他方式更高尚或者更恰当。如果某人愿意花一笔钱来满足自己的性欲或者购买一个肾脏，而另一个同意此桩买卖的成年人也愿意出售，那么经济学家问的唯一问题就是“多少钱”。市场不会指责这种做法，而且它们也不会对高尚的偏好与卑鄙的偏好加以区别。交易各方都会自己确定所交易的东西具有多大价值。 这种对价值不加道德判断的立场处于市场逻辑的核心地位，而且也在很大程度上解释了它为什么具有吸引力。但是我们不愿进行道德和精神争论，加之我们对市场的膜拜，已经使我们付出了高昂的代价：它逐渐抽空了公共话语的道德含义和公民力量，并且推动了技术官僚政治（亦即管控政治）的盛行，而这种政治正在戕害着当下的很多社会。 对市场道德局限性展开辩论，会使我们（作为一个社会）有能力确定市场服务于公共善的领域以及市场不归属的领域。展开这种辩论还会经由允许各种彼此冲突的良善生活观念进入公共场所而使我们的政治具有生机。再者，这些辩论又将如何展开呢？如果你认为买卖某些物品会腐蚀或贬低它们，那么你肯定会相信一些评价这些物品的方式要比其他方式更加适宜。腐蚀某种行为（例如父母身份或公民资格）的说法很难讲得通，除非你认为某些为人父母或者做一个公民的方式要比其他的方式更好。 与此类似的道德判断，构成了我们对市场进行若干限制的理由。我们不允许父母贩卖他们的子女，或者不允许公民出售自己的选票。我们不允许这样做的原因之一，坦率地讲，就是道德判断。因为我们相信，售卖这些东西乃是在用一种错误的方式评价他们/它们，而且还会形成不好的态度。 认真思考市场的道德局限性，使我们无法回避这些问题。它要求我们在公共领域中一起来思考如何评价我们所珍视的社会善品。认为一种更具有道德意义的公共讨论（甚至在最好的情况下）会使人们对每个有争议的问题都达成共识，那是愚蠢的。但是这种讨论将有助于形成一种更健康的公共生活。同时，它也会使我们更加明白，生活在一个一切都待价而沽的社会里我们要付出的代价。 当我们考虑市场道德问题的时候，我们首先会想到华尔街的各大银行及其不计后果的行径，也会想到对冲基金、紧急援助和政府调控改革。但是，我们在今天所面临的道德挑战和政治挑战，却有着更为普遍和更为平常的性质——也就是要重新思考市场在我们的社会实践、人际关系和日常生活中的角色和范围。","link":"/2021/06/05/What-Money-Cannot-Buy-The-Moral-Limits-of-Markets/"}],"tags":[{"name":"microservices","slug":"microservices","link":"/tags/microservices/"},{"name":"MEDIUM","slug":"MEDIUM","link":"/tags/MEDIUM/"},{"name":"marketing","slug":"marketing","link":"/tags/marketing/"},{"name":"fashion","slug":"fashion","link":"/tags/fashion/"},{"name":"blockchain","slug":"blockchain","link":"/tags/blockchain/"},{"name":"Alice Munro","slug":"Alice-Munro","link":"/tags/Alice-Munro/"},{"name":"introduction","slug":"introduction","link":"/tags/introduction/"},{"name":"career","slug":"career","link":"/tags/career/"},{"name":"solution","slug":"solution","link":"/tags/solution/"},{"name":"VOGUE","slug":"VOGUE","link":"/tags/VOGUE/"},{"name":"climate change","slug":"climate-change","link":"/tags/climate-change/"},{"name":"perspective","slug":"perspective","link":"/tags/perspective/"},{"name":"business","slug":"business","link":"/tags/business/"},{"name":"architecture","slug":"architecture","link":"/tags/architecture/"},{"name":"films","slug":"films","link":"/tags/films/"},{"name":"philosophy","slug":"philosophy","link":"/tags/philosophy/"},{"name":"economics","slug":"economics","link":"/tags/economics/"},{"name":"Georges Bataille","slug":"Georges-Bataille","link":"/tags/Georges-Bataille/"},{"name":"poem","slug":"poem","link":"/tags/poem/"},{"name":"blue","slug":"blue","link":"/tags/blue/"},{"name":"Paul Auster","slug":"Paul-Auster","link":"/tags/Paul-Auster/"},{"name":"novel","slug":"novel","link":"/tags/novel/"},{"name":"Ken Follett","slug":"Ken-Follett","link":"/tags/Ken-Follett/"},{"name":"linux","slug":"linux","link":"/tags/linux/"},{"name":"mediocre planet","slug":"mediocre-planet","link":"/tags/mediocre-planet/"},{"name":"bookmarks","slug":"bookmarks","link":"/tags/bookmarks/"},{"name":"short story","slug":"short-story","link":"/tags/short-story/"},{"name":"Too Much Happiness","slug":"Too-Much-Happiness","link":"/tags/Too-Much-Happiness/"},{"name":"art","slug":"art","link":"/tags/art/"},{"name":"detective fiction","slug":"detective-fiction","link":"/tags/detective-fiction/"},{"name":"politics","slug":"politics","link":"/tags/politics/"},{"name":"Michael Sandel","slug":"Michael-Sandel","link":"/tags/Michael-Sandel/"}],"categories":[{"name":"Techo","slug":"Techo","link":"/categories/Techo/"},{"name":"Clouds&#39; silver linings","slug":"Clouds-silver-linings","link":"/categories/Clouds-silver-linings/"},{"name":"Happy little capsules","slug":"Happy-little-capsules","link":"/categories/Happy-little-capsules/"},{"name":"Reverso","slug":"Reverso","link":"/categories/Reverso/"},{"name":"Freaking fabulous","slug":"Freaking-fabulous","link":"/categories/Freaking-fabulous/"},{"name":"Chasing the sunset","slug":"Chasing-the-sunset","link":"/categories/Chasing-the-sunset/"}]}