{"pages":[{"title":"About ME","text":"Techo Psycho Alcohol","link":"/about/index.html"},{"title":"tags","text":"","link":"/tags/index.html"},{"title":"categories","text":"","link":"/categories/index.html"}],"posts":[{"title":"Answers By Alice Munro","text":"你认为最完美的快乐是怎样的？ 星期天下午，我们喜欢长途散步，从我家后面开始，沿着铁路线走。我们会走到瓦瓦那什河湾栈桥，然后返回。我们谈论安乐死、遗传控制群体、是否有灵魂、宇宙是否最终是可知的。我们没有达成任何一致的看法。开始我们在秋天散步，接着是冬天。在暴风雪中，低着头争辩，手插在口袋里，细腻刺骨的雪打在我们脸上。争辩累了，我们会把手拿出来，伸开双臂保持平衡，试图在铁轨上走。 《女孩和女人们的生活》 你最希望拥有哪种才华？ 即便困难重重，生病、穷困、丑陋，你依然能珍惜你的灵魂，就像用盘子端着一枚珍宝走过人生。 《爱的进程》 你最恐惧的是什么？ 恨始终是一种罪过。你灵魂里的一滴仇恨，会扩散开来毁掉所有的色彩，就像白牛奶里的一滴黑墨水。 你最喜欢的消遣是什么？ 我的生活早已发生了疯狂的转变，我每天为之悔恨的事情同时也是我的骄傲。我感觉自己已经以全新的面貌重生于世。坐在桌边，双手捧着一杯咖啡或者红汤，直到它几乎没有一丝热气，就这么待上一小时。我漫无目的地读书，读那些早就想读的书里的散句。这些句子总是令我满足，它们是如此优美独特，总是让我陷入一种特别的状态，全然忘却了其他的词句。我恍惚而又警觉，与所有人隔绝却随时觉察着这城市本身——它似乎是个奇怪的地方。 《公开的秘密》 你认为程度最浅的痛苦是什么？ 嗯，这真是奇怪。想象之中，每当你支持什么的时候，总是会声音洪亮，而周围的人被你惊醒，感到羞愧不安。但，在真实生活里，他们却都笑得别有意味。你立刻就会明白，你所做的一切，不过是让自己变成大家下次一起喝咖啡时的笑料。 《快乐影子之舞》 你认为哪种美德是被过高地评估的？ 你真可怕，你知道。你像天使们一样可怕。你以为所有人都朝前走，像你一样勇敢阳光——哦，请别看我，亲爱的。不要看我——或许我不是你希望的样子，可你能感觉到我就在这里呀，对吗？ 《好女人的爱情》 你最喜欢男性身上的什么特质？ 生活的要义，哈里告诉劳莲，就是满怀兴趣地活在这个世界上。睁大你的眼睛，要从你所遇到的每一个人的身上看到各种可能性——看到他的人性。要时刻注意。 《逃离》 你最喜欢女性身上的什么品质？ 她知道在酒吧里苦苦等待一个再也不会出现的男人的那种滋味。等待来信，当众痛哭，也曾被不再爱的人纠缠。不过，她仍然觉得情事萌发的第一个信号如此美妙，仿佛是阳光照在皮肤上的温暖，是门廊里轻轻传来的音乐，或者像她经常说的那样，像是黑白电视广告忽然变成了彩色的。她不觉得这是在浪费时间，也不觉得曾经浪费过时间。 《公开的秘密》 你最厌恶什么？ 当人们告诉你有时候你要去面对，当他们催促你面对摆在你面前的痛苦、猥亵、讨厌的事实时，在这接近背叛的边缘，他们的声音里总是掩饰不住那种冷酷的庆幸意味，以及对伤害你的贪婪渴望。 《女孩和女人们的生活》 你自己的哪个特点让你最觉得痛恨？ 认识我自己，我认识的是我的邪恶。这是我隐秘的慰藉。我了解我最坏的地方。它也许比别人最坏的地方更坏。但我不在乎。用不着什么借口。我获得了平静。我是个恶魔吗？世界是这么说的，它既然这么说了，那么我就同意好了。不过，这世界对我没有任何意义。我就是我自己，也不会有机会成为别人。我说，我疯了，但疯了又是什么意思？精神不正常，精神正常，我只是我而已。那时候我改变不了自己，现在我也改变不了自己。 《幸福过了头》 你的座右铭是什么？ 改变法律。改变人。可我们又不想所有事情——不要从头到尾都是——都听凭外界指使。我们不想我们的本质，我们的一切，都被那样调制出来。 《好女人的爱情》 你最伤痛的事是什么？ 她像是肺里什么地方扎进去了一根致命的针，浅一些呼吸时可以不感到疼。可是每当她需要深深吸进一口气时，她便能觉出那根针依然存在。她用什么来取代他的位置？那个逐渐逼近的未来世界的奇特之处与可怕之处，就在于她不能融入其间。 你最看重朋友的什么特点？ 吸引她的——实际上是迷惑住她的——是在前寒武纪岩石层峦叠嶂的遮蔽后所能寻见的那种极端冷漠、重复、漫不经心以及对和谐的轻蔑。 《逃离》 什么让你感觉到最快乐？ 很少人，非常非常少的人，才拥有宝藏，如果你真的拥有，那你就千万不要松手。你必须别让自己路遇拦劫，从自己身边把它丢失了。 你希望以什么样的方式死去？ 我就是这样心怀秘密，感觉茫然，内心却又充满了力量。 《快乐影子之舞》","link":"/2021/04/09/Answers-By-Alice-Munro/"},{"title":"Business Ladder","text":"Technical Writer IWorks closely with the Product Engineering team to incorporate new releases into our existing documentation.Has an ability to achieve clarity with conciseness and accessibility. Checks for cohesion in tone and style with existing documentation. Acts as a critical advisor for UI copy and names for things, referencing where we might have collisions in existing terms, and attempting to find the best explanation for users. Reads through our existing documentation and updates/corrects for legibility.Understands our writing style guide and adheres to it. Performs PR reviews for their peers with a focus on writing, style, and grammar.Communicates internally and externally in a respectful manner. Technical Writer IIStrong understanding of the product space and capabilities to inform high levels of accuracy in documentation. Helps our Product team establish harmony between written and visual communication in UI Copy. Accurately captures all relevant content and resources, establishing visibility for users. Understands our writing style guide and adds to/refines it. Performs PR reviews for their peers that considers flow and the audience, as well as the goals of the product. Listens to the priorities and concerns of others, and acknowledges differing perspectives. Anticipates others’ reactions. Thinks through and files issues for how to refine the docs site and UI. Reflects on user feedback and either categorizes it as won’t fix, or turns it into something actionable. Actively participates in meetings, and creates cross-team collaboration where necessary to address business goals. Senior Technical WriterAt this point, a person is mastering how effective they can be as an individual contributor. Acutely aware of our audience and defers voice and tone to meet the needs of the user. Considers overall information architecture both in writing and while reviewing. Thinks through what the user needs exactly at the point of learning to reduce cognitive overhead. Understands with depth what our organization and company OKRs are, and performs audits on their content to make sure we are achieving our goals. Has an understanding of the wider ecosystem of tools so that they know what context users may or may not be coming from. Ensures that there’s a clear path for a first-time user and understands how and when to weave in advanced material such as caveats and warnings. Understands with depth when and how users will perceive naming conventions, UI copy, and thinks through potential tradeoffs and benefits for different directions. Helps support the work of their peers both on the team and in the community at large, by engaging pairing sessions, reviewing, and providing mentoring. Gathers customer impressions of products and services and integrates this feedback into decision making. Adjusts well to shifting priorities when necessary. Demonstrates openness to others’ ideas. Adapts their communication style to most effectively communicate with the target audience. Effectively and accurately shares credit for ideas and collaborative efforts. Staff Technical WriterAt this point, the majority of one’s time is spent scaling their own skills to help others. Conducts competitive tear downs and illuminates new patterns and industry standards for information architecture, educating their peers and coworkers.Gives review feedback on PRs with a mind towards the growth of the individual they are reviewing, thinking through not just the content of the review, but how they can explain something to help guide the person in the future. Develops new plans and projects for our documentation, creating one-page proposals on how we might level up to better serve our users and/or business needs. Works on integrations or materials that aid in partnerships within the ecosystem. Attends support pairing prepared with ideas for improving the docs based on the customer feedback that’s been surfaced that week or well-formed questions to drive towards developing such ideas collaboratively. Helps shape support pairing to make it more efficient and effective. Notices recurring friction/confusion that impedes team success/efficiency and creates resources that clarify or solve these issues. Ensures the resources are easy to locate. Principal Technical WriterAt this point, one is helping others be the best that they can be, removing themselves and meeting others where they are. Develops proven systems and approaches to technical writing. Replicates those systems and approaches across the team so that others may learn from and improve on them. Mentors and actively drives the technical skills of the immediate or extended team. Anticipates issues or implications that their ideas would have on others, and pursues mutually beneficial strategies. Anticipates the needs of those around them. Is respectful in terms of async hygiene, exhibiting care that their teammates can get in touch with them or knows their status during working hours. Fills out process docs without having to be asked. Works to refine team processes to ensure everyone can be as productive as possible and build cohesion within the team. Considers team morale one of their initiatives- actively strives to support others, make sure their voices are heard, and illuminate others’ work.","link":"/2021/04/30/Business-Ladder/"},{"title":"CI&#x2F;CD","text":"Infrastructure ProblemBackgroundA development team has created a Java web app that is ready for a limited release (with reduced availability and reliability requirements). If the limited release is successful the app will be rolled out for worldwide use. Once fully public, the application needs to be available 24/7 and must provide sub-second response times and continuity through single-server failures. Basic problemYou need to create one environment for local Dev/QA, a better solution should also consider about CI/CD, further more, we’d also like to see your thoughts about how you do the HA, monitor, log etc. after the application is published to world. Assumptions You have free rein to incorporate any software tools and hardware you need to streamline application deployment and infrastructure provisioning &amp; configuration as long as they are Free/Libre/Open Source software (FLOSS). We request that you use Linux. The development team has a continuous integration build that produces two artifacts: 12a .zip file with the image and stylesheet used for the application.a .war file with the dynamic parts of the application. You should deploy the static assets to a web server and the .war file to a separate application server. Any compatible servers are acceptable. The app (companyNews) uses Prevayler for persistence. Prevayler essentially persists data to a file. The dev team chose this to simplify the development effort, rather than having to deal with an RDBMS. Expected output for this problemSimply put, we want you to design and create the local Dev/QA environment. You should use a virtualization/Container solution such as VirtualBox or Docker for these environments. We do not want you to deliver the VMs/Images to us, a detailed step by step instruction/document is not what we expect either. Instead you should provide scripts to enable us to build the environment very easily. The principle is automation as much as possible.","link":"/2021/04/11/CI-CD/"},{"title":"Elastic Search","text":"ELK “ELK”是三个开源项目的首字母缩写，分别是：Elasticsearch、Logstash 和 Kibana。 Elasticsearch 是一个分布式搜索和分析引擎,基于JSON开发而来，具有RESTful风格。 Logstash 是服务器端数据处理管道，能够同时从多个来源采集数据，转换数据，然后将数据发送到“存储库”中。 Kibana 是指可视化工具，可以让用户在 Elasticsearch 中使用图形和图表对数据进行可视化。 ELK Service","link":"/2021/04/14/Elastic-Search/"},{"title":"Flown","text":"They Are Not Natural","link":"/2021/04/06/Fabulous/"},{"title":"Gangster and Prisoner&#39;s Dilemma","text":"","link":"/2021/04/21/Gangster-and-Prisoners-Dilemma/"},{"title":"Hateful April","text":"A Voyage to LilliputGulliver’s TravelsIt would not be proper, for some reasons, to trouble the reader with the particulars of our adventures in those seas; let it suffice to inform him, that in our passage from thence to the East Indies, we were driven by a violent storm to the north-west of Van Diemen’s Land.(fn) Twelve of our crew were dead by immoderate labour and ill food; the rest were in a very weak condition. On the 5th of November, which was the beginning of summer in those parts, the weather being very hazy, the seamen spied a rock within half a cable’s length of the ship; but the wind was so strong, that we were driven directly upon it, and immediately split. Six of the crew, of whom I was one, having let down the boat into the sea, made a shift to get clear of the ship and the rock. We rowed, by my computation, about three leagues, till we were able to work no longer, being already spent with labour while we were in the ship. We therefore trusted ourselves to the mercy of the waves, and in about half an hour the boat was overset by a sudden flurry from the north. What became of my companions in the boat, as well as of those who escaped on the rock, or were left in the vessel, I cannot tell; but conclude they were all lost. For my own part, I swam as fortune directed me, and was pushed forward by wind and tide. I often let my legs drop, and could feel no bottom; but when I was almost gone, and able to struggle no longer, I found myself within my depth; and by this time the storm was much abated. The declivity was so small, that I walked near a mile before I got to the shore, which I conjectured was about eight o’clock in the evening. I then advanced forward near half a mile, but could not discover any sign of houses or inhabitants; at least I was in so weak a condition, that I did not observe them. I was extremely tired, and with that, and the heat of the weather, and about half a pint of brandy that I drank as I left the ship, I found myself much inclined to sleep. I lay down on the grass, which was very short and soft, where I slept sounder than ever I remembered to have done in my life, and, as I reckoned, about nine hours; for when I awaked, it was just day-light. I attempted to rise, but was not able to stir: for, as I happened to lie on my back, I found my arms and legs were strongly fastened on each side to the ground; and my hair, which was long and thick, tied down in the same manner. I likewise felt several slender ligatures across my body, from my arm-pits to my thighs. I could only look upwards; the sun began to grow hot, and the light offended my eyes. I heard a confused noise about me; but in the posture I lay, could see nothing except the sky. In a little time I felt something alive moving on my left leg, which advancing gently forward over my breast, came almost up to my chin; when, bending my eyes downwards as much as I could, I perceived it to be a human creature not six inches high, with a bow and arrow in his hands, and a quiver at his back. In the mean time, I felt at least forty more of the same kind (as I conjectured) following the first. I was in the utmost astonishment, and roared so loud, that they all ran back in a fright; and some of them, as I was afterwards told, were hurt with the falls they got by leaping from my sides upon the ground. However, they soon returned, and one of them, who ventured so far as to get a full sight of my face, lifting up his hands and eyes by way of admiration, cried out in a shrill but distinct voice, Hekinah degul: the others repeated the same words several times, but then I knew not what they meant. I lay all this while, as the reader may believe, in great uneasiness. At length, struggling to get loose, I had the fortune to break the strings, and wrench out the pegs that fastened my left arm to the ground; for, by lifting it up to my face, I discovered the methods they had taken to bind me, and at the same time with a violent pull, which gave me excessive pain, I a little loosened the strings that tied down my hair on the left side, so that I was just able to turn my head about two inches.","link":"/2021/04/01/Hateful-April/"},{"title":"Kerry Blues","text":"山 是山的影子 狗 懒得进化 夏天 人的酶很固执 灵魂的酶像荷花 背着手 在亚热带的酒馆 门前吹风 晚了就坐下 看柔和的闪电 背着城市 亚热带季风的河岸 淹没还不醉的桥 不醉的建筑 用静默解酒 明天 阴 摄氏三到十二度 修雨刷片 带伞 在戒酒的意识里 徒然下车 走路到天晴 照旧打开 身体的衣柜 水分子穿越纤维 命运布光的手 为我支起了四十二架风车 源源不断的自然 宇宙来自于平衡 附近的星球来自于回声 沼泽来自于地面的失眠 褶皱来自于海 冰来自于酒 通往岁月楼层的应急灯 通往我写诗的石缝 一定有人离开了会回来 腾空的竹篮装满爱 一定有某种破碎像泥土 某个谷底像手一样摊开 今天的太阳 像瘫痪的卡车 沉重地运走整个下午 白醋 春梦 野柚子 把回忆揣进手掌的血管里 手电的光透过掌背 仿佛看见跌入云端的海豚 所有的转折隐藏在密集的鸟群中 天空与海洋都无法察觉 怀着美梦却可以看见 摸索颠倒的一瞬间 所有的怀念隐藏在相似的日子里 心里的蜘蛛模仿人类张灯结彩 携带乐器的游民也无法表达 这对望的方式 接近古人 接近星空 冬天是十一月 十二月 一月 二月 三月 四月 当我的光曝在你身上 重逢就是一间暗室","link":"/2021/04/22/Kerry-Blues/"},{"title":"Mayday SALUTE","text":"","link":"/2021/05/01/Mayday-SALUTE/"},{"title":"「4 3 2 1 :a novel」","text":"","link":"/2021/04/11/Paul-Austers-4-3-2-1/"},{"title":"Shanghai&#39;s Midnight","text":"","link":"/2021/05/08/Shanghai-Midnight/"},{"title":"The Evening And The Morning","text":"『暗夜与黎明』Where Follett excels is in telling a yarn…you won’t be able to put it down. A Time of Conflict It is 997 CE, the end of the Dark Ages, and England faces attacks from the Welsh in the west and the Vikings in the east. Life is hard, and those with power wield it harshly, bending justice according to their will – often in conflict with the king. With his grip on the country fragile and with no clear rule of law, chaos and bloodshed reign. Three Lives Intertwined Into this uncertain world three people come to the fore: a young boatbuilder, who dreams of a better future when a devastating Viking raid shatters the life that he and the woman he loves hoped for; a Norman noblewoman, who follows her beloved husband across the sea to a new land only to find her life there shockingly different; and a capable monk at Shiring Abbey, who dreams of transforming his humble abbey into a centre of learning admired throughout Europe. The Dawn of A New Age Now, with England at the dawn of the Middle Ages, these three people will each come into dangerous conflict with a ruthless bishop, who will do anything to increase his wealth and power, in an epic tale of ambition and rivalry, death and birth, and love and hate.","link":"/2021/04/08/The-evening-and-the-morning/"},{"title":"UX Roadmap","text":"","link":"/2021/04/18/UX-roadtrip/"},{"title":"Write Like You Are Not Afraid","text":"","link":"/2021/04/09/Write-Like-You-Are-Not-Afraid/"},{"title":"关于消解和自洽","text":"记忆中的形象一旦被词语固定住，就会在现实中被抹掉。 「看不见的城市」 对于人生命题来说，自洽是一套解释逻辑，是个体的方法论; 透过不同的解答方式来探索最终答案。 然而最终答案真的存在吗？可能命题本身就是虚无，那么此题也无解。 转念一想，个体真的需要答案吗？或者他们只是需要一种解释方式。不要去预设有那么一个终极奥义，先验不一定真实存在的。 正视命题，用自己的解释方式去消解命题。即使一切都是虚无，都毫无意义，人生的一切随时可能被抹掉，但自己创造的虚无也是一种意义。自我消解本身就是专属于自我的意义，也即自洽。 所以不要去随意对待自己的人生命题，seize and solve it by yourself, and live every moment to the fullest.","link":"/2021/04/13/%E5%85%B3%E4%BA%8E%E6%B6%88%E8%A7%A3%E5%92%8C%E8%87%AA%E6%B4%BD/"},{"title":"「存在主义」咖啡馆","text":"「海德格尔在《存在于时间》中提及，日常存在，而非触不可及的宇宙论或者数学，才是最’本体论’的东西，实际的操劳与操心，比反思更为原始。有用性先于沉思，’当下上手状态’先于’现成在手状态’，’在世存在’和’于他人共在’先于’独自存在’。我们不是在纷繁复杂的世界上空盘旋，从上往下凝视，而是已经在这个世界上，并且参与其中——我们’被抛到’这里，而’被抛性’必是我们的起点」 过去的哲学家一直陷在一种意识的’消化‘模式中：他们认为，感知某物就是将其拉入我们自己的实体之中，像蜘蛛用它自己的唾液包裹住昆虫，将其半分解掉一样。相反，根据意向性，意识到某物，就是爆发出去—— 让自己从潮湿的胃中挣脱出来，从那里飞出来，超越自己，到达不是自己的所在。飞过那里，飞到树上，但是在树的外面，因为它让我感到迷惑、厌恶，我无法让自己沉醉于它，就像它也不能把自己溶解于我一样：外在于它，外在于我自己……而在同一过程中，意识得到了净化，变得像一阵风一样澄明。除了逃离自身的冲动，跑到自身之外的滑离，其中不再有任何东西。如果你能’进入‘一种意识（尽管不可能），那么你就会被一阵旋风卷起，然后被抛回到外面有树和灰尘的地方，因为意识没有’内在‘。它只是它自身的外表，正是这种绝对的逃离，这种对成为物质的拒绝，使它成为一种意识。 想象一下，现在一系列连锁的爆发，让我们挣脱了我们自己，甚至都不留一点时间，让我们在这些爆发之后形成’我们自己‘，而是直接把我们扔出去，扔进世界干燥的尘埃中，扔在粗糙的地面上，扔在事物之间。想象一下，我们以这种方式被抛出，被我们的本性抛弃在了一个冷漠、敌对、抵抗的世界里。如果你这样做的话，就能明白胡塞尔在那句著名的话中表达的发现所具有的深刻含义了「所有的意识都是从属于某物的意识」。 对于萨特来说，如果我们试图把自己关进我们的心灵之内，关进’一间百叶窗紧闭、漂亮温暖的房间里‘，那我们就会停止存在。我们没有舒适的家：到尘土飞扬的马路上，正是我们是什么的定义。","link":"/2021/04/20/%E5%AD%98%E5%9C%A8%E4%B8%BB%E4%B9%89%E5%92%96%E5%95%A1%E9%A6%86/"},{"title":"建筑学的治愈论","text":"Irwin Union Bank One of the simplest and most sublime structure to have been built in U.S. 米勒之家 The Miller House and Garden，埃罗·萨里宁 Eero Saarinen，1957. 巴塞洛缪县公共图书馆 Bartholomew County Public Library，贝聿铭 I.M.Pei，1969. 第一基督教教堂 First Christian Church，伊利尔·沙里宁 Eliel Saarinen，1942. 罗伯特·斯图尔特大桥 The Robert N. Stewart Bridge，J·穆勒 J. Muller，1999. https://www.columbus.in.gov/engineering/about/about-the-bridge/ 第一金融银行（原欧文联合银行） First Financial Bank，德博拉·伯克 Deborah Berke，2006. 欧文花园旅馆 The Inn at Irwin Gardens, 亨利·菲利普斯 Henry A. Phillips，1910. https://columbus.in.us/inn-at-irwin-gardens/ 欧文会议中心 Irwin Conference Center，埃罗·沙里宁 Eero Saarinen，1950. Republic Newspaper Building，迈伦•戈德史密斯 Myron Goldsmith，1971.http://www.som.com/china/projects/the_republic__newspaper_plant__offices 哥伦布心理健康卫生局 Columbus Regional Health Mental Health Unit，詹姆斯·波尔舍克 James Stewart Polshek 石灰岩柱退伍军人纪念馆 Limestone Pillars - Veterans Memorial 北区基督教堂 North Christian Church，埃罗·沙里宁 Eero Saarinen，1959. 新布朗斯维尔廊桥 New Brownsville Covered Bridge，史蒂芬·朗 Stephen H. Long，1840. 哥伦布大会堂 Columbus City Hall，爱德华·巴塞特 Edward Charles Bassett，1981. Mill Race公园瞭望塔 Mill Race Park Observation Tower，斯坦利·塞托维茨 Stanley Saitowitz. http://www.saitowitz.com/","link":"/2021/04/26/%E5%BB%BA%E7%AD%91%E5%AD%A6%E7%9A%84%E6%B2%BB%E6%84%88%E8%AE%BA/"},{"title":"立夏 the start of summertime","text":"","link":"/2021/05/05/%E7%AB%8B%E5%A4%8F-start-of-summer/"},{"title":"About NFTs","text":"What is NFTNFT stands for non-fungible token.(即非同质化代币，一种架构在区块链上的加密货币) In economics, a fungible assert is something with units that can be readily interchanged, like money. NFTs are ‘one-of-a-kind’ asserts in the digital world that can be bought and sold like any other piece of property, but they have to tangible form of their own. The digital tokens can be thought of as certificates of ownership for virtual or physical asserts. With NFTs, Artwork can be ‘tokenized’ to create a digital certificate of ownership that can be bought and sold. PlatformsThe Platforms of NFT transactions are like SuperRare, Nifty Gateway, Foundation, MakersPlace, OpenSea, Rarible etc. As with crypto-currency, a record of who owns what is stored on a shared ledger known as the blockchain. NFTs can also contain smart contrasts that may give the artist, for example, a cut of any future sale of the token. Trending - DeFi (decentralized finance)Just kidding that: ‌Nowadays, technology makes money-laundrying much easier. I cannot believe you morons actually buy this shit. Artworks are like: The Weeknd ‘s new NFT song - The Source Flowers with Smiley Faces by Takashi Murakami McDo NFT Gucci NFT shoes","link":"/2021/04/12/%E8%81%8A%E8%81%8ANFT/"},{"title":"霓虹推理文学史","text":"","link":"/2021/04/28/%E9%9C%93%E8%99%B9%E6%8E%A8%E7%90%86%E6%96%87%E5%AD%A6%E5%8F%B2/"}],"tags":[{"name":"Alice Munro","slug":"Alice-Munro","link":"/tags/Alice-Munro/"},{"name":"career","slug":"career","link":"/tags/career/"},{"name":"solution","slug":"solution","link":"/tags/solution/"},{"name":"philosophy","slug":"philosophy","link":"/tags/philosophy/"},{"name":"poem","slug":"poem","link":"/tags/poem/"},{"name":"blue","slug":"blue","link":"/tags/blue/"},{"name":"Paul Auster","slug":"Paul-Auster","link":"/tags/Paul-Auster/"},{"name":"novel","slug":"novel","link":"/tags/novel/"},{"name":"Ken Follett","slug":"Ken-Follett","link":"/tags/Ken-Follett/"},{"name":"mediocre planet","slug":"mediocre-planet","link":"/tags/mediocre-planet/"},{"name":"bookmarks","slug":"bookmarks","link":"/tags/bookmarks/"},{"name":"architecture","slug":"architecture","link":"/tags/architecture/"},{"name":"art","slug":"art","link":"/tags/art/"},{"name":"psycho","slug":"psycho","link":"/tags/psycho/"},{"name":"blockchain","slug":"blockchain","link":"/tags/blockchain/"},{"name":"detective fiction","slug":"detective-fiction","link":"/tags/detective-fiction/"}],"categories":[{"name":"happy little capsules","slug":"happy-little-capsules","link":"/categories/happy-little-capsules/"},{"name":"Techo","slug":"Techo","link":"/categories/Techo/"},{"name":"F****** Fabulous","slug":"F-Fabulous","link":"/categories/F-Fabulous/"},{"name":"chasing the sunset","slug":"chasing-the-sunset","link":"/categories/chasing-the-sunset/"},{"name":"Journals","slug":"Journals","link":"/categories/Journals/"}]}