{"pages":[{"title":"About ME","text":"Techo Psycho Alcohol","link":"/about/index.html"},{"title":"categories","text":"","link":"/categories/index.html"},{"title":"tags","text":"","link":"/tags/index.html"}],"posts":[{"title":"API Gateways","text":"by Priyal Walpita API网关是一种许多API开发者用来封装API端点的典型的模式。但是，更常见的是用API网关来反设计模式。本文聚焦于API网关模式的正确使用。 一个API（应用程序接口）网关是一个位于其他后端（微）服务的接口。API网关可以用来确保安全性、可扩展性和高可用性等系统架构特性。 我们是否能不使用网关来实现我们的服务（例如RESTFull或者SOAP）？当然可以。但是单独的服务需要不少非业务具体功能，例如路由、认证、授权、TLS、日志、追踪等等。更重要的是，如果不使用网关来暴露API端点，客户端将获取后端服务的分布和部署细节。当你使用API端点集成内部前端应用时，这没什么大问题了。对于企业级API网关，它们可能被暴露给未知的需求客户端，这就不是一个好的实践。 反向代理或者负载均衡能被用作网关吗？If you are using your Gateway only to abstract a single back-end or just to terminate your TLS communication, Reverse proxy or Load balance would be sufficient. But, inherently, a proper API Gateway would fulfill the following functionalities. Multiple Back-ends ( Microservices ) Service Discovery Circuit breaking Authentication and Authorization Rate limiting Logging and tracing Routing Retry logic etc.. 单一网关是好是坏?If you deploy a single API Gateway, even though it is simple and easy to manage, you are asking for the following troubles. Single point of failure: If your API Gateway stops functioning properly, your entire back-end communication will go down. This is a disastrous situation and should be avoided at all costs. As a solution, you can have a scalable API Gateway cluster behind a hardware load balancer where the load balancer can be notified of the backpressure. Various traffic requirements would traverse through a single API Gateway stack: Depend on the various business functionalities, the API requirements are different in terms of performance, security, compliances, etc. If you do have a single API Gateway cluster, all traffic will traverse through that, and you won’t be able to cater to different needs as required. This is not a good idea, especially if you are building an Enterprise API Gateway. Make your DevOps functionality difficult: If you do any routing change or protocol change in any of your back-end services, it will impact your API Gateway as well. Hence, once you deploy such a change, the API gateway also needs to get updated using a single cluster of API Gateway. Hence, the best option would be to have multiple API Gateways, specifically designed to cater to specific needs. We can identify two flavors of API Gateways as follows. Enterprise API Gateway Microservices API Gateway The Enterprise API Gateways are mainly using for the API marketplace where you are expecting any 3rd party to come and use your API after paying for the usage. Most of the API integrations cater to this nature, and the following are the main concerns you need to focus on when developing an Enterprise API Gateway. A separate enterprise integration team would do deployment. A manual process of QA →Staging → UAT → Production would be used. DevOps pipelines would hardly be used in this kind of scenario. Error encapsulation(Custom errors) for clients. Need to monitor invocation rates and HTTPS status. Maybe your billing would depend on this. We need to focus more on security, data compliance, and standards, etc. In Microservices, Gateway’s concerns are as follows. Using inside your ecosystem where the API Gateway is exposed only to your internal clients. High usage of CI/CD pipelines with deployments types such as Canary, Shadow, Blue-Green, etc. The API may expose full details of errors along with the stack trace. Non-functional requirements such as latency and performance would be considered over enterprise-level constraints such as standards, compliance, security, etc. API Gateway Anti-patternsFollowing can be identified as the API Gateway Anti-patterns. Overburning the Gateway by routing most of the traffic through a single service. Not considering the scalability and resiliency factors of services that API Gateway is dependent upon ( Eg: Authentication, Service discovery. Routing, etc…) Failure of these services would affect directly to the API Gateway’s availability. Avoid using the API Gateway as ESB by rerouting internal traffic using the API Gateway. The API Gateway should route only the external incoming traffic to your service layer. Ensure a single point of failure is mitigated and managed. Let your API Gateways unmonitored and isolated. What are the commercial and open source products that we can use. Kong GatewayApache APISIXTykGokuWSO2KrakenDZuul","link":"/2021/06/02/API-Gateways/"},{"title":"Answers By Alice Munro","text":"你认为最完美的快乐是怎样的？ 星期天下午，我们喜欢长途散步，从我家后面开始，沿着铁路线走。我们会走到瓦瓦那什河湾栈桥，然后返回。我们谈论安乐死、遗传控制群体、是否有灵魂、宇宙是否最终是可知的。我们没有达成任何一致的看法。开始我们在秋天散步，接着是冬天。在暴风雪中，低着头争辩，手插在口袋里，细腻刺骨的雪打在我们脸上。争辩累了，我们会把手拿出来，伸开双臂保持平衡，试图在铁轨上走。 《女孩和女人们的生活》 你最希望拥有哪种才华？ 即便困难重重，生病、穷困、丑陋，你依然能珍惜你的灵魂，就像用盘子端着一枚珍宝走过人生。 《爱的进程》 你最恐惧的是什么？ 恨始终是一种罪过。你灵魂里的一滴仇恨，会扩散开来毁掉所有的色彩，就像白牛奶里的一滴黑墨水。 你最喜欢的消遣是什么？ 我的生活早已发生了疯狂的转变，我每天为之悔恨的事情同时也是我的骄傲。我感觉自己已经以全新的面貌重生于世。坐在桌边，双手捧着一杯咖啡或者红汤，直到它几乎没有一丝热气，就这么待上一小时。我漫无目的地读书，读那些早就想读的书里的散句。这些句子总是令我满足，它们是如此优美独特，总是让我陷入一种特别的状态，全然忘却了其他的词句。我恍惚而又警觉，与所有人隔绝却随时觉察着这城市本身——它似乎是个奇怪的地方。 《公开的秘密》 你认为程度最浅的痛苦是什么？ 嗯，这真是奇怪。想象之中，每当你支持什么的时候，总是会声音洪亮，而周围的人被你惊醒，感到羞愧不安。但，在真实生活里，他们却都笑得别有意味。你立刻就会明白，你所做的一切，不过是让自己变成大家下次一起喝咖啡时的笑料。 《快乐影子之舞》 你认为哪种美德是被过高地评估的？ 你真可怕，你知道。你像天使们一样可怕。你以为所有人都朝前走，像你一样勇敢阳光——哦，请别看我，亲爱的。不要看我——或许我不是你希望的样子，可你能感觉到我就在这里呀，对吗？ 《好女人的爱情》 你最喜欢男性身上的什么特质？ 生活的要义，哈里告诉劳莲，就是满怀兴趣地活在这个世界上。睁大你的眼睛，要从你所遇到的每一个人的身上看到各种可能性——看到他的人性。要时刻注意。 《逃离》 你最喜欢女性身上的什么品质？ 她知道在酒吧里苦苦等待一个再也不会出现的男人的那种滋味。等待来信，当众痛哭，也曾被不再爱的人纠缠。不过，她仍然觉得情事萌发的第一个信号如此美妙，仿佛是阳光照在皮肤上的温暖，是门廊里轻轻传来的音乐，或者像她经常说的那样，像是黑白电视广告忽然变成了彩色的。她不觉得这是在浪费时间，也不觉得曾经浪费过时间。 《公开的秘密》 你最厌恶什么？ 当人们告诉你有时候你要去面对，当他们催促你面对摆在你面前的痛苦、猥亵、讨厌的事实时，在这接近背叛的边缘，他们的声音里总是掩饰不住那种冷酷的庆幸意味，以及对伤害你的贪婪渴望。 《女孩和女人们的生活》 你自己的哪个特点让你最觉得痛恨？ 认识我自己，我认识的是我的邪恶。这是我隐秘的慰藉。我了解我最坏的地方。它也许比别人最坏的地方更坏。但我不在乎。用不着什么借口。我获得了平静。我是个恶魔吗？世界是这么说的，它既然这么说了，那么我就同意好了。不过，这世界对我没有任何意义。我就是我自己，也不会有机会成为别人。我说，我疯了，但疯了又是什么意思？精神不正常，精神正常，我只是我而已。那时候我改变不了自己，现在我也改变不了自己。 《幸福过了头》 你的座右铭是什么？ 改变法律。改变人。可我们又不想所有事情——不要从头到尾都是——都听凭外界指使。我们不想我们的本质，我们的一切，都被那样调制出来。 《好女人的爱情》 你最伤痛的事是什么？ 她像是肺里什么地方扎进去了一根致命的针，浅一些呼吸时可以不感到疼。可是每当她需要深深吸进一口气时，她便能觉出那根针依然存在。她用什么来取代他的位置？那个逐渐逼近的未来世界的奇特之处与可怕之处，就在于她不能融入其间。 你最看重朋友的什么特点？ 吸引她的——实际上是迷惑住她的——是在前寒武纪岩石层峦叠嶂的遮蔽后所能寻见的那种极端冷漠、重复、漫不经心以及对和谐的轻蔑。 《逃离》 什么让你感觉到最快乐？ 很少人，非常非常少的人，才拥有宝藏，如果你真的拥有，那你就千万不要松手。你必须别让自己路遇拦劫，从自己身边把它丢失了。 你希望以什么样的方式死去？ 我就是这样心怀秘密，感觉茫然，内心却又充满了力量。 《快乐影子之舞》","link":"/2021/04/09/Answers-By-Alice-Munro/"},{"title":"Can TikTok’s brand flagships lure luxury?","text":"The app is known as TikTok in the West. In China, its name is Douyin — which means, literally, ‘shaking sound’ in Chinese. Owned by China’s Bytedance, they both serve as a platform for young people to play with short-form videos. TikTok在中国被叫做抖音，事实上，抖音的中文意思是抖动的声音。抖音属于字节跳动公司，它和TikTok均作为一个面向年轻人的短视频平台。 Now Douyin wants to muscle in on China’s huge e-commerce sector. And the app could benefit from the support of Chinese regulators, who are keen to encourage more competition in a sector dominated by giants Alibaba and JD.com. 如今，抖音想要在中国电商市场份额中大展拳脚。这个应用也得益于中国监管的支持，监管机构致力于在被阿里巴巴和京东等巨头公司占据主导的部分中鼓励更多的竞争。 This is the article reference link. 「中国的短视频应用对电商有着巨大的野心，奢侈品什么时候会下场收割？」 3月下旬，抖音开设了 “品牌官方旗舰店” 的功能，为大众消费品到高端奢侈品等商家提供更有吸引力的销售机会。抖音让品牌能够通过官方主页为6亿日活用户提供一种无缝衔接和充满信赖感的购物体验。 当抖音这样做的时候，TikTok很有可能照做。在超动态的中国电商市场的创新被慢动作的西方密切关注着，所以抖音先于它的姐妹软件TikTok行动是意料之中的事。 在开设品牌旗舰店之前，抖音用户如果想要在平台即看即买，需要通过链接跳转到例如京东、天猫、淘宝、抖音小程序等第三方平台，或生态系统之外的其他轻量级应用来买卖商品。 无论对于商家还是买方而言，品牌旗舰店的推出都代表着一种升级。Insider Commerce分析师Man-Chung Cheung解释说，品牌必须提交商标才能正式在抖音上开官方店，这可以确保所售产品的真实性和合法性。旗舰店为品牌提供了一个可以直接将产品置于用户体验中心的平台，这代表着一个意义重大的升级。他补充道，抖音希望品牌旗舰店模式可以让自己更有力地与天猫、京东、微信等其他平台竞争，因为所有这些平台都已经从销售奢侈品中取得了不小的势头。 抖音上娱乐性内容的流量销售转化率是非常高的，这也带火了不少奢侈品的营销。现在，抖音希望保留这些流量在内部来帮助品牌实现流量变现。 Digital Luxury Group中国董事兼合伙人Pablo Mauron说，「旗舰店」能够把抖音的流量以一种无缝衔接的方式变现，这也是为什么奢侈品行业十分重视这个机会。抖音是除了天猫生态系统外唯一一个能将流量变现的直播平台，品牌对此十分感兴趣。” 自2016年推出以来，抖音取得了惊人的增长，目前日活用户数量已经超过了6亿，并增加了包括直播在内的许多功能。在去年，这些功能让平台上的商品交易总值达到了1700亿元人民币（264亿美元）。 抖音的成功并不代表其母公司字节跳动能够免受中国政府对大型科技公司的监管。创始人张一鸣本月宣布将在公司公开募股前辞去首席执行官一职，这一举动震惊了不少投资者。分析师推测，采取这个先发制人的举措是为了使政府安心。 奢侈品的机遇Dior早在2018年04月就开设了抖音官方账号。但一位品牌发言人说，由于抖音还在进行一系列优化，开设旗舰店的可行性和有效性不是Dior马上会考虑的问题。他还补充道，在所有东西满足要求，并同时达到消费者的预期之前，我们不会走出这一步。 奢侈品牌踌躇不决的态度是意料之中的，他们此前就已经花费了多年时间来观察和测试抖音的发展情况。 过去三年中，包括Burberry、G和Prada在内许多头部品牌也是在去年疫情后，才创建品牌账号来营销和宣传产品。咨询公司Gartner的专业顾问Asa Mazor-Freedman指出，包括 Tiffany＆Co.、Celine、Gucci和Chloé在内的一些奢侈品品牌目前还是习惯于将产品链接到他们自己的.cn中国官方网站或是天猫旗舰店，而并没有最大化利用抖音自身的电商机会。 相比于奢侈品，时尚和美妆品牌的态度显得更加积极。在推出品牌旗舰店功能的几周之内，至少220家本土和国际品牌就已经在抖音上开设了旗舰店。据Digital Luxury Group统计，Make Up Forever、Maybelline、Sephora、Elizabeth Arden和Avène都在早期便采用了这一模式。香港珠宝品牌周大福则是奢侈品牌中为数不多的参与者。 Mauron指出，这个形势很熟悉，总是本土品牌、大众化品牌以及美妆品牌开先例，而奢侈品牌则谨慎地跟随其后。现在，抖音已经明确其在奢侈品牌沟通战略中的作用，未来几个月有望看到快速发展。他说：“我知道时尚和珠宝品牌事实上正在研究这个渠道，这项工作还在进行中。” 奢侈品的优缺点在抖音开设旗舰店的最大益处是有机会与中国00后的网民们拉近关系。据Insider Intelligence统计，00后人群占据抖音所有用户的一半之多。这一代年轻人已然是中国奢侈品消费增长的重要贡献者–00后是天猫奢侈品时尚和生活方式市场中增长最快的人群。 中国品牌对此再清楚不过了。本土最大的服装公司之一，太平鸟的电商战略业务部总监李伟说：“我们生活在一个数字化时代，时尚品牌未来的成功很大程度上取决于他们怎样与90后和00后这些数码’原住民‘沟通。抖音作为一个吸引着中国年轻网民的平台是难以被忽略的。” 太平鸟称销售业绩 “非常成功”。 通过抖音品牌旗舰店直接处理交易，品牌可以保留在之前的商业模式中流失给第三方平台的消费者数据。中国电商咨询公司Azoya的欧洲董事总经理Elena Gatti说：”（以前）品牌在内容上投资了很多钱，却把消费者流失给了其他平台。最终，他们其实不知道投资和广告将用户转化为消费者的转换率是多少。在抖音上进行这一转化会促成一个封闭的电商内循环，从品牌的角度来看这是非常有意义的。” 但是，Mazor-Freeman也警告说，在竞争异常激烈的奢侈品市场上，没有品牌会轻易取得成功。Gatti指出，投资回报必然需要一段时间，因此品牌应该将其视为一种中长期的投资，并且专注在一些容易引起年轻消费者共鸣的入门级产品。他说：“正因如此，抖音是绝佳选择。” 竞争激烈的角斗场抖音其实在很早的时候已经展露出了在电商领域的野心。2019年，抖音母公司字节跳动便成立了电商部门，将电商业务与其内容平台进行整合。当年08月，抖音还限制了从其直播渠道跳转到第三方平台的链接，并于2021年01月推出了用以与蚂蚁金服的支付宝和腾讯的微信支付竞争的抖音支付。 报道称，抖音即将升级与京东的合作关系，并使用京东的物流和客户服务，这也是抖音为提升平台在品牌和消费者心目中电商信誉所迈出的一步。Gatti认为，这样的合作是’自然而然的‘。他说：“抖音是一家纯互联网内容公司，它不具备任何电商的硬性条件。” 作为回报，京东被授权获得抖音不断扩大的用户群，并挖掘一种与自身模式截然不同的购物方式。他说：“现在上抖音，你想买东西是因为你被内容煽动了。京东可以触及到这群主要由兴趣和灵感驱动而购物的消费者群体。” 中国电商平台早就向奢侈品牌抛出了橄榄枝，但是天猫和京东直到最近几年才被品牌广泛采用（新冠疫情隔离起到了决定性的推动作用）。随着欧美奢侈品牌对中国电商生态系统越来越熟悉，他们可能会以较快的速度采用抖音这一新的渠道。 政府对阿里巴巴和其他科技巨头的反竞争压制也可能会成为字节跳动的优势。Mazor-Freedman说：“监管部门助力抖音进入电商领域，是希望在这个领域存在更多竞争，而不是让阿里巴巴始终处于垄断地位，抖音具备与其竞争的流量和规模。”","link":"/2021/05/31/Can-Douyin%E2%80%99s-brand-flagships-lure-luxury/"},{"title":"Business Ladder","text":"Technical Writer IWorks closely with the Product Engineering team to incorporate new releases into our existing documentation.Has an ability to achieve clarity with conciseness and accessibility. Checks for cohesion in tone and style with existing documentation. Acts as a critical advisor for UI copy and names for things, referencing where we might have collisions in existing terms, and attempting to find the best explanation for users. Reads through our existing documentation and updates/corrects for legibility.Understands our writing style guide and adheres to it. Performs PR reviews for their peers with a focus on writing, style, and grammar.Communicates internally and externally in a respectful manner. Technical Writer IIStrong understanding of the product space and capabilities to inform high levels of accuracy in documentation. Helps our Product team establish harmony between written and visual communication in UI Copy. Accurately captures all relevant content and resources, establishing visibility for users. Understands our writing style guide and adds to/refines it. Performs PR reviews for their peers that considers flow and the audience, as well as the goals of the product. Listens to the priorities and concerns of others, and acknowledges differing perspectives. Anticipates others’ reactions. Thinks through and files issues for how to refine the docs site and UI. Reflects on user feedback and either categorizes it as won’t fix, or turns it into something actionable. Actively participates in meetings, and creates cross-team collaboration where necessary to address business goals. Senior Technical WriterAt this point, a person is mastering how effective they can be as an individual contributor. Acutely aware of our audience and defers voice and tone to meet the needs of the user. Considers overall information architecture both in writing and while reviewing. Thinks through what the user needs exactly at the point of learning to reduce cognitive overhead. Understands with depth what our organization and company OKRs are, and performs audits on their content to make sure we are achieving our goals. Has an understanding of the wider ecosystem of tools so that they know what context users may or may not be coming from. Ensures that there’s a clear path for a first-time user and understands how and when to weave in advanced material such as caveats and warnings. Understands with depth when and how users will perceive naming conventions, UI copy, and thinks through potential tradeoffs and benefits for different directions. Helps support the work of their peers both on the team and in the community at large, by engaging pairing sessions, reviewing, and providing mentoring. Gathers customer impressions of products and services and integrates this feedback into decision making. Adjusts well to shifting priorities when necessary. Demonstrates openness to others’ ideas. Adapts their communication style to most effectively communicate with the target audience. Effectively and accurately shares credit for ideas and collaborative efforts. Staff Technical WriterAt this point, the majority of one’s time is spent scaling their own skills to help others. Conducts competitive tear downs and illuminates new patterns and industry standards for information architecture, educating their peers and coworkers.Gives review feedback on PRs with a mind towards the growth of the individual they are reviewing, thinking through not just the content of the review, but how they can explain something to help guide the person in the future. Develops new plans and projects for our documentation, creating one-page proposals on how we might level up to better serve our users and/or business needs. Works on integrations or materials that aid in partnerships within the ecosystem. Attends support pairing prepared with ideas for improving the docs based on the customer feedback that’s been surfaced that week or well-formed questions to drive towards developing such ideas collaboratively. Helps shape support pairing to make it more efficient and effective. Notices recurring friction/confusion that impedes team success/efficiency and creates resources that clarify or solve these issues. Ensures the resources are easy to locate. Principal Technical WriterAt this point, one is helping others be the best that they can be, removing themselves and meeting others where they are. Develops proven systems and approaches to technical writing. Replicates those systems and approaches across the team so that others may learn from and improve on them. Mentors and actively drives the technical skills of the immediate or extended team. Anticipates issues or implications that their ideas would have on others, and pursues mutually beneficial strategies. Anticipates the needs of those around them. Is respectful in terms of async hygiene, exhibiting care that their teammates can get in touch with them or knows their status during working hours. Fills out process docs without having to be asked. Works to refine team processes to ensure everyone can be as productive as possible and build cohesion within the team. Considers team morale one of their initiatives- actively strives to support others, make sure their voices are heard, and illuminate others’ work.","link":"/2021/04/30/Business-Ladder/"},{"title":"Apache KAFKA","text":"Basics「Apache Kafka」 is an open-source distributed event streaming platform used by thousands of companies for high-performance data pipelines, streaming analytics, data integration, and mission-critical applications. Producers and ConsumersProducers and consumers are services that listen to or send messages in Kafka. These services are your backend services. TopicsTopics are addresses that producers can send messages to. Other services can listen to these topics. PartitionsA Kafka topic is not really a single queue, but actually composed of many queues called partitions! They help a topic scale. InfrastructureZookeeper manages all of your topics and partitions. It basically maintains a set of Kafka cluster nodes where topics and partitions are stored. These nodes are individual machines (for example, EC2 instances) which make up your Kafka cluster. ConclusionsIn short, Apache Kafka and its APIs make building data-driven apps and managing complex back-end systems simple. Kafka gives you peace of mind knowing your data is always fault-tolerant, replayable, and real-time. Helping you quickly build by providing a single event streaming platform to process, store, and connect your apps and systems with real-time data.","link":"/2021/05/30/Apache-KAFKA/"},{"title":"CI&#x2F;CD","text":"Infrastructure ProblemBackgroundA development team has created a Java web app that is ready for a limited release (with reduced availability and reliability requirements). If the limited release is successful the app will be rolled out for worldwide use. Once fully public, the application needs to be available 24/7 and must provide sub-second response times and continuity through single-server failures. Basic problemYou need to create one environment for local Dev/QA, a better solution should also consider about CI/CD, further more, we’d also like to see your thoughts about how you do the HA, monitor, log etc. after the application is published to world. Assumptions You have free rein to incorporate any software tools and hardware you need to streamline application deployment and infrastructure provisioning &amp; configuration as long as they are Free/Libre/Open Source software (FLOSS). We request that you use Linux. The development team has a continuous integration build that produces two artifacts: 12a .zip file with the image and stylesheet used for the application.a .war file with the dynamic parts of the application. You should deploy the static assets to a web server and the .war file to a separate application server. Any compatible servers are acceptable. The app (companyNews) uses Prevayler for persistence. Prevayler essentially persists data to a file. The dev team chose this to simplify the development effort, rather than having to deal with an RDBMS. Expected output for this problemSimply put, we want you to design and create the local Dev/QA environment. You should use a virtualization/Container solution such as VirtualBox or Docker for these environments. We do not want you to deliver the VMs/Images to us, a detailed step by step instruction/document is not what we expect either. Instead you should provide scripts to enable us to build the environment very easily. The principle is automation as much as possible.","link":"/2021/04/11/CI-CD/"},{"title":"Flown","text":"They Are Not Natural","link":"/2021/04/06/Fabulous/"},{"title":"Elastic Search","text":"ELK “ELK”是三个开源项目的首字母缩写，分别是：Elasticsearch、Logstash 和 Kibana。 Elasticsearch 是一个分布式搜索和分析引擎,基于JSON开发而来，具有RESTful风格。 Logstash 是服务器端数据处理管道，能够同时从多个来源采集数据，转换数据，然后将数据发送到“存储库”中。 Kibana 是指可视化工具，可以让用户在 Elasticsearch 中使用图形和图表对数据进行可视化。 ELK Service","link":"/2021/04/14/Elastic-Search/"},{"title":"Hateful April","text":"A Voyage to LilliputGulliver’s TravelsIt would not be proper, for some reasons, to trouble the reader with the particulars of our adventures in those seas; let it suffice to inform him, that in our passage from thence to the East Indies, we were driven by a violent storm to the north-west of Van Diemen’s Land.(fn) Twelve of our crew were dead by immoderate labour and ill food; the rest were in a very weak condition. On the 5th of November, which was the beginning of summer in those parts, the weather being very hazy, the seamen spied a rock within half a cable’s length of the ship; but the wind was so strong, that we were driven directly upon it, and immediately split. Six of the crew, of whom I was one, having let down the boat into the sea, made a shift to get clear of the ship and the rock. We rowed, by my computation, about three leagues, till we were able to work no longer, being already spent with labour while we were in the ship. We therefore trusted ourselves to the mercy of the waves, and in about half an hour the boat was overset by a sudden flurry from the north. What became of my companions in the boat, as well as of those who escaped on the rock, or were left in the vessel, I cannot tell; but conclude they were all lost. For my own part, I swam as fortune directed me, and was pushed forward by wind and tide. I often let my legs drop, and could feel no bottom; but when I was almost gone, and able to struggle no longer, I found myself within my depth; and by this time the storm was much abated. The declivity was so small, that I walked near a mile before I got to the shore, which I conjectured was about eight o’clock in the evening. I then advanced forward near half a mile, but could not discover any sign of houses or inhabitants; at least I was in so weak a condition, that I did not observe them. I was extremely tired, and with that, and the heat of the weather, and about half a pint of brandy that I drank as I left the ship, I found myself much inclined to sleep. I lay down on the grass, which was very short and soft, where I slept sounder than ever I remembered to have done in my life, and, as I reckoned, about nine hours; for when I awaked, it was just day-light. I attempted to rise, but was not able to stir: for, as I happened to lie on my back, I found my arms and legs were strongly fastened on each side to the ground; and my hair, which was long and thick, tied down in the same manner. I likewise felt several slender ligatures across my body, from my arm-pits to my thighs. I could only look upwards; the sun began to grow hot, and the light offended my eyes. I heard a confused noise about me; but in the posture I lay, could see nothing except the sky. In a little time I felt something alive moving on my left leg, which advancing gently forward over my breast, came almost up to my chin; when, bending my eyes downwards as much as I could, I perceived it to be a human creature not six inches high, with a bow and arrow in his hands, and a quiver at his back. In the mean time, I felt at least forty more of the same kind (as I conjectured) following the first. I was in the utmost astonishment, and roared so loud, that they all ran back in a fright; and some of them, as I was afterwards told, were hurt with the falls they got by leaping from my sides upon the ground. However, they soon returned, and one of them, who ventured so far as to get a full sight of my face, lifting up his hands and eyes by way of admiration, cried out in a shrill but distinct voice, Hekinah degul: the others repeated the same words several times, but then I knew not what they meant. I lay all this while, as the reader may believe, in great uneasiness. At length, struggling to get loose, I had the fortune to break the strings, and wrench out the pegs that fastened my left arm to the ground; for, by lifting it up to my face, I discovered the methods they had taken to bind me, and at the same time with a violent pull, which gave me excessive pain, I a little loosened the strings that tied down my hair on the left side, so that I was just able to turn my head about two inches.","link":"/2021/04/01/Hateful-April/"},{"title":"Life System Reloading -「BARAKA」","text":"01It Is Like Pushing A Building Off Cliff Ready? Loading… Game started. Saving… Mission failed. Reloading… Death Stranding Reboot again 02You Are Just A Giant Flying Brick 03No Pain No GainYou Want It You Got It","link":"/2021/05/19/Life-Syetem-Loading/"},{"title":"Look what they taught me 「patience」","text":"THE HEART WANNA WHAT IT WANTS THEN IT WILL GET THAT HOPEFULLY","link":"/2021/05/12/Look-what-they-taught-me-patience/"},{"title":"「4 3 2 1 :a novel」","text":"","link":"/2021/04/11/Paul-Austers-4-3-2-1/"},{"title":"Mayday SALUTE","text":"","link":"/2021/05/01/Mayday-SALUTE/"},{"title":"Gangster and Prisoner&#39;s Dilemma","text":"","link":"/2021/04/21/Gangster-and-Prisoners-Dilemma/"},{"title":"Shanghai&#39;s Midnight","text":"","link":"/2021/05/08/Shanghai-Midnight/"},{"title":"Kerry Blues","text":"山 是山的影子 狗 懒得进化 夏天 人的酶很固执 灵魂的酶像荷花 背着手 在亚热带的酒馆 门前吹风 晚了就坐下 看柔和的闪电 背着城市 亚热带季风的河岸 淹没还不醉的桥 不醉的建筑 用静默解酒 明天 阴 摄氏三到十二度 修雨刷片 带伞 在戒酒的意识里 徒然下车 走路到天晴 照旧打开 身体的衣柜 水分子穿越纤维 命运布光的手 为我支起了四十二架风车 源源不断的自然 宇宙来自于平衡 附近的星球来自于回声 沼泽来自于地面的失眠 褶皱来自于海 冰来自于酒 通往岁月楼层的应急灯 通往我写诗的石缝 一定有人离开了会回来 腾空的竹篮装满爱 一定有某种破碎像泥土 某个谷底像手一样摊开 今天的太阳 像瘫痪的卡车 沉重地运走整个下午 白醋 春梦 野柚子 把回忆揣进手掌的血管里 手电的光透过掌背 仿佛看见跌入云端的海豚 所有的转折隐藏在密集的鸟群中 天空与海洋都无法察觉 怀着美梦却可以看见 摸索颠倒的一瞬间 所有的怀念隐藏在相似的日子里 心里的蜘蛛模仿人类张灯结彩 携带乐器的游民也无法表达 这对望的方式 接近古人 接近星空 冬天是十一月 十二月 一月 二月 三月 四月 当我的光曝在你身上 重逢就是一间暗室","link":"/2021/04/22/Kerry-Blues/"},{"title":"OFF THE WALL","text":"OFF THE WALL CHASE THE SUNSET SEIZE THE STAR TRAILS","link":"/2021/05/27/OFF-THE-WALL/"},{"title":"The Blockchain Playbook: From LVMH’s Aura To Arianee","text":"by MAGHAN MCDOWELL VogueBusiness 「The announcement of the new Aura Blockchain Consortium by LVMH, Prada and Richemont threw the blockchain into the spotlight. We decode the uses, the competition, and the friction between transparency and brand control.」 In September 2019, high-level executives from LVMH, Prada Group, Richemont and others met at the historic Louis Vuitton family house in the Asnières-sur-Seine suburb of Paris to hammer out the details of a blockchain platform created specifically for the luxury industry by technology company Consensys and Microsoft. The key focus was how the companies, despite being competitors, could develop a blockchain platform that would verify the authenticity and provenance of luxury goods. “We were talking about every point together, such as, ‘What is the appropriate legal entity?’, ‘What are the governing principles?’,” says Timothy Iwata Durie, Cartier’s global innovation director, who participated in the discussions. (Cartier is owned by Richemont.) The result is the nonprofit Aura Blockchain Consortium, open to any luxury brand (who pay licensing fees and a fixed fee per product) with the ability to track and trace any product with a unique digital identity based on a non-fungible token, with all brands collectively contributing to the blockchain governance and strategy. This rare collaboration among luxury players gives a boost to blockchain, an increasing focus for luxury amid consumer expectations for transparency and the pandemic’s pivot to digital-only products, though it has had fits and starts in fashion and beyond. (The Facebook-led Libra Association, also announced in 2019, eventually lost 25 per cent of its inaugural members before ultimately rebranding.) Aura is the newest fashion-blockchain entity to come into play, joining other networks like Arianee, which works with Ba&amp;sh, Audemars Piguet and Vacheron Constanti, and VeChain, which has worked with Givenchy and H&amp;M. Aura is also a private blockchain, meaning only companies on the network have full access and control over their data (brand and client data are accessible only to each brand). While Aura marks a significant development for the technology’s relationship with the luxury industry, it also raises questions around how private blockchains can be transparent without being open-access, and how brands who have existing blockchain projects might proceed. This formal collaboration to embrace blockchain “shows a change of mentality within the industry” previously unthought of, says Marjorie Hernandez, co-founder of the fashion-based Lukso blockchain platform. Lukso is a decentralised, permissionless blockchain infrastructure designed for physical and digital goods, which recently registered Karl Lagerfeld’s photographic legacy. “Will they build bridges with other blockchain networks? A consortium-driven blockchain means there are certain authorities in charge and that there is a barrier of entry.” Aura’s plansAura authenticates products by assigning each a unique digital identity that houses provenance information; additional features can be added over time, and a tech roadmap is in the works, Durie says. The information can be attached to products through various means including QR code or RFID tag, which Prada has begun adding to its products. While “track and trace” capabilities had always been a goal of Aura, the past year’s dramatic increase in digital and remote selling made them more important, says LVMH chief information officer Franck Le Moal. Brands have also started endorsing and participating in rental and resale, which hinges on the authentication of products, as well as experimenting with digital clothes and NFTs (which are unique tokens on the blockchain). There are “advanced conversations” ongoing with other groups and independent brands, says Durie, of Cartier. LVMH-owned Bulgari, Hublot and Louis Vuitton, in addition to Prada and Richemont-owned Cartier, are already using the platform. “Consumer needs have shifted, and the focus on sustainability has accelerated the urgency,” Durie says. “It pushes us to reaffirm our conviction and to be more open-minded and meet the needs of our consumer by having tools to give them transparency.” Aura is not pushing brands to adopt any specific uses, but rather providing members access to a platform that has various capabilities throughout a product’s supply chain, says Le Moal, of LVMH. Most will use it to offer information on the beginning of a product’s sourcing, including raw materials, and factories, and extending to post-sale, including aftercare and secondhand, though it could be used to offer an NFT collection if brand’s decide. While even the organisers of the Aura Consortium are still ironing out details as they arise, they do have a strict point of view on why a private platform is ideal, and what the future might entail. An “exclusive” luxury blockchain?Aura is an open consortium, but it is not open to everyone, and operators can decide to hide or show the events they track within the system, meaning that customers only see what a brand gives them access to. Prospective brands submit an application to the membership sub-committee, which vets them and makes a recommendation to the board. “We are not like a gentleman’s club, and as long as you are a luxury brand, you’re in. However there are codes of conduct and terms of use,” Durie says. One notable example: Durie says that while the technology might enable a brand to create an NFT, the consortium would not encourage members “to engage in speculative behaviour” associated with the hype. “Luxury brands are built for the long term. It’s important to make things possible, but at the same time, we are luxury brands and we make things last — longevity is important to us. It is really anchored in the values of luxury brands.” A notable outlier to the consortium is Gucci-owner Kering. Chief client and digital officer Grégory Boutté told Vogue Business in 2019 that he would be open to partnering with LVMH and Kering has since gone on to test blockchain including using third-party providers to certify Ulysse Nardin watches and offer authenticity checks for Kering’s eyewear. Kering and LVMH both confirmed they are in ongoing talks about Kering joining Aura. A Kering spokesperson said “the group hasn’t identified use-cases that could not be done on existing blockchain solutions and has already launched some initiatives in that field”. Others operate differently: fashion blockchain startups, such as Lukso and Arianee, operate public, decentralised blockchains and open-source protocols, meaning that anyone can join and customers can see every “event” in a product’s life cycle. Le Moal, of LVMH, says that creating a private, bespoke platform in-house, versus using an existing option, was important for controlling the processes and the data without a third party in between. “By us coming together and gaining scale, we have the ability to set standards,” Durie says. “We need to make sure we do not put important client data in the hands of a third party or be exposed to an open-source platform. We exist hundreds of years, not five. It’s important to protect the integrity of our client information.” Meanwhile, Arianee’s public blockchain and open-source solution, means the code is published, and people can contribute and build on it, with brands able to build their own interfaces. The Paris-based firm provides digital passports to luxury goods, and focuses less on supply chain information and more on engaging the customer after a sale, or resale, is made, says CEO and co-founder Pierre Nicolas Hurstel. Breitling, for example, has attached digital IDs to its timepieces and uses them to offer special promotions to owners while allowing the customer’s identity to be anonymous. Arianee also has a nonprofit association, whose 35 members include Richemont; it just raised $9.5 million in part from a French government fund. The open-source protocol allows the public “full transparency”, says Arianee’s Hurstel. Open-sourcing and decentralised infrastructure is the best way to build trust, adds Antonio Carriero, Breitling’s chief digital and technology officer, who is a member of the Arianee Project Association. For now, he views Aura and Arianee to be compatible and complementary, rather than competitive. “Using one, the other or both depends on your priorities as a brand.” Lukso’s Hernandez says that while a private blockchain for tracking and tracing is a good idea, the power of blockchain technology is ultimately in decentralisation, meaning that there is no central authority, casting some doubts on Aura’s closed control. “In order for users and third-party companies to verify the ownership and the true transparency of a product, that product identity needs to live on a decentralised, permissionless public blockchain,” she says. Aura’s Le Moal and Durie say they are open to eventual partnerships. “We cannot say never, but for the time being, we want to develop ourselves,” Le Moal says. “We want to be sure we are focusing on the luxury industry, and not all others focus on luxury.” Durie adds that a private blockchain does not require the large energy consumption that most public blockchain protocols do, and says that as sustainability is a key value of the Consortium, this underpins the choice of a private blockchain. What comes nextAs more luxury brands consider their blockchain strategies, questions arise around how different networks may intersect. Theoretically, one product could be added to multiple chains. This so-called “interoperability”, is crucial for the success of the technology, says Megan Kaspar, managing director and co-founder of investment and incubation firm Magnetic, which specialises in blockchain and cryptocurrency-based startups. “It’s a historical problem in fashion retail that systems have been siloed and unable to communicate,” says Natasha Franck, founder and CEO of Eon, which recently partnered with Gabriela Hearst and Yoox Net-a-Porter to provide digital IDs to products globally. “We create these products and they can’t communicate to resellers or customers. The interconnectivity is a foundation for a stronger digital ecosystem. Any time things are able to communicate, it adds more value to the whole network.” In the meantime, Aura welcomes others to join. Cartier’s Durie says it’s also open to individual brands, and brands that are outside of just fashion. “The more we will be, the better it will be for our industry.”","link":"/2021/06/01/The-blockchain-playbook-From-LVMH%E2%80%99s-Aura-to-Arianee/"},{"title":"Write Like You Are Not Afraid","text":"","link":"/2021/04/09/Write-Like-You-Are-Not-Afraid/"},{"title":"「存在主义」咖啡馆","text":"「海德格尔在《存在于时间》中提及，日常存在，而非触不可及的宇宙论或者数学，才是最’本体论’的东西，实际的操劳与操心，比反思更为原始。有用性先于沉思，’当下上手状态’先于’现成在手状态’，’在世存在’和’于他人共在’先于’独自存在’。我们不是在纷繁复杂的世界上空盘旋，从上往下凝视，而是已经在这个世界上，并且参与其中——我们’被抛到’这里，而’被抛性’必是我们的起点」 过去的哲学家一直陷在一种意识的’消化‘模式中：他们认为，感知某物就是将其拉入我们自己的实体之中，像蜘蛛用它自己的唾液包裹住昆虫，将其半分解掉一样。相反，根据意向性，意识到某物，就是爆发出去—— 让自己从潮湿的胃中挣脱出来，从那里飞出来，超越自己，到达不是自己的所在。飞过那里，飞到树上，但是在树的外面，因为它让我感到迷惑、厌恶，我无法让自己沉醉于它，就像它也不能把自己溶解于我一样：外在于它，外在于我自己……而在同一过程中，意识得到了净化，变得像一阵风一样澄明。除了逃离自身的冲动，跑到自身之外的滑离，其中不再有任何东西。如果你能’进入‘一种意识（尽管不可能），那么你就会被一阵旋风卷起，然后被抛回到外面有树和灰尘的地方，因为意识没有’内在‘。它只是它自身的外表，正是这种绝对的逃离，这种对成为物质的拒绝，使它成为一种意识。 想象一下，现在一系列连锁的爆发，让我们挣脱了我们自己，甚至都不留一点时间，让我们在这些爆发之后形成’我们自己‘，而是直接把我们扔出去，扔进世界干燥的尘埃中，扔在粗糙的地面上，扔在事物之间。想象一下，我们以这种方式被抛出，被我们的本性抛弃在了一个冷漠、敌对、抵抗的世界里。如果你这样做的话，就能明白胡塞尔在那句著名的话中表达的发现所具有的深刻含义了「所有的意识都是从属于某物的意识」。 对于萨特来说，如果我们试图把自己关进我们的心灵之内，关进’一间百叶窗紧闭、漂亮温暖的房间里‘，那我们就会停止存在。我们没有舒适的家：到尘土飞扬的马路上，正是我们是什么的定义。","link":"/2021/04/20/%E5%AD%98%E5%9C%A8%E4%B8%BB%E4%B9%89%E5%92%96%E5%95%A1%E9%A6%86/"},{"title":"The Evening And The Morning","text":"『暗夜与黎明』Where Follett excels is in telling a yarn…you won’t be able to put it down. A Time of Conflict It is 997 CE, the end of the Dark Ages, and England faces attacks from the Welsh in the west and the Vikings in the east. Life is hard, and those with power wield it harshly, bending justice according to their will – often in conflict with the king. With his grip on the country fragile and with no clear rule of law, chaos and bloodshed reign. Three Lives Intertwined Into this uncertain world three people come to the fore: a young boatbuilder, who dreams of a better future when a devastating Viking raid shatters the life that he and the woman he loves hoped for; a Norman noblewoman, who follows her beloved husband across the sea to a new land only to find her life there shockingly different; and a capable monk at Shiring Abbey, who dreams of transforming his humble abbey into a centre of learning admired throughout Europe. The Dawn of A New Age Now, with England at the dawn of the Middle Ages, these three people will each come into dangerous conflict with a ruthless bishop, who will do anything to increase his wealth and power, in an epic tale of ambition and rivalry, death and birth, and love and hate.","link":"/2021/04/08/The-evening-and-the-morning/"},{"title":"「Dig」 Command in Linux","text":"Dig (Domain Information Groper) is a powerful command-line tool for querying DNS name servers. The 「dig」 command, allows you to query information about various DNS records, including host addresses, mail exchanges, and name servers. It is the most commonly used tool among system administrators for troubleshooting DNS problems because of its flexibility and ease of use. 1sudo apt update &amp;&amp; sudo apt install dnsutils Get a Short AnswerTo get a short answer to your query, use the +short option: 1dig linux.org +short Get a Detailed AnswerFor more a detailed answer, turn off all the results using the +noall options and then turn on only the answer section with the +answer option. 1dig linux.org +noall +answer Querying A recordsTo get a list of all the address(es) for a domain name, use the a option: 1dig +nocmd google.com a +noall +answer Querying CNAME recordsTo find the alias domain name use the cname option: 1dig +nocmd mail.google.com cname +noall +answer Reverse DNS LookupTo query the hostname associated with a specific IP address use the -x option. 1dig -x IPAddress +noall +answer Conclusion「dig」 is a command-line tool for querying DNS information and troubleshooting DNS related issues.","link":"/2021/06/02/%E3%80%8CDig%E3%80%8D-command/"},{"title":"关于消解和自洽","text":"记忆中的形象一旦被词语固定住，就会在现实中被抹掉。 「看不见的城市」 对于人生命题来说，自洽是一套解释逻辑，是个体的方法论; 透过不同的解答方式来探索最终答案。 然而最终答案真的存在吗？可能命题本身就是虚无，那么此题也无解。 转念一想，个体真的需要答案吗？或者他们只是需要一种解释方式。不要去预设有那么一个终极奥义，先验不一定真实存在的。 正视命题，用自己的解释方式去消解命题。即使一切都是虚无，都毫无意义，人生的一切随时可能被抹掉，但自己创造的虚无也是一种意义。自我消解本身就是专属于自我的意义，也即自洽。 所以不要去随意对待自己的人生命题，seize and solve it by yourself, and live every moment to the fullest.","link":"/2021/04/13/%E5%85%B3%E4%BA%8E%E6%B6%88%E8%A7%A3%E5%92%8C%E8%87%AA%E6%B4%BD/"},{"title":"月球环形山","text":"凌晨时分，索菲娅醒了。特雷莎和艾伦被从睡梦中惊醒，她们叫醒了馥馥，让孩子最后见见还活着的妈妈。索菲娅只能说一点话了。 特雷莎觉得听到她说：”「幸福过了头」“。 大约四点钟，索菲娅去世。尸体解剖将会显示，她的肺已经完全被肺炎摧毁，心脏的毛病可以追溯到几年以前。正如大家所料，她的脑容量巨大。 博恩荷姆的医生在报纸上看到了她的死讯，并没有觉得意外。他偶尔会有预感，这对于从事他这种职业的人是种困扰，而且也不一定可靠。他曾想过，只要躲过哥本哈根，也许就能保住她。他想知道她是不是吃了他给的药，药是不是带给了她些许安慰，正如在他需要的时候，药物曾给予他安慰。 索菲娅·科瓦列夫斯基葬于斯德哥尔摩当时被称为新公墓的地方。依然寒冷的某天下午三点，默哀的人和旁观的人呼出的气流，在严寒的空气中结成了浮云。 魏尔斯特拉斯送来了月桂花圈。 之前，他和他的妹妹们说，他知道他再也不会见到她了。 他之后又活了六年。 她去世前，马克西姆接到了米塔——列夫勒的电报，从博利厄赶来，他抵达的时候，恰好赶上了在她的葬礼上发言。他用的是法语。他提起索菲娅，更像是提起一位他相熟的教授。他代表俄罗斯对瑞典表示感谢，感谢瑞典给了她作为一个数学家谋生的机会。（以一种相称的方式应用她的知识，他说。） 马克西姆没有结婚。过了一段时间，他被允许返回他的祖国，在彼得堡授课。他成立了俄罗斯民主改革党，他的立场是支持君主立宪制。沙皇派认为他太过自由主义，列宁却公然抨击他是个反动派。 馥馥在苏联从医，逝于20世纪50年代。她对数学没有兴趣，她说。 索菲娅的名字给了月球上的一座环形山。","link":"/2021/05/17/%E6%9C%88%E7%90%83%E7%9A%84%E7%8E%AF%E5%BD%A2%E5%B1%B1/"},{"title":"立夏","text":"The start of summertime","link":"/2021/05/05/%E7%AB%8B%E5%A4%8F-start-of-summer/"},{"title":"UX Roadmap","text":"","link":"/2021/04/18/UX-roadtrip/"},{"title":"建筑学的治愈论","text":"Irwin Union Bank One of the simplest and most sublime structure to have been built in U.S. 米勒之家 The Miller House and Garden，埃罗·萨里宁 Eero Saarinen，1957. 巴塞洛缪县公共图书馆 Bartholomew County Public Library，贝聿铭 I.M.Pei，1969. 第一基督教教堂 First Christian Church，伊利尔·沙里宁 Eliel Saarinen，1942. 罗伯特·斯图尔特大桥 The Robert N. Stewart Bridge，J·穆勒 J. Muller，1999. https://www.columbus.in.gov/engineering/about/about-the-bridge/ 第一金融银行（原欧文联合银行） First Financial Bank，德博拉·伯克 Deborah Berke，2006. 欧文花园旅馆 The Inn at Irwin Gardens, 亨利·菲利普斯 Henry A. Phillips，1910. https://columbus.in.us/inn-at-irwin-gardens/ 欧文会议中心 Irwin Conference Center，埃罗·沙里宁 Eero Saarinen，1950. Republic Newspaper Building，迈伦•戈德史密斯 Myron Goldsmith，1971.http://www.som.com/china/projects/the_republic__newspaper_plant__offices 哥伦布心理健康卫生局 Columbus Regional Health Mental Health Unit，詹姆斯·波尔舍克 James Stewart Polshek 石灰岩柱退伍军人纪念馆 Limestone Pillars - Veterans Memorial 北区基督教堂 North Christian Church，埃罗·沙里宁 Eero Saarinen，1959. 新布朗斯维尔廊桥 New Brownsville Covered Bridge，史蒂芬·朗 Stephen H. Long，1840. 哥伦布大会堂 Columbus City Hall，爱德华·巴塞特 Edward Charles Bassett，1981. Mill Race公园瞭望塔 Mill Race Park Observation Tower，斯坦利·塞托维茨 Stanley Saitowitz. http://www.saitowitz.com/","link":"/2021/04/26/%E5%BB%BA%E7%AD%91%E5%AD%A6%E7%9A%84%E6%B2%BB%E6%84%88%E8%AE%BA/"},{"title":"世界是一面反观自己的镜子","text":"今天太阳很好，葡萄很好，苏打也很好 坐在阳台上，椅子很好，屁股也很舒服。 死亡什么的，轰然倒塌，爱情什么的，取之不尽，用之不竭 现在看来，这些城市和湖水，刚好可以满足。 今天是认真的，没过多久就回了房间 以前会待到天黑黑 以前总会感到难过","link":"/2021/05/15/%E4%B8%96%E7%95%8C%E6%98%AF%E4%B8%80%E9%9D%A2%E5%8F%8D%E8%A7%82%E7%9A%84%E9%95%9C%E5%AD%90/"},{"title":"霓虹推理文学史","text":"","link":"/2021/04/28/%E9%9C%93%E8%99%B9%E6%8E%A8%E7%90%86%E6%96%87%E5%AD%A6%E5%8F%B2/"},{"title":"About NFTs","text":"What is NFTNFT stands for non-fungible token.(即非同质化代币，一种架构在区块链上的加密货币) In economics, a fungible assert is something with units that can be readily interchanged, like money. NFTs are ‘one-of-a-kind’ asserts in the digital world that can be bought and sold like any other piece of property, but they have to tangible form of their own. The digital tokens can be thought of as certificates of ownership for virtual or physical asserts. With NFTs, Artwork can be ‘tokenized’ to create a digital certificate of ownership that can be bought and sold. PlatformsThe Platforms of NFT transactions are like SuperRare, Nifty Gateway, Foundation, MakersPlace, OpenSea, Rarible etc. As with crypto-currency, a record of who owns what is stored on a shared ledger known as the blockchain. NFTs can also contain smart contrasts that may give the artist, for example, a cut of any future sale of the token. Trending - DeFi (decentralized finance)Just kidding that: ‌Nowadays, technology makes money-laundrying much easier. I cannot believe you morons actually buy this shit. Artworks are like: The Weeknd ‘s new NFT song - The Source Flowers with Smiley Faces by Takashi Murakami McDo NFT Gucci NFT shoes","link":"/2021/04/12/%E8%81%8A%E8%81%8ANFT/"},{"title":"荔枝 伞 椰子壳","text":"在花瓣中间，更充沛的力气 让夜晚绵密，让胳膊长满露珠 免遭遗忘，备受恩宠，水潭的，墙体的 在条纹和彩色的时刻，老叶子和恬静的，曲线可爱、气味可口那样的指甲 竹篮里的芍药、荔枝、伞和椰子壳 海里的文具，海岸上的文具盒，内陆的纸张 也可以证实你的感受，出于迎接以及警卫的目的 为你多存在一会儿 孤独很肥 爱和金属无法修饰这些 一觉醒来 什么都不管","link":"/2021/05/17/%E8%8D%94%E6%9E%9D-%E4%BC%9E-%E6%A4%B0%E5%AD%90%E5%A3%B3/"}],"tags":[{"name":"microservices","slug":"microservices","link":"/tags/microservices/"},{"name":"MEDIUM","slug":"MEDIUM","link":"/tags/MEDIUM/"},{"name":"Alice Munro","slug":"Alice-Munro","link":"/tags/Alice-Munro/"},{"name":"VOGUE","slug":"VOGUE","link":"/tags/VOGUE/"},{"name":"career","slug":"career","link":"/tags/career/"},{"name":"introduction","slug":"introduction","link":"/tags/introduction/"},{"name":"solution","slug":"solution","link":"/tags/solution/"},{"name":"Paul Auster","slug":"Paul-Auster","link":"/tags/Paul-Auster/"},{"name":"novel","slug":"novel","link":"/tags/novel/"},{"name":"philosophy","slug":"philosophy","link":"/tags/philosophy/"},{"name":"poem","slug":"poem","link":"/tags/poem/"},{"name":"blue","slug":"blue","link":"/tags/blue/"},{"name":"blockchain","slug":"blockchain","link":"/tags/blockchain/"},{"name":"bookmarks","slug":"bookmarks","link":"/tags/bookmarks/"},{"name":"Ken Follett","slug":"Ken-Follett","link":"/tags/Ken-Follett/"},{"name":"linux","slug":"linux","link":"/tags/linux/"},{"name":"mediocre planet","slug":"mediocre-planet","link":"/tags/mediocre-planet/"},{"name":"short story","slug":"short-story","link":"/tags/short-story/"},{"name":"Too Much Happiness","slug":"Too-Much-Happiness","link":"/tags/Too-Much-Happiness/"},{"name":"architecture","slug":"architecture","link":"/tags/architecture/"},{"name":"art","slug":"art","link":"/tags/art/"},{"name":"detective fiction","slug":"detective-fiction","link":"/tags/detective-fiction/"},{"name":"marketing","slug":"marketing","link":"/tags/marketing/"},{"name":"fashion","slug":"fashion","link":"/tags/fashion/"}],"categories":[{"name":"Techo","slug":"Techo","link":"/categories/Techo/"},{"name":"Happy little capsules","slug":"Happy-little-capsules","link":"/categories/Happy-little-capsules/"},{"name":"Reverso","slug":"Reverso","link":"/categories/Reverso/"},{"name":"Freaking fabulous","slug":"Freaking-fabulous","link":"/categories/Freaking-fabulous/"},{"name":"Chasing the sunset","slug":"Chasing-the-sunset","link":"/categories/Chasing-the-sunset/"},{"name":"Promising the moon","slug":"Promising-the-moon","link":"/categories/Promising-the-moon/"}]}